<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Fonctions de recherche</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, xiphos, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de Xiphos :"><link rel="up" href="index.html" title="Manuel de Xiphos :"><link rel="prev" href="ar01s05.html" title="G&eacute;rer les modules"><link rel="next" href="ar01s07.html" title="Bloc-notes"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="search"></a>Fonctions de recherche</h2></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-searchpane"></a>Recherche simple</h3></div></div></div><p>Pour rechercher rapidement un mot ou une expression dans un module en cours d'utilisation, le plus simple est d'utiliser la fonction recherche du volet lat&eacute;ral. Cette fonction de recherche rapide est activ&eacute;e en s&eacute;lectionnant  le menu <span class="guimenuitem">&Eacute;diter</span> &#8594; <span class="guimenuitem">Rechercher</span> ou le bouton <span class="guibutton">Rechercher</span> du volet lat&eacute;ral.</p><div class="figure"><a name="d0e1877"></a><p class="title"><b>Figure&nbsp;31.&nbsp;La barre de recherche</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_searchpane.png" alt="La barre de recherche"></div></div></div></div><br class="figure-break"><p>Le formulaire <span class="interface">Rechercher</span> est constitu&eacute; des &eacute;l&eacute;ments suivants :</p><div class="itemizedlist"><ul type="disc"><li><p>Boite de saisie de l'expression &agrave; rechercher</p></li><li><p>S&eacute;lecteur du module objet de la requ&ecirc;te</p></li><li><p>S&eacute;lecteur du type de requ&ecirc;te</p></li><li><p>Case &agrave; cocher des options de la requ&ecirc;te</p></li><li><p>S&eacute;lecteur de la plage de versets</p></li><li><p>Affichage des r&eacute;sultats</p></li></ul></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-key"></a>Boite de saisie de l'expression &agrave; rechercher</h4></div></div></div><p>La boite d'entr&eacute;e permet de saisir l'expression &agrave; rechercher. Cette expression peut &ecirc;tre un mot, une partie de mot, plusieurs mots, une phrase, ou une expression rationnelle suivant le type de requ&ecirc;te s&eacute;lectionn&eacute;. Une fois l'expression &agrave; rechercher saisie, et les options d&eacute;finies, un clic sur le bouton <span class="guimenuitem">Rechercher</span> d&eacute;marre la s&eacute;quence de recherche.</p><p>Cette requ&ecirc;te employe la m&eacute;thode de recherche optimis&eacute;e (Voir la section suivante) &agrave; la condition que le module concern&eacute; ait &eacute;t&eacute; pr&eacute;c&eacute;demment index&eacute;, et utilisera le ET logique par d&eacute;faut (les versets doivent contenir tous les mots saisis)</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-modselect"></a>S&eacute;lecteur du module objet de la requ&ecirc;te</h4></div></div></div><p>Permet la s&eacute;lection du module dans lequel la requ&ecirc;te sera ex&eacute;cut&eacute;e. S&eacute;lectionner <span class="guimenuitem">Texte biblique</span> pour ex&eacute;cuter une requ&ecirc;te dans le texte biblique ou <span class="guimenuitem">Commentaire</span>  pour le module de commentaires. La requ&ecirc;te ne s'ex&eacute;cute que dans les modules en cours de consultation.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-typeselect"></a>S&eacute;lecteur du type de requ&ecirc;te</h4></div></div></div><p>Permet se s&eacute;lectionner le type de requ&ecirc;te. Trois types de requ&ecirc;te sont possibles :</p><div class="variablelist"><dl><dt><span class="term"><span class="guibutton">Mots multiples</span></span></dt><dd><p>La requ&ecirc;te  recherche n'importe quel verset contenant tous les mots de l'expression  &agrave; rechercher, quelque soit l'ordre dans lequel ils apparaissent dans le verset.</p></dd><dt><span class="term"><span class="guibutton">Expression rationnelle</span></span></dt><dd><p>L'expression &agrave; rechercher est une expression rationnelle. Une expression rationnelle est bas&eacute;e sur un langage et une syntaxe sp&eacute;cifiques permettant de retrouver un mot, une phrase &agrave; l'aide de combinaisons complexes. Par exemple l'expression rationnelle <strong class="userinput"><code>\ A[a-z]*iah </code></strong> permet de retrouver les passages qui contiennent les mots Aiah, Ahaziah, Athaliah et Amariah.</p><p>Un expos&eacute; complet de l'emploi des expressions rationnelles d&eacute;passe le cadre de ce manuel, mais cependant plus d'informations &agrave; ce sujet peuvent &ecirc;tre obtenues en parcourant le manuel de <span class="command"><strong>grep</strong></span>.</p></dd><dt><span class="term"><span class="guibutton">Phrase exacte</span></span></dt><dd><p>La requ&ecirc;te recherche la phrase exacte contenue dans l'expression &agrave; rechercher. Si la phrase &agrave; rechercher est <strong class="userinput"><code>en v&eacute;rit&eacute;</code></strong>, les passages obtenus contiendront &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>en v&eacute;rit&eacute;</em></span>&nbsp;&raquo;, mais pas &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>en</em></span> toute  <span class="emphasis"><em>v&eacute;rit&eacute;</em></span>&nbsp;&raquo;.</p></dd></dl></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-options"></a>Case &agrave; cocher des options de la requ&ecirc;te</h4></div></div></div><p>Permet de d&eacute;finir les options de recherche. L'option disponible est <span class="guimenuitem">Respecter la casse</span>. Cocher cette boite rend la recherche sensible &agrave; la casse des caract&egrave;res.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-scopeselect"></a>S&eacute;lecteur de la plage de versets</h4></div></div></div><p>Permet de d&eacute;finir la plage de versets &agrave; parcourir dans le module sp&eacute;cifi&eacute;. Trois plages de recherche sont possibles :</p><div class="variablelist"><dl><dt><span class="term"><span class="guibutton">Sans limites</span></span></dt><dd><p>S&eacute;lectionner ce bouton implique que la requ&ecirc;te s'ex&eacute;cute sur l'ensemble des versets.</p></dd><dt><span class="term"><span class="guibutton">Limites d&eacute;finies</span></span></dt><dd><p>S&eacute;lectionner ce bouton provoque l'ouverture de deux zones suppl&eacute;mentaires permettant la saisie des limites de la recherche. La premi&egrave;re r&eacute;f&eacute;rence, d&eacute;but de la recherche, est &agrave; saisir dans la limite <span class="guilabel">Basse</span> et la deuxi&egrave;me r&eacute;f&eacute;rence, fin de la recherche, dans la limite <span class="guilabel">Haute</span>. La requ&ecirc;te commencera au verset indiqu&eacute; dans la limite <span class="guilabel">Basse</span> et se terminera au verset indiqu&eacute; dans la limite <span class="guilabel">Haute</span> en incluant tous les versets situ&eacute;s entre les deux limites.</p><p>Des num&eacute;ros de chapitres ou de versets peuvent aussi &ecirc;tre saisis dans les deux zones basse et haute  afin de mieux cibler la recherche.</p></dd><dt><span class="term"><span class="guibutton">Derni&egrave;re requ&ecirc;te</span></span></dt><dd><p>S&eacute;lectionner ce bouton pour relancer une recherche uniquement sur les  versets retourn&eacute;s en r&eacute;sultat de la requ&ecirc;te pr&eacute;c&eacute;dente. Utilis&eacute;e avec une nouvelle expression, cette m&eacute;thode permet de r&eacute;duire la liste des versets restitu&eacute;s.</p></dd></dl></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-search-results"></a>Affichage des r&eacute;sultats</h4></div></div></div><p>La liste des r&eacute;sultats est affich&eacute;e permettant d'obtenir un aper&ccedil;u du verset retourn&eacute;, la navigation vers le chap&icirc;tre concern&eacute; ou l'enregistrement sous forme de signets.</p><div class="variablelist"><dl><dt><span class="term">Aper&ccedil;u</span></dt><dd><p>Pour visualiser le r&eacute;sultat, un simple clic sur un &eacute;l&eacute;ment affiche le contenu dans le volet <span class="interface">Aper&ccedil;u</span></p></dd><dt><span class="term">Navigation</span></dt><dd><p>La navigation vers le chap&icirc;tre concern&eacute; pour retrouver le contexte s'effectue de deux mani&egrave;res. Un clic du bouton milieu de la souris ouvre le verset dans un nouvel onglet, un double-clic l'ouvre dans l'onget courant.</p></dd><dt><span class="term">Enregistrer les r&eacute;sultats</span></dt><dd><p>Les r&eacute;sultats de la requ&ecirc;te peuvent &ecirc;tre enregistr&eacute;s sous forme de signets. Dans le menu contextuel obtenu &agrave; l'aide du bouton droit de la souris, s&eacute;lectionner <span class="guilabel">Convertir en signets</span>, il sera alors demand&eacute; le nom du dossier sous lequel la liste sera enregistr&eacute;e. Ensuite, une fois la liste sauvegard&eacute;e, il devient possible de retrouver les r&eacute;sultats de la requ&ecirc;te en affichant les signets puis en choisissant le dossier pr&eacute;c&eacute;demment nomm&eacute;.</p></dd></dl></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-advanced-search"></a>Recherche avanc&eacute;e</h3></div></div></div><p>Des recherches plus &eacute;labor&eacute;es peuvent n&eacute;cessiter l'utilisation de la fonction de recherche avanc&eacute;e. La recherche avanc&eacute;e est activ&eacute;e par l'utilisation du  menu <span class="guimenuitem">&Eacute;diter</span> &#8594; <span class="guimenuitem">Recherche avanc&eacute;e</span>.</p><div class="figure"><a name="d0e2070"></a><p class="title"><b>Figure&nbsp;32.&nbsp;La fen&ecirc;tre de recherche avanc&eacute;e</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/search_search.png" alt="La fen&ecirc;tre de recherche avanc&eacute;e"></div></div></div></div><br class="figure-break"><p>La <span class="guimenuitem">Recherche avanc&eacute;e</span> permet de construire  des requ&ecirc;tes plus &eacute;labor&eacute;es. Les  limites du texte et les listes de modules peuvent &ecirc;tre  enregistr&eacute;es pour servir ult&eacute;rieurement. Les requ&ecirc;tes peuvent s'effectuer sur les attributs du texte comme les notes de bas de page ou les r&eacute;f&eacute;rences de Strong des dictionnaires grec et h&eacute;breu.</p><p>La requ&ecirc;te par d&eacute;faut est de type multi-mots, une recherche quelque peu lente et rustique. Une requ&ecirc;te optimis&eacute;e bas&eacute;e sur Lucene, un moteur de recherche libre qui permet d'indexer et de rechercher du texte est &eacute;galement disponible. Avant d'utiliser les requ&ecirc;tes optimis&eacute;es, il est cependant n&eacute;cessaire d'indexer les modules, comme indiqu&eacute; dans la section &laquo; G&eacute;rer les modules &raquo; de ce manuel. Quelques exemples suivent d&eacute;montrant la puissance des requ&ecirc;tes optimis&eacute;es Lucene (Les r&eacute;f&eacute;rences de la syntaxe Lucene sont disponible sur internet) :</p><p>Requ&ecirc;tes simples : saisir simplement les mots recherch&eacute;s. Pour obtenir seulement les versets contenant tous les mots, il suffit de faire pr&eacute;c&eacute;der les mots du signe &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>+</em></span>&nbsp;&raquo;. Ainsi la requ&ecirc;te &laquo;&nbsp;<span class="emphasis"><em>+L'Eternel +mon +berger</em></span>&nbsp;&raquo; trouve le Psaume 23. Pour rechercher une phrase enti&egrave;re, il suffit de l'entourer de guillemets, comme dans "&nbsp;<span class="emphasis"><em>Il me fait reposer dans de verts p&acirc;turages</em></span>&nbsp;".</p><p>Caract&egrave;re de substitution unique (&nbsp;?&nbsp;) : Le &laquo;&shy;&shy;&nbsp;?&nbsp;&raquo; repr&eacute;sente un caract&egrave;re quelconque. Par exemple, &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>cri?</em></span>&nbsp;&raquo; permet de rechercher &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>cris</em></span>&nbsp;&raquo;, &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>crie</em></span>&nbsp;&raquo;,&middot;&laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>cri&eacute;</em></span>&nbsp;&raquo; etc.. Ceci est pratique pour retrouver les noms qui peuvent avoir plusieurs &eacute;critures ainsi, &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>?sa&iuml;e</em></span>&nbsp;&raquo; retrouvera &laquo;&shy;&shy;&nbsp;Esa&iuml;e&nbsp;&raquo; ou &laquo;&shy;&shy;&nbsp;Isa&iuml;e&nbsp;&raquo;</p><p>Caract&egrave;re de substitution multiple (&nbsp;*&nbsp;) : &laquo;&nbsp;*&nbsp;&raquo; remplace toute une s&eacute;rie de caract&egrave;res. Ainsi &laquo;&nbsp;<span class="emphasis"><em>proph*</em></span>&nbsp;&raquo; retrouve &laquo;&nbsp;proph&egrave;te&nbsp;&raquo;, &laquo;&nbsp;proph&eacute;tiser&nbsp;&raquo;, &laquo;&nbsp;proph&eacute;tie&nbsp;&raquo; etc..</p><p>Syntaxe AND : Dans la recherche avanc&eacute;e, pour retourner les r&eacute;sultats pour tous les termes d'une requ&ecirc;te, il est n&eacute;cessaire de placer l'op&eacute;rateur logique &laquo;&nbsp;<span class="emphasis"><em>AND</em></span>&nbsp;&raquo; entre les termes. Ainsi pour retrouver les occurences de &laquo;&nbsp;Isa&iuml;e&nbsp;&raquo; ou &laquo;&nbsp;Esa&iuml;e&nbsp;&raquo; qui font mention &eacute;galement de &laquo;&nbsp;proph&egrave;te&nbsp;&raquo; ou &laquo;&nbsp;proph&eacute;tie&nbsp;&raquo;, la requ&ecirc;te appropri&eacute;e est &laquo;&nbsp;<span class="emphasis"><em>?sa&iuml;e AND proph*</em></span>&nbsp;&raquo;.</p><p>Par d&eacute;faut, deux plages de versets sont d&eacute;finies, correspondant &agrave; l'Ancien Testament et au Nouveau Testament. D'autres limites peuvent &ecirc;tre d&eacute;finies &agrave; volont&eacute; par l'utilisateur comme par exemple les &laquo;&shy;&shy;&nbsp;&Eacute;vangiles&nbsp;&raquo; ou les &laquo;&shy;&shy;&nbsp;&Eacute;p&icirc;tres de Paul&nbsp;&raquo;. Une liste des modules contenant seulement le premier module de texte biblique install&eacute; est d&eacute;finie par d&eacute;faut. Si besoin, de nouvelles requ&ecirc;tes peuvent &ecirc;tre r&eacute;alis&eacute;s sur la plage des versets obtenu par la requ&ecirc;te pr&eacute;c&eacute;dente. Des listes de modules peuvent &ecirc;tre cr&eacute;es en incluant tout module, ce qui permet d'ex&eacute;cuter des requ&ecirc;tes sur les livres ou les dictionnaires, dans n'importe quelle combinaison.</p><p>Noter la bulle d'aide dans la capture d'&eacute;cran ci-dessus, Cette option est utilis&eacute;e pour ex&eacute;cuter des requ&ecirc;tes sur les attributs relatifs &agrave; des versets et non sur le contenu des versets. Les attributs sont par exemple les notes de bas de page ou les nombres de Strong grec et h&eacute;breu. Si cette option est s&eacute;lectionn&eacute;e, les qualificatifs d'attribut doivent &ecirc;tre saisis dans  l'onglet Attribut, situ&eacute; &agrave; droite des autres onglets. Les r&eacute;f&eacute;rences de Strong  sont identifi&eacute;es par le nombre de Strong pr&eacute;c&eacute;d&eacute; par la lettre H (H&eacute;breu) ou la lettre G (Grec). Ainsi une requ&ecirc;te sur le nombre de Strong grec n&deg; 140, en utilisant &laquo;&shy;&shy;&nbsp;G140&nbsp;&raquo;, retourne  Matthieu 12:18 comme r&eacute;sultat.</p><p>Si vos modules sont index&eacute;s, il existe un moyen beaucoup plus rapide pour rechercher des r&eacute;f&eacute;rences de Strong. Une requ&ecirc;te doit &ecirc;tre pr&eacute;c&eacute;d&eacute;e du mot &laquo;&nbsp;<span class="emphasis"><em>lemma</em></span>&nbsp;&raquo;, par exemple pour rechercher le nombre de Strong grec 140, saisir &laquo;&nbsp;<span class="emphasis"><em>lemma:G140</em></span>&nbsp;&raquo;. Le bouton radio <span class="guibutton">Optimis&eacute;e Lucene</span> doit &ecirc;tre s&eacute;lectionn&eacute; pour que cette requ&ecirc;te fonctionne.</p><p>Comme sp&eacute;cifi&eacute; dans l'infobulle, le bouton <span class="guibutton">Rechercher</span> stoppe aussi une requ&ecirc;te en cours d'ex&eacute;cution.</p><p>Les r&eacute;sultats sont affich&eacute;s dans l'onglet <span class="interface">R&eacute;sultats</span>. Pour inclure les nombres de Strong, les &eacute;tiquettes morphologiques ou les notes de bas de page, s&eacute;lectionner ces options dans l'onglet <span class="interface">Attributs</span>. Un simple clic sur un r&eacute;sultat affiche le contenu dans le volet <span class="interface">Aper&ccedil;u</span> de la fen&ecirc;tre <span class="interface">Recherche Avanc&eacute;e</span>. Un survol des nombres de Strong, &eacute;tiquettes morphologiques ou notes de bas de page affiche le contenu dans le volet <span class="interface">Aper&ccedil;u</span> de la fen&ecirc;tre principale. Un double-clic fait naviguer l'onglet courant &agrave; la portion du texte contenant le r&eacute;sultat, ceci s'applique &eacute;galement aux commentaires et aux livres &agrave; la condition que ces volets soient visibles.</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Avertissement</h3><p>Les changements d'options (&eacute;tendue de la recherche, modules &agrave; rechercher, etc) dans la fen&ecirc;tre de recherche avanc&eacute;e sont report&eacute;s au niveau des options de la recherche simple du <span class="interface">volet lat&eacute;ral</span> mais pas l'inverse.</p></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="hdbk-op-search-dialog-text-regexp"></a>Syntaxe des expressions rationnelles utilis&eacute;es en cl&eacute; de recherche</h3></div></div></div><p>La recherche au moyen d'expressions rationnelles permet d'effectuer des recherches simples ou complexes sur des cha&icirc;nes de caract&egrave;res qui correspondent &agrave; un motif ou un ensemble de motifs s&eacute;par&eacute;s par une barre verticale &laquo;&shy;&shy;&nbsp;|&nbsp;&raquo;. Alors qu'un motif peut &ecirc;tre cr&eacute;e pour rechercher un mot ou une phrase, un motif simple compos&eacute; d'un seul mot ne permettra pas de rechercher seulement ce mot, mais toute s&eacute;quence de caract&egrave;res contenant ce mot. Une recherche du mot &laquo;&shy;&shy;&nbsp;droit&nbsp;&raquo; ne retournera pas seulement la liste des versets contenant le mot &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>droit</em></span>&nbsp;&raquo;  mais aussi ceux contenant les mots &laquo;&shy;&shy;&nbsp;a<span class="emphasis"><em>droit</em></span>&nbsp;&raquo;, &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>droit</em></span>e&nbsp;&raquo;. La recherche de &laquo;&shy;&shy;&nbsp;ne pas&nbsp;&raquo; ne retournera pas les versets contenant les mots &laquo;&shy;&shy;&nbsp;ne&nbsp;&raquo; ET &laquo;&shy;&shy;&nbsp;pas&nbsp;&raquo; mais les versets contenant la s&eacute;quence &laquo;&shy;&shy;&nbsp;ne pas&nbsp;&raquo; avec une espace entre les deux mots. Une recherche de &laquo;&shy;&shy;&nbsp;ne pas&nbsp;&raquo; trouvera aussi les versets contenant &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>ne pas</em></span>se&nbsp;&raquo;.</p><p>La puissance des expressions rationnelles provient des motifs utilis&eacute;s pour d&eacute;finir une recherche. Un motif est constitu&eacute; de caract&egrave;res ordinaires  et de quelques caract&egrave;res  sp&eacute;ciaux qui sont interpr&eacute;t&eacute;s suivant des r&egrave;gles pr&eacute;cises. Les caract&egrave;res sp&eacute;ciaux sont \[^*$?+. Les autres caract&egrave;res sont des caract&egrave;res ordinaires. L'antislash &laquo;&shy;&shy;&nbsp;\&nbsp;&raquo;, est utilis&eacute; pour convertir les caract&egrave;res sp&eacute;ciaux en caract&egrave;res ordinaires et inversement les caract&egrave;res ordinaires en caract&egrave;res sp&eacute;ciaux.</p><p>Exemple : le motif &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>.amour\.</em></span>&nbsp;&raquo; retournera les phrases qui se terminent par &laquo;&shy;&shy;&nbsp;s<span class="emphasis"><em>o</em></span>n <span class="emphasis"><em>amour</em></span>&nbsp;&raquo; ou &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>l</em></span>'<span class="emphasis"><em>amour</em></span>&nbsp;&raquo; ou &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>d</em></span>'<span class="emphasis"><em>amour</em></span>&nbsp;&raquo; suivi d'un point. Le premier point dans <span class="emphasis"><em>.amour\.</em></span> est un caract&egrave;re sp&eacute;cial dont la signification est de remplacer n'importe quel caract&egrave;re &agrave; cette position. L'antislash dans <span class="emphasis"><em>.amour\.</em></span> indique que le point  suivant ne doit pas &ecirc;tre consid&eacute;r&eacute; comme un caract&egrave;re sp&eacute;cial, mais comme un point ordinaire.</p><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="hdbk-op-search-dialog-text-regexp-rules"></a>R&egrave;gles des requ&ecirc;tes de recherche &agrave; l'aide des expressions rationnelles</h4></div></div></div><div class="itemizedlist"><ul type="disc"><li><p>&laquo;&shy;&shy;&nbsp;.&nbsp;&raquo; Le point remplace n'importe quel caract&egrave;re.</p></li><li><p>&laquo;&shy;&shy;&nbsp;*&nbsp;&raquo; L'ast&eacute;risque correspond &agrave; toute r&eacute;p&eacute;tition de caract&egrave;res d'une cha&icirc;ne ou d'une expression rationnelle la pr&eacute;c&eacute;dant, incluant z&eacute;ro caract&egrave;re.</p></li><li><p>&laquo;&shy;&shy;&nbsp;+&nbsp;&raquo; Le signe plus correspond &agrave; une r&eacute;p&eacute;tition ou plus de la pr&eacute;c&eacute;dente expression r&eacute;guli&egrave;re. Il joue un r&ocirc;le similaire &agrave; &laquo;&shy;&shy;&nbsp;*&nbsp;&raquo; (ast&eacute;risque), mais ne correspond pas &agrave; z&eacute;ro occurrence.</p></li><li><p>&laquo;&shy;&shy;&nbsp;?&nbsp;&raquo; Le point d'interrogation correspond &agrave; aucune ou une instance de la pr&eacute;c&eacute;dente expression rationnelle. Il est g&eacute;n&eacute;ralement utilis&eacute; pour correspondre &agrave; des caract&egrave;res uniques.</p></li><li><p>&laquo;&shy;&shy;&nbsp;[...]&nbsp;&raquo; Les crochets englobent un ensemble de caract&egrave;res pour r&eacute;aliser une correspondance dans une seule expression rationnelle.</p></li><li><p>&laquo;&shy;&shy;&nbsp;^&nbsp;&raquo; La puissance comme premier caract&egrave;re &agrave; l'int&eacute;rieur d'accolades inverse la signification de l'ensemble des caract&egrave;res de  l'expression rationnelle.</p></li><li><p>&laquo;&shy;&shy;&nbsp;^&nbsp;&raquo; La puissance en dehors d'accolades correspond au d&eacute;but d'une ligne.</p></li><li><p>&laquo;&shy;&shy;&nbsp;$&nbsp;&raquo; Le signe dollar &agrave; la fin d'une expression rationnelle correspond &agrave; la fin d'une ligne.</p></li><li><p>&laquo;&shy;&shy;&nbsp;|&nbsp;&raquo; La barre verticale signifie OU logique</p></li><li><p>&laquo;&shy;&shy;&nbsp;()&nbsp;&raquo; Les parenth&egrave;ses servent &agrave; regrouper des expressions. <span class="emphasis"><em>Non support&eacute; dans Xiphos</em></span></p></li><li><p>&laquo;&shy;&shy;&nbsp;\&nbsp;&raquo; L'antislash &eacute;chappe un caract&egrave;re sp&eacute;cial, ce qui signifie que le caract&egrave;re est interpr&eacute;t&eacute; litt&eacute;ralement.</p></li><li><p>&laquo;&shy;&shy;&nbsp;\&nbsp;&raquo; L'antislash utilis&eacute; devant un caract&egrave;re ordinaire, le transforme en caract&egrave;re sp&eacute;cial..</p></li></ul></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="period"></a>Le point</h5></div></div></div><p>Le point &laquo;&shy;&shy;&nbsp;.&nbsp;&raquo; remplace n'importe quel caract&egrave;re y compris l'espace et d'autres caract&egrave;res non alphab&eacute;tiques. Par exemple : &laquo;&shy;&shy;&nbsp;13.&nbsp;&raquo; correspond &agrave; 13 plus au moins un caract&egrave;re (incluant une espace), ce qui retourne 1133, 11333 mais pas 13 (un caract&egrave;re suppl&eacute;mentaire est manquant).</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="asterisk"></a>L'ast&eacute;risque</h5></div></div></div><p>L'ast&eacute;risque &laquo;&shy;&shy;&nbsp;*&nbsp;&raquo; correspond &agrave; toute r&eacute;p&eacute;tition de caract&egrave;res d'une cha&icirc;ne ou d'une expression rationnelle la pr&eacute;c&eacute;dant, incluant z&eacute;ro caract&egrave;re. Par exemple : &laquo;&shy;&shy;&nbsp;1133*&nbsp;&raquo; correspond &agrave; 11 plus un ou plus de 3 ainsi que d'autres caract&egrave;res : 113, 1133, 111312 et ainsi de suite.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="plus"></a>Le signe plus</h5></div></div></div><p>Le signe plus &laquo;&shy;&shy;&nbsp;+&nbsp;&raquo; correspond &agrave; une r&eacute;p&eacute;tition ou plus de la pr&eacute;c&eacute;dente expression rationnelle. Il joue un r&ocirc;le similaire &agrave; &laquo;&shy;&shy;&nbsp;*&nbsp;&raquo; (ast&eacute;risque), mais ne correspond pas &agrave; z&eacute;ro occurrence.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="question"></a>Le point d'interrogation.</h5></div></div></div><p>Le point d'interrogation &laquo;&shy;&shy;&nbsp;?&nbsp;&raquo; correspond &agrave; aucune ou &agrave; une instance au&middot;plus&middot;de la pr&eacute;c&eacute;dente expression rationnelle. Il est g&eacute;n&eacute;ralement utilis&eacute; pour correspondre &agrave; des caract&egrave;res uniques.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="bracket"></a>Les crochets</h5></div></div></div><p>Les crochets &laquo;&shy;&shy;&nbsp;[...]&nbsp;&raquo; englobent un ensemble de caract&egrave;res pour r&eacute;aliser une correspondance dans une seule expression rationnelle. &laquo;&shy;&shy;&nbsp;[xyz]&nbsp;&raquo; correspond aux caract&egrave;res x, y ou z. &laquo;&shy;&shy;&nbsp;[c-n]&nbsp;&raquo; correspond &agrave; tout caract&egrave;re compris entre c et n. &laquo;&shy;&shy;&nbsp;[B-Pk-y]&nbsp;&raquo; correspond &agrave; tout caract&egrave;re compris entre B et P et entre k et y. &laquo;&shy;&shy;&nbsp;[a-z0-9]&nbsp;&raquo; correspond &agrave; toute lettre en minuscule et &agrave; tout chiffre. &laquo;&shy;&shy;&nbsp;[^b-d]&nbsp;&raquo; correspond &agrave; tous les caract&egrave;res sauf ceux compris entre b et d. Ceci est un exemple de l'inversion de la signification de l'expression rationnelle suivante gr&acirc;ce &agrave; l'op&eacute;rateur &laquo;&shy;&shy;&nbsp;^&nbsp;&raquo; (prenant le m&ecirc;me r&ocirc;le que &laquo;&shy;&shy;&nbsp;!&nbsp;&raquo; dans un contexte diff&eacute;rent). Les s&eacute;quences combin&eacute;es de caract&egrave;res entre crochets correspondent &agrave; des mod&egrave;les de mots communs. &laquo;&shy;&shy;&nbsp;[Oo][Uu][Ii]&nbsp;&raquo; correspond &agrave; oui, Oui, OUI, oUi et ainsi de suite. </p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="caret"></a>La puissance en premier caract&egrave;re entre des crochets</h5></div></div></div><p>Si la puissance &laquo;&shy;&shy;&nbsp;^&nbsp;&raquo; est le premier caract&egrave;re d'une expression entre crochets, il  inverse la signification de l'ensemble des caract&egrave;res de l'expression rationnelle.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="caret-s"></a>La puissance correspond au d&eacute;but d'une ligne</h5></div></div></div><p>La puissance &laquo;&shy;&shy;&nbsp;^&nbsp;&raquo; correspond au d&eacute;but d'une ligne. Toutes les r&eacute;ponses correspondront au d&eacute;but d'une ligne comportant la s&eacute;quence recherch&eacute;e. Cependant, comme certains modules de textes contiennent des caract&egrave;res non filtr&eacute;s en d&eacute;but de ligne, cette fonction ne retourne pas toujours les r&eacute;sultats escompt&eacute;s. Ajouter quelques points apr&egrave;s la puissance, permet de contourner le d&eacute;faut de format de certains textes. &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>^Au commencement</em></span>&nbsp;&raquo; recherche les phrases commen&ccedil;ant par &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Au commencement</em></span>&nbsp;&raquo;. (Mais il est pr&eacute;f&eacute;rable d'utiliser : &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>^....Au commencement</em></span>&nbsp;&raquo;).</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="dollar"></a>Le signe dollar recherche en fin de ligne</h5></div></div></div><p>Le signe dollar &laquo;&shy;&shy;&nbsp;$&nbsp;&raquo; &agrave; la fin d'une expression r&eacute;guli&egrave;re correspond &agrave; la fin d'une ligne. &laquo;&shy;&shy;&nbsp;XXX$&nbsp;&raquo; correspond &agrave; XXX &agrave; la fin d'une ligne. &laquo;&shy;&shy;&nbsp;^$&nbsp;&raquo; correspond &agrave; des lignes blanches. Cependant, comme certains modules de textes contiennent des caract&egrave;res non filtr&eacute;s en fin de ligne, cette fonction ne retourne pas toujours les r&eacute;sultats escompt&eacute;s. Ajouter quelques points apr&egrave;s le dollar, permet de contourner ce d&eacute;faut de format de certains textes. &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Amen\.$</em></span>&nbsp;&raquo; retourne les phrases qui se terminent par &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Amen.</em></span>&nbsp;&raquo; (Il est pr&eacute;f&eacute;rable d'utiliser &laquo;&shy;&shy;&nbsp;Amen\....$&nbsp;&raquo;, &laquo;Amen\..........$&nbsp;&raquo;, ou m&ecirc;me &laquo;&shy;&shy;&nbsp;Amen\....................$&nbsp;&raquo;).</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="bar"></a>La barre verticale</h5></div></div></div><p>La barre verticale &laquo;&shy;&shy;&nbsp;|&nbsp;&raquo; correspond &agrave; l'op&eacute;rateur logique OU et permet donc de d&eacute;finir une alternative. &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Jean | Pierre</em></span>&nbsp;&raquo; retrouve les phrases contenant &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Jean</em></span>&nbsp;&raquo; ou &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Pierre</em></span>&nbsp;&raquo;. De m&ecirc;me, &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em> Jean.*Pierre | Pierre.*Jean</em></span>&nbsp;&raquo; retourne &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Jean</em></span> ... <span class="emphasis"><em>Pierre</em></span>&nbsp;&raquo; ou &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>Pierre</em></span> ... <span class="emphasis"><em>Jean</em></span>&nbsp;&raquo;. (* ralentit la recherche). &laquo;&shy;&shy;&nbsp;<span class="emphasis"><em>douleur | souffrance | tourment</em></span>&nbsp;&raquo; retourne <span class="emphasis"><em>douleur</em></span> ou <span class="emphasis"><em>souffrance</em></span> ou <span class="emphasis"><em>tourment</em></span>.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="parenth"></a>Les parenth&egrave;ses</h5></div></div></div><p><span class="emphasis"><em>L'usage des parenth&egrave;ses &laquo;&shy;&shy;&nbsp;()&nbsp;&raquo; n'est pas pr&eacute;vu.</em></span></p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="backslash"></a>L'antislash pr&eacute;c&eacute;dant un caract&egrave;re sp&eacute;cial</h5></div></div></div><p>L'antislash pr&eacute;c&eacute;dant un caract&egrave;re sp&eacute;cial &laquo;&shy;&shy;&nbsp;\*&nbsp;&raquo; indique que ce caract&egrave;re n'a plus de signification sp&eacute;ciale, mais devient un caract&egrave;re ordinaire. <span class="emphasis"><em>amen\.</em></span> retourne <span class="emphasis"><em>amen.</em></span> mais pas <span class="emphasis"><em>amen</em></span>t et ne trouvera donc pas firm<span class="emphasis"><em>amen</em></span>t.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="backslash-o"></a>L'antislash pr&eacute;c&eacute;dant un caract&egrave;re ordinaire</h5></div></div></div><p>L'antislash pr&eacute;c&eacute;dant un caract&egrave;re ordinaire &laquo;&shy;&shy;&nbsp;\o&nbsp;&raquo; indique que ce caract&egrave;re n'est plus utilis&eacute; comme tel mais prend une signification sp&eacute;ciale.</p><div class="itemizedlist"><ul type="disc"><li><p>\b ce symbole d'ancrage indique une limite de mot obligatoire, &agrave; l'endroit o&ugrave; il est ins&eacute;r&eacute; dans le motif. Par contre, s'il est utilis&eacute; entre crochets, il correspond au caract&egrave;re &laquo;&shy;&shy;&nbsp;retour arri&egrave;re&nbsp;&raquo;. <span class="emphasis"><em>\bjuste\b</em></span> retourne <span class="emphasis"><em>juste</em></span> mais pas in<span class="emphasis"><em>juste</em></span> ou <span class="emphasis"><em>juste</em></span>sse.</p></li><li><p>\B indique qu'il n'y a pas de limite de mot <span class="emphasis"><em>\Bleur\B</em></span> trouve cha<span class="emphasis"><em>leur</em></span>euse mais pas cha<span class="emphasis"><em>leur</em></span> ou <span class="emphasis"><em>leur</em></span>re.</p></li><li><p>\d repr&eacute;sente un chiffre, identique &agrave; [0-9].</p></li><li><p>\D signifie non-num&eacute;rique, identique &agrave; [^0-9].</p></li><li><p>\s repr&eacute;sente une espace.</p></li><li><p>\S signifie pas d'espace.</p></li><li><p>\w signifie alphanum&eacute;rique, identique &agrave; [a-zA-Z0-9_].</p></li><li><p>\W signifie non alphanum&eacute;rique, identique &agrave; [^a-zA-Z0-9_].</p></li></ul></div></div></div></div></div></body></html>