<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Commentaires personnels</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, xiphos, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de Xiphos :"><link rel="up" href="index.html" title="Manuel de Xiphos :"><link rel="prev" href="ar01s07.html" title="Bloc-notes"><link rel="next" href="ar01s09.html" title="Listes de pri&egrave;res et notes"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="personal"></a>Commentaires personnels</h2></div></div></div><p>&Eacute;crire son propre commentaire personnel n&eacute;cessite l'utilisation du module Sword &laquo;&shy;&shy;&nbsp;Personal&nbsp;&raquo;. Pour utiliser ce module, s&eacute;lectionner le bouton <span class="guibutton">Modules</span> du volet lat&eacute;ral, puis choisir ensuite <span class="guimenuitem">Commentaires</span> &#8594; <span class="guimenuitem">English</span> &#8594; <span class="guimenuitem">+*Personal*+</span>. Pour modifier ses commentaires, faire un clic du bouton droit &agrave; l'aide de la souris sur la fen&ecirc;tre des commentaires, puis s&eacute;lectionner <span class="guimenuitem">&Eacute;diter</span> &#8594; <span class="guimenuitem">Note</span> &#8594; <span class="guimenuitem">+*Personal*+</span>.</p><p>Un &eacute;diteur semblable au<span class="guimenuitem"> bloc-notes </span> va appara&icirc;tre. Votre commentaire est &agrave; &eacute;diter puis &agrave; enregistrer. Il appara&icirc;tra plus tard comme commentaire personnel au verset correspondant.</p><div class="figure"><a name="d0e2542"></a><p class="title"><b>Figure&nbsp;34.&nbsp;L'&eacute;diteur de commentaires personnels</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/personal.png" alt="Commentaires personnels"></div></div></div></div><br class="figure-break"><p>Barre d'emplacement</p><div class="itemizedlist"><ul type="disc"><li><p>Bouton de synchronisation</p></li><li><p>S&eacute;lecteurs de livres, chapitres et versets de la Bible</p></li><li><p>R&eacute;f&eacute;rence de l'emplacement</p></li></ul></div><p>Le bouton <span class="guimenuitem">Synchroniser</span> permet de  remplacer  l'adresse du verset affich&eacute; par celle du verset en cours  dans le volet des<span class="interface"> textes bibliques</span>.  Sinon, l'utilisation des s&eacute;lecteurs de <span class="guimenuitem">Livre</span>, <span class="guimenuitem">Chapitre</span>, <span class="guimenuitem">Verset</span> permet  d'&eacute;diter le commentaire d'un autre verset.</p><p>Barre d'outils 1</p><div class="itemizedlist"><ul type="disc"><li><p>Taille de police</p></li><li><p>Type de plice</p></li><li><p>Gras, italique, soulign&eacute;, barr&eacute;</p></li><li><p>Align&eacute; &agrave; gauche, au centre et &agrave;droite</p></li><li><p>D&eacute;calage d'un paragraphe &agrave; droite ou &agrave; gauche</p></li><li><p>Choix des couleurs</p></li></ul></div><p>Barre d'outils 2</p><div class="itemizedlist"><ul type="disc"><li><p>Enregistre, supprime et imprime</p></li><li><p>Couper, copier, coller et d&eacute;faire</p></li><li><p>Chercher et remplacer</p></li><li><p>V&eacute;rification de l'orthographe</p></li></ul></div><p>Pour activer la v&eacute;rification orthographique, un des langages du menu <span class="guisubmenu">&Eacute;diter</span> &#8594; <span class="guimenuitem">Langues actuelles</span> doit &ecirc;tre s&eacute;lectionn&eacute;.</p><p>Pour cr&eacute;er un lien vers d'autres versets, faire un clic droit &agrave; l'aide de la souris sur la partie texte. Puis dans le menu contextuel qui s'affiche, choisir <span class="guimenuitem">Lien</span>, saisir ensuite l'adresse et le nom du module &agrave; lier.</p><p>Le nom du commentaire personnel peut &ecirc;tre modifi&eacute; de fa&ccedil;on &agrave; l'accorder &agrave; une &eacute;tude ou un sujet particulier. Il est ainsi possible de disposer de plusieurs commentaires personnels de la fa&ccedil;on suivante : renommer premi&egrave;rement le commentaire personnel en cours, puis ensuite r&eacute;-installer le module de commentaire personnel standard (Personal), et ainsi de suite. Note : les nouveaux noms de commentaires personnels ne peuvent contenir que des lettres et des chiffres, et ne doivent pas &ecirc;tre identiques au nom d'un autre module existant. Un clic du bouton droit de la souris dans le volet <span class="interface">Commentaire</span> fait appara&icirc;tre le menu contextuel permettant de renommer le commentaire personnel.</p><p>Si une &eacute;tude faisant partie d'un commentaire personnel n'est plus utile, il est possible, avant de la supprimer, d'archiver le commentaire personnel &agrave; l'aide du gestionnaire de modules, ceci permettra &eacute;ventuellement de le r&eacute;installer plus tard. Utiliser pour cela le bouton <span class="guibutton">Archiver</span> du volet <span class="guimenu">G&eacute;rer</span> du gestionnaire de modules. Tout type de module peut &ecirc;tre archiv&eacute;, l'archivage n'est pas r&eacute;serv&eacute; aux  commentaires personnels.</p><p>Bien que dans le sch&eacute;ma de versification le plus courant la Bible compte 31192 versets, il est peu probable que plus d'une petite fraction de l'ensemble des versets contienne des commentaires personnels. Une liste signalant les versets avec commentaire personnel s'obtient &agrave; l'aide du choix <span class="guimenuitem">Liste des versets comment&eacute;s</span> du menu contextuel obtenu par un clic droit de la souris.</p><div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Astuce</h3><p>Le commentaire cr&eacute;e sera associ&eacute; &agrave; un verset seulement. Pour &eacute;crire des commentaires rattach&eacute;s &agrave; de plus longues portions de texte, utiliser la fonction <span class="guimenuitem">Lien</span> pour relier les commentaires entre eux.</p></div></div></body></html>