<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&Eacute;tude des textes originaux</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, gnomesword, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de GnomeSword :"><link rel="up" href="index.html" title="Manuel de GnomeSword :"><link rel="prev" href="ar01s10.html" title="Obtenir de l'aide en ligne"><link rel="next" href="ar01s12.html" title="Auteurs"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="originallanguage"></a>&Eacute;tude des textes originaux</h2></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="orig-lang-install-modules"></a>Installer les modules n&eacute;cessaires</h3></div></div></div><p>Gnomesword convient parfaitement &agrave; l'&eacute;tude des textes originaux en grec ou h&eacute;breu. Pour d&eacute;marrer, il est recommand&eacute; d'installer les modules suivants :</p><p>D&eacute;pot Crosswire</p><div class="itemizedlist"><ul type="disc"><li><p>Dictionnaire StrongsHebrew (ou le StrongsRealHebrew du d&eacute;pot GnomeSword)</p><p>[NDT : dictionnaires en langue anglaise]</p></li><li><p>Dictionnaire StrongsGreek (ou le StrongsRealGreek du d&eacute;pot GnomeSword)</p><p>[NDT : dictionnaires en langue anglaise]</p></li><li><p>Dictionnaire Robinson (codes morphologiques)</p><p>[NDT : dictionnaire en langue anglaise]</p></li><li><p>Bible Louis Segond 1910 avec codes Strong et &eacute;tiquettes morphologiques</p></li></ul></div><p>D&eacute;pot GnomeSword</p><div class="itemizedlist"><ul type="disc"><li><p>Dictionnaire StrongsRealGreek (identique au StrongsGreek, mais avec caract&egrave;res grecs, transliteration B-Greek, et liens de renvois)</p><p>[NDT : dictionnaire en langue anglaise]</p></li><li><p>Dictionnaire StrongsRealHebrew (identique au StrongsHebrew, mais avec caract&egrave;res h&eacute;breu et liens de renvois)</p><p>[NDT : dictionnaire en langue anglaise]</p></li><li><p>Dictionnaire InvertedStrongsRealGreek d&eacute;finitions des mots grecs</p><p>NDT : dictionnaire en langue anglaise]</p></li></ul></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="orig-lang-setup"></a>Configurer</h3></div></div></div><p>Ouvrir le gestionnaire de modules et cr&eacute;er un index pour tous les modules install&eacute;s. Ensuite fermer le gestionnaire de modules et ouvrir la fen&ecirc;tre des pr&eacute;f&eacute;rences comme suit : <span class="guisubmenu">&Eacute;diter</span> &#8594; <span class="guimenuitem">&middot;Pr&eacute;f&eacute;rences</span>&middot;et aller dans&middot;<span class="guisubmenu">Modules</span> &#8594; <span class="guimenuitem">Sp&eacute;cial</span>. D&eacute;finir ensuite les lexiques h&eacute;breu et grec en fonction de ceux install&eacute;s. Fermer la fen&ecirc;tre des pr&eacute;f&eacute;rences. Dans la fen&ecirc;tre principale, choisir la Bible Louis Segond 1910, afficher le menu contextuel par un clic droit de la souris et s&eacute;lectionner <span class="guisubmenu">Options du module</span> &#8594; <span class="guimenuitem">Nombres de &middot;Strong</span>&middot;et&middot;<span class="guisubmenu">Options du module</span> &#8594; <span class="guimenuitem">&Eacute;tiquettes morphologiques</span>. L'affichage du texte biblique change de fa&ccedil;on &agrave; afficher les nombres de Strong sous les mots appropri&eacute;s. Un survol des nombres de Strong (ou des &eacute;tiquettes morphologiques) &agrave; l'aide de la souris fait appara&icirc;tre la d&eacute;finition dans le volet <span class="interface">Aper&ccedil;u</span>. Un clic sur le lien affiche la d&eacute;finition dans le volet <span class="interface">Dictionnaire</span>.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="orig-lang-search"></a>Rechercher des Nombres de Strong</h3></div></div></div><p>Ouvrir la fen&ecirc;tre <span class="interface">Recherche avanc&eacute;e</span> par <span class="guisubmenu">&Eacute;diter</span> &#8594; <span class="guimenuitem">Recherche avanc&eacute;e</span> ou&middot;en pressant&middot;<span class="keycap"><strong>F3</strong></span>. Dans <span class="interface">Type de requ&ecirc;te</span>, choisir <span class="guibutton">Optimis&eacute;e Lucene</span>. Ensuite s&eacute;lectionner l'onglet <span class="interface">Attributs</span>, et cocher la case <span class="guibutton">Nombres de Strong</span>. Il est maintenant possible de rechercher un nombre de Strong dans la zone de saisie en le faisant pr&eacute;c&eacute;der de &laquo;&nbsp;<span class="emphasis"><em>lemma:</em></span>&nbsp;&raquo; accompagn&eacute; de &laquo;&nbsp;<span class="emphasis"><em>G</em></span>&nbsp;&raquo; pour la langue grecque et &laquo;&nbsp;<span class="emphasis"><em>H</em></span>&nbsp;&raquo; pour la langue h&eacute;bra&iuml;que. Ainsi pour rechercher le mot h&eacute;breu <span class="emphasis"><em>tsad-deek (6662)</em></span>, entrer : &laquo;&nbsp;<span class="emphasis"><em>lemma:G662</em></span>&nbsp;&raquo;. Une fois la recherche termin&eacute;e et les r&eacute;sultats affich&eacute;s, un clic sur un r&eacute;sultat fait afficher le contenu dans la zone <span class="interface">Aper&ccedil;u</span> ainsi que les nombres de Strong suivant imm&eacute;diatement les mots associ&eacute;s. Noter que survoler ces nombres avec la souris fait apparaitre la d&eacute;finition dans le volet <span class="interface">Aper&ccedil;u</span> de la fen&ecirc;tre principale.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="orig-lang-additional"></a>Modules additionnels</h3></div></div></div><p>Pour des recherches approfondies, les modules suivants sont aussi disponibles :</p><div class="itemizedlist"><ul type="disc"><li><p>2TGreek (D&eacute;pot GnomeSword) : Ce module contient la Bible enti&egrave;re en langue grecque. Il combine les modules LXX et Tischendorf8&middot;NT en un seul module avec nombres de Strong, &eacute;tiquettes morphologiques et accents grecs</p></li><li><p>Elzevir Textus Receptus (Source: Crosswire beta) &eacute;dition 1624 avec nombres de Strongs et &eacute;tiquettes morphologiques</p></li><li><p>LXX (D&eacute;pot Crosswire) : La Septante avec nombres de Strong, &eacute;tiquettes morphologiques et notes de bas de page.</p></li><li><p>MorphGNT (D&eacute;pot Crosswire beta) : Nouveau Testament grec d&eacute;riv&eacute; du texte avec analyse des formes du Center for Computer Analysys of Texts de l'Universit&eacute; de Pennsylvanie. Il a &eacute;t&eacute; reformatt&eacute; et corrig&eacute; par James Tauber. Inclut les accents grecs et les codes morphologiques.</p></li><li><p>TR (D&eacute;pot Crosswire) : Le Textus Receptus avec codes Strong et &eacute;tiquettes morphologiques.</p></li><li><p>TischMorph (D&eacute;pot GnomeSword) : Ce module contient les &eacute;tiquettes morphologiques, les accents grecs et les variantes du texte</p></li><li><p>WHNU (D&eacute;pot Crosswire) : Wescott-Hort de 1881 avec codes Strongs et &eacute;tiquettes morphologiques</p></li><li><p>GreekHebrew (D&eacute;pot Crosswire) : Dictionnaire des nombres de Strong. Il contient des mots de la LXX qui se trouvent aussi dans le Nouveau-Testament. Additionnellement, il contient les mots &eacute;quivalents en h&eacute;breu et les nombres de Strong associ&eacute;s.</p></li><li><p>Didache (R&eacute;pertoire Crosswire Beta) : La Didach&eacute; est un ancien trait&eacute; chr&eacute;tien grec datant de la fin du premier ou du d&eacute;but du deuxi&egrave;me si&egrave;cle. Sont inclus les codes Strong, les &eacute;tiquettes morphologiques et les accents grecs.</p></li></ul></div></div></div></body></html>