<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Interface</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, xiphos, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de Xiphos :"><link rel="up" href="index.html" title="Manuel de Xiphos :"><link rel="prev" href="ar01s02.html" title="Premiers pas"><link rel="next" href="ar01s04.html" title="Pr&eacute;f&eacute;rences"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="interface"></a>Interface</h2></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="menubar"></a>Barre de menu</h3></div></div></div><p>La <span class="interface">Barre de menu</span> se situe en haut de la fen&ecirc;tre de l'application <span class="application">Xiphos</span>.  Pratiquement toutes les fonctions sont disponibles en utilisant les &eacute;l&eacute;ments de menu appropri&eacute;s. Les diff&eacute;rentes fonctions sont regroup&eacute;es par type. Par exemple, les op&eacute;rations sur les fichiers sont regroup&eacute;es dans le menu  <span class="guisubmenu">Fichier</span>.</p><div class="figure"><a name="menubar_figure"></a><p class="title"><b>Figure&nbsp;5.&nbsp;Barre de menu</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_menubar.png" alt="Barre d'outil de Xiphos"></div></div></div></div><br class="figure-break"></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="toolbars"></a>Barres d'outils</h3></div></div></div><p>La fonction de la <span class="interface">Barre d'outils</span> est de commander le volet des <span class="interface">Textes bibliques.</span> et des <span class="interface"> Commentaires</span>. Les commandes sont activ&eacute;es par un clic de la souris sur un des boutons de la barre d'outils. Si le curseur de la souris est d&eacute;plac&eacute; au-dessus d'un des boutons, &agrave; ce moment-l&agrave; une bulle d'aide appara&icirc;t, d&eacute;crivant la fonction de ce bouton.</p><div class="figure"><a name="toolbar_figure"></a><p class="title"><b>Figure&nbsp;6.&nbsp;Barre d'outil</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_toolbar.png" alt="La barre d'outils"></div></div></div></div><br class="figure-break"><p>La <span class="interface">Barre d'outils</span> pr&eacute;sente les fonctions suivantes :</p><div class="itemizedlist"><ul type="disc"><li><p>Boutons de d&eacute;placement dans l'historique des versets consult&eacute;s</p></li><li><p>S&eacute;lecteur de livre de la Bible</p></li><li><p>S&eacute;lecteur de chapitre de la Bible</p></li><li><p>S&eacute;lecteur de verset de la Bible</p></li><li><p>Zone de saisie d'une r&eacute;f&eacute;rence biblique</p></li></ul></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="d0e764"></a>Boutons de d&eacute;placement avant/arri&egrave;re dans l'historique.</h4></div></div></div><p>Permettent de se d&eacute;placer dans l'historique des passages consult&eacute;s.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-toolbar-book"></a>S&eacute;lecteur de livre de la Bible</h4></div></div></div><p>Permet de s&eacute;lectionner un livre de la Bible. Le premier verset du livre est affich&eacute; imm&eacute;diatement dans le volet des<span class="interface"> textes bibliques</span> et le volet des<span class="interface"> commentaires</span>.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-toolbar-chapter"></a>S&eacute;lecteur de chapitre de la Bible</h4></div></div></div><p>Permet de s&eacute;lectionner un chapitre du livre de la Bible actuellement affich&eacute;e. Le premier verset du chapitre est affich&eacute; imm&eacute;diatement dans le volet des<span class="interface"> textes bibliques</span> et le volet des <span class="interface">commentaires</span>.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-toolbar-verse"></a>S&eacute;lecteur de verset de la Bible</h4></div></div></div><p>Permet de s&eacute;lectionner rapidement un verset du chapitre en cours de la Bible. Le verset est affich&eacute; imm&eacute;diatement.dans le volet des <span class="interface">textes bibliques</span> et le volet des <span class="interface">commentaires</span>.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-toolbar-summary"></a>Zone de saisie d'une r&eacute;f&eacute;rence biblique</h4></div></div></div><p>Permet la saisie manuelle d'un passage sous la forme <span class="interface">livre chapitre:verset</span> {ex: Jn 3:16}.Le verset est affich&eacute; apr&egrave;s appui sur la touche <span class="keycap"><strong>Entr&eacute;e</strong></span>.</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Avertissement</h3><p>Les valeurs de livre, chapitre et verset doivent &ecirc;tre correctes, sinon le le r&eacute;sultat obtenu risque d'&ecirc;tre diff&eacute;rent de celui d&eacute;sir&eacute;.</p></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-sidebar"></a>La barre d'outils</h3></div></div></div><div class="figure"><a name="sidebar_figure"></a><p class="title"><b>Figure&nbsp;7.&nbsp;Volet lat&eacute;ral</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_sidepane.png" alt="La barre d'outils"></div></div></div></div><br class="figure-break"><p>Le <span class="interface">volet lat&eacute;ral</span> est situ&eacute; sur la partie gauche de la fen&ecirc;tre principale de <span class="application">Xiphos</span>. Le <span class="interface">volet lat&eacute;ral</span> permet de choisir les modules Sword, de g&eacute;rer et utiliser les signets,d' effectuer des recherches basiques ou d'afficher les listes de versets. Les raccourcis du <span class="interface">volet lat&eacute;ral</span> permettent, par un simple clic, d'activer ces diff&eacute;rentes fonctions.</p><div class="figure"><a name="shortcut_figure"></a><p class="title"><b>Figure&nbsp;8.&nbsp;Raccourcis du volet lat&eacute;ral</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_shortcut.png" alt="Raccourcis du volet lat&eacute;ral"></div></div></div></div><br class="figure-break"></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-bible"></a>Le volet des textes bibliques</h3></div></div></div><div class="figure"><a name="textpane_figure"></a><p class="title"><b>Figure&nbsp;9.&nbsp;Le volet des textes bibliques</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_biblepane.png" alt="Le volet des textes bibliques"></div></div></div></div><br class="figure-break"><p>Le volet des<span class="interface"> textes bibliques</span> se trouve &agrave; droite du volet lat&eacute;ral. Les diff&eacute;rentes versions de la Bible sont affich&eacute;es dans cette zone. Au d&eacute;marrage de <span class="application">Xiphos</span>, la version utilis&eacute;e pr&eacute;c&eacute;demment ou la version d&eacute;finie par d&eacute;faut est affich&eacute;e.</p><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-open"></a>Ouvrir une version diff&eacute;rente de la Bible</h4></div></div></div><p>Pour remplacer la version de la Bible en cours d'utilisation par une autre version :</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic du bouton droit de la souris dans le volet d'affichage des <span class="interface">textes bibliques</span>. Dans le menu qui se pr&eacute;sente, choisir <span class="guimenuitem">Fichier</span> &#8594; <span class="guimenuitem">Ouvrir le module</span> et s&eacute;lectionner la version d&eacute;sir&eacute;e.</p></li><li><p>Ou apr&egrave;s avoir activ&eacute; l'option <span class="guimenuitem">Modules</span> du <span class="interface">volet  lat&eacute;ral</span>, choisir <span class="guimenuitem">Textes  bibliques</span> &#8594; <span class="guimenuitem">langue de votre choix </span> et s&eacute;lectionner la version d&eacute;sir&eacute;e.</p></li></ul></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-parallel"></a>Utilisation du mode Vue parall&egrave;le</h4></div></div></div><p>Une fonction int&eacute;ressante de <span class="application">Xiphos</span> est la possibilit&eacute; d'afficher en parall&egrave;le le texte de cinq versions diff&eacute;rentes de la Bible. Le mode Vue parall&egrave;le est activ&eacute; en s&eacute;lectionnant l'onglet <span class="guimenuitem">Vue parall&egrave;le</span> situ&eacute; en-dessous du volet des <span class="interface">textes bibliques</span>, &agrave; c&ocirc;t&eacute; de l'onglet <span class="guimenuitem">Vue standard</span>. Il est &agrave; noter qu'un seul verset peut &ecirc;tre affich&eacute; &agrave; la fois. Utiliser les s&eacute;lecteurs de la barre d'outils pour changer de verset. Il est &agrave; noter &eacute;galement que les modules de texte contenant seulement le Nouveau Testament ou seulement l'Ancien Testament ne pourront pas afficher les livres, chapitres, versets qu'ils n'ont pas.</p><div class="figure"><a name="parallel_figure"></a><p class="title"><b>Figure&nbsp;10.&nbsp;Volet des textes bibliques, vue parall&egrave;le</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_parallel.png" alt="Volet des textes bibliques, vue parall&egrave;le"></div></div></div></div><br class="figure-break"><p>De plus, une fen&ecirc;tre distincte  peut &ecirc;tre ouverte en mode parall&egrave;le. Pour l'ouvrir, faire un clic droit de la souris  sur la  vue parall&egrave;le pour faire appara&icirc;tre le menu contextuel. Choisir ensuite <span class="guimenuitem">D&eacute;tacher/Attacher</span>. Le volet des <span class="interface">textes bibliques</span> revient alors &agrave; la vue standard et une nouvelle fen&ecirc;tre <span class="interface">Vue parall&egrave;le</span> s'ouvre affichant le chapitre en cours dans les cinq versions.</p><div class="figure"><a name="parallel_figure_separate"></a><p class="title"><b>Figure&nbsp;11.&nbsp;Vue parall&egrave;le - Fen&ecirc;tre distincte</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_parallel-separate.png" alt="Vue parall&egrave;le - Fen&ecirc;tre distincte"></div></div></div></div><br class="figure-break"></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-open-separate"></a>Ouvrir le texte&middot;biblique dans une fen&ecirc;tre distincte</h4></div></div></div><p>Pour ouvrir le texte biblique dans une fen&ecirc;tre s&eacute;par&eacute;e de la fen&ecirc;tre principale de <span class="application">Xiphos</span> :</p><div class="itemizedlist"><ul type="disc"><li><p>Dans l'option  <span class="guimenuitem">Modules</span> du <span class="interface">volet lat&eacute;ral</span>, choisir <span class="guimenuitem">Textes bibliques</span> &#8594; <span class="guimenuitem">langue de votre choix</span>. Faire un clic droit sur la version souhait&eacute;e, puis dans le menu contextuel qui s'affiche, choisir l'option <span class="guimenuitem">Ouvrir dans une fen&ecirc;tre</span>.</p></li></ul></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-about"></a>Rechercher les informations &agrave; propos de la version courante.</h4></div></div></div><p>Pour obtenir des informations &agrave; propos de la version de la Bible en cours :</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic droit &agrave; l'aide de la souris dans le volet des <span class="interface">textes bibliques</span>. Dans le menu contextuel qui s'affiche, s&eacute;lectionner <span class="guimenuitem">&Agrave; propos</span>.</p></li><li><p>Dans l'option  <span class="guimenuitem">Modules</span> du <span class="interface">volet lat&eacute;ral</span>, choisir <span class="guimenuitem">Textes bibliques</span> &#8594; <span class="guimenuitem">langue de votre choix</span>. Faire un clic droit sur la version souhait&eacute;e, puis dans le menu contextuel qui s'affiche, choisir l'option <span class="guimenuitem">&Agrave; propos</span>.</p></li></ul></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-options"></a>Options des modules</h4></div></div></div><p>De nombreux modules de textes bibliques proposent des options additionnelles &agrave; activer suivant les besoins de  l'utilisateur :</p><div class="itemizedlist"><ul type="disc"><li><p>Paroles de Christ en rouge</p></li><li><p>Nombres de Strong</p></li><li><p>&Eacute;tiquettes morphologiques</p></li><li><p>Notes de bas de page</p></li><li><p>R&eacute;f&eacute;rences crois&eacute;es de l'&Eacute;criture</p></li><li><p>Ent&ecirc;tes</p></li><li><p>Afficher les images</p></li></ul></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Les versions en d'autres langues tel le grec ou l'h&eacute;breu offrent des options particuli&egrave;res qui ne s'appliquent qu'&agrave; ces langues.</p></div><p>pour acc&eacute;der &agrave; ces options :</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic du bouton droit &agrave; l'aide de la souris dans le volet des <span class="interface">textes bibliques</span>. Dans le menu contextuel qui s'affiche, choisir <span class="guimenuitem">Options du module</span>, puis l'option d&eacute;sir&eacute;e.</p></li></ul></div><div class="figure"><a name="module_options"></a><p class="title"><b>Figure&nbsp;12.&nbsp;Options des modules</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_biblepane-options.png" alt="Options des modules"></div></div></div></div><br class="figure-break"></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-view-options"></a>Options d'affichage</h4></div></div></div><p>Plusieurs modes suppl&eacute;mentaires peuvent &ecirc;tre s&eacute;lectionn&eacute;s &agrave; l'aide du menu <span class="guimenuitem">Afficher</span> de la barre de menu.</p><div class="figure"><a name="view_options"></a><p class="title"><b>Figure&nbsp;13.&nbsp;Options d'affichage</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_menubar-view.png" alt="Options d'affichage"></div></div></div></div><br class="figure-break"><p>Les 4 premi&egrave;res options commandent l'affichage des diff&eacute;rents volets de l'interface. L'&eacute;tat d'affichage de chaque volet est sp&eacute;cifique &agrave; un onglet. Ceci permet, par exemple, d'avoir un onglet d&eacute;di&eacute; &agrave; l'affichage des cartes (module dictionnaire avec les lieux tri&eacute;s alphab&eacute;tiquement), en suspendant l'affichage des volets <span class="interface">Textes bibliques</span>, <span class="interface">Commentaires</span> et <span class="interface">Aper&ccedil;u</span>.</p><p>Les options restantes commandent les autres options d'affichage.</p><div class="itemizedlist"><ul type="disc"><li><p><span class="guimenuitem">Style verset</span> - Bascule l'affichage du texte biblique entre versets distinctifs ou par paragraphes. Cette option s'applique &agrave; un module entier.</p></li><li><p><span class="guimenuitem">Onglets li&eacute;s</span> - Par d&eacute;faut, quand plus d'un onglet est ouvert, chacun permet de naviguer s&eacute;par&eacute;ment dans les textes bibliques. Quand cette option est activ&eacute;e, tous les onglets sont li&eacute;s ensemble, et affichent le m&ecirc;me verset.</p></li><li><p><span class="guimenuitem">Synth&egrave;se vocale</span> - Quand cette option est activ&eacute;e, <span class="application">Xiphos</span> lit &agrave; voix haute les textes s&eacute;lectionn&eacute;s &agrave; l'aide du logiciel de synth&egrave;se vocale <span class="application">Festival</span>. <span class="application">Festival</span> est souvent install&eacute; par d&eacute;faut dans les distributions Linux. (NDT: En g&eacute;n&eacute;ral, les r&eacute;sultats sont meilleurs en anglais )Non disponible sous WIndows.</p><p>De m&ecirc;me, la synth&egrave;se vocale peut &ecirc;tre utilis&eacute;e sur des portions de textes bibliques, commentaires ou livres. Une fois le texte d&eacute;sir&eacute; mis en surbrillance, s&eacute;lectionner  <span class="guimenuitem">Synth&egrave;se vocale du texte s&eacute;lectionn&eacute;</span> dans le menu contextuel obtenu &agrave; l'aide du clic droit de la souris.</p></li><li><p><span class="guimenuitem">Affiche les num&eacute;ros de versets</span> - Normalement activ&eacute;e, cette option peut &ecirc;tre d&eacute;sactiv&eacute;e pour ne pas afficher les num&eacute;ros de versets dans le texte. </p></li><li><p><span class="guimenuitem">Verset en cours contrast&eacute;</span> - D&eacute;sactiv&eacute;e par d&eacute;faut, cette option permet de remplacer la couleur du verset en cours par une coloration au contraste plus &eacute;lev&eacute;e. Les couleurs sont modifiables dans la fen&ecirc;tre de pr&eacute;f&eacute;rences.</p></li></ul></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-dictionary"></a>D&eacute;finition d'un mot particulier</h4></div></div></div><p>Pour obtenir la d&eacute;finition d'un mot particulier, faire un double-clic &agrave; l'aide de la souris sur le mot d&eacute;sir&eacute;. Le mot se met en surbrillance et sa d&eacute;finition, si le mot est r&eacute;pertori&eacute;, s'affiche ensuite dans le volet <span class="interface">dictionnaire</span>.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-bible-find"></a>Rechercher un mot sp&eacute;cifique</h4></div></div></div><p>Pour rechercher un mot sp&eacute;cifique dans un passage :</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic droit &agrave; l'aide de la souris dans le volet des <span class="interface">textes bibliques</span>. Dans le menu contextuel qui s'affiche, choisir <span class="guimenuitem">&Eacute;diter</span> &#8594; <span class="guimenuitem">Rechercher</span>. Une fen&ecirc;tre s'ouvre ensuite, permettant la recherche d'un ou plusieurs mots. Saisir le texte &agrave; rechercher, puis ensuite valider &agrave; l'aide du bouton <span class="guibutton">Rechercher</span>.</p></li></ul></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-viewer"></a>Aper&ccedil;u</h3></div></div></div><div class="figure"><a name="viewer_figure"></a><p class="title"><b>Figure&nbsp;14.&nbsp;Aper&ccedil;u</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_viewer.png" alt="Aper&ccedil;u"></div></div></div></div><br class="figure-break"><p>Le volet Aper&ccedil;u est l'endroit o&ugrave; sont affich&eacute;s les nombres de Strong, les &eacute;tiquettes morphologiques et les r&eacute;f&eacute;rences crois&eacute;es pr&eacute;sent&eacute;es dans le volet des <span class="interface">textes bibliques</span>.</p><p>Les notes de bas de page sont fugitives dans le volet <span class="interface"> Aper&ccedil;u</span>. Elles sont affich&eacute;es seulement lorsque le curseur de la souris est pr&eacute;sent au-dessus de l'indicateur de note de bas de page <span class="guimenuitem">*n</span> dans le texte, puis disparaissent d&egrave;s que le curseur de la souris en est &eacute;cart&eacute;. Cependant, certaines versions de la Bible (NET Bibles) contiennent des notes de pas de pages si cons&eacute;quentes qu'elles ne peuvent &ecirc;tre affich&eacute;es en entier. Dans ce cas, un clic sur le bouton du milieu &agrave; l'aide de la souris (ou un appui sur la touche <span class="guibutton">Majuscule</span>) fige l'affichage de la note de bas de page dans le volet <span class="interface">aper&ccedil;u</span> et permet de se d&eacute;placer ensuite dans la fen&ecirc;tre et d'utiliser l'ascenseur vertical.</p><p>Les r&eacute;f&eacute;rences crois&eacute;es <span class="guimenuitem">*x</span> ne sont pas visibles dans le volet des <span class="interface">textes bibliques</span>. Un clic &agrave; l'aide du bouton de la souris sur l'indicateur <span class="guimenuitem">*x</span> provoque l'affichage des r&eacute;f&eacute;rences crois&eacute;es dans la liste de <span class="guimenuitem">Versets</span> du <span class="interface">volet lat&eacute;ral</span>, o&ugrave; ensuite s&eacute;lectionn&eacute;s un par un, ils pourront &ecirc;tre affich&eacute;s dans le volet <span class="interface">aper&ccedil;u</span>.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-commentaries"></a>Le volet des commentaires</h3></div></div></div><div class="figure"><a name="commentary_figure"></a><p class="title"><b>Figure&nbsp;15.&nbsp;Le volet des commentaires</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_commentarypane.png" alt="Commentaire"></div></div></div></div><br class="figure-break"><p>Le volet d'affichage des <span class="interface">commentaires</span> permet la consultation des commentaires relatifs au verset en cours ou de se r&eacute;f&eacute;rer &agrave; d'autres commentaires existants. Le commentaire est directement li&eacute; au passage affich&eacute; dans le volet d'affichage des<span class="interface"> textes bibliques</span>, ainsi pour consulter le commentaire d'un autre passage, il suffit de changer de verset &agrave; l'aide de la <span class="interface">Barre d'outils</span>.</p><p>Si une image fait partie d'un commentaire, d'un livre ou d'un dictionnaire, elle peut &ecirc;tre affich&eacute;e agrandie dans une nouvelle fen&ecirc;tre en la s&eacute;lectionnant par un simple clic. Cette fonctionnalit&eacute; est particuli&egrave;rement int&eacute;ressante si l'option de r&eacute;duction des images a &eacute;t&eacute; activ&eacute;e avec pour r&eacute;sultat des images tr&egrave;s r&eacute;tr&eacute;cies.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>En changeant la r&eacute;f&eacute;rence du passage &agrave; l'aide de la <span class="interface">Barre d'outils</span>, le contenu du volet d'affichage des<span class="interface"> textes bibliques</span> et du  volet d'affichage des<span class="interface"> commentaires</span> changent simultan&eacute;ment.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-commentary-about"></a>Rechercher les informations &agrave; propos du module de commentaires</h4></div></div></div><p>&Agrave; propos du commentaire actuellement affich&eacute; :</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic du bouton droit &agrave; l'aide de la souris dans le volet d'affichage des <span class="interface">commentaires</span>. Dans le menu contextuel qui se pr&eacute;sente, s&eacute;lectionner <span class="guimenuitem">&Agrave; propos de</span>.</p></li></ul></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="xiphos-commentary-headings"></a>Ent&ecirc;tes des commentaires</h4></div></div></div><p>De nombreux commentaires incorporent des ent&ecirc;tes avec une note d'introduction sur le livre ou le chapitre en cours d'utilisation dans le volet des<span class="interface"> textes bibliques</span>. Pour obtenir l'affichage de l'ent&ecirc;te&nbsp;:</p><div class="itemizedlist"><ul type="disc"><li><p>Faire un clic du bouton droit &agrave; l'aide de la souris dans le volet d'affichage des <span class="interface">commentaires</span>. Dans le menu contextuel qui se pr&eacute;sente, choisir <span class="guimenuitem">Afficher l'ent&ecirc;te du livre</span> ou <span class="guimenuitem">Afficher l'ent&ecirc;te du chapitre</span>.</p></li></ul></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-dictionary"></a>Volet dictionnaire</h3></div></div></div><div class="figure"><a name="dict_figure"></a><p class="title"><b>Figure&nbsp;16.&nbsp;Le volet du dictionnaire</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/interface_dictionary.png" alt="Le volet du dictionnaire"></div></div></div></div><br class="figure-break"><p>Le volet <span class="interface">Dictionnaire</span> est pilot&eacute; &agrave; l'aide des fl&egrave;ches haut/bas, en saisissant un mot dans la zone de saisie ou en double-cliquant sur des mots dans les volets <span class="interface">Textes bibliques</span>, <span class="interface">Commentaires</span>, <span class="interface">Livre</span>.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-shortcut"></a>Raccourcis clavier</h3></div></div></div><p><span class="application">Xiphos</span>  pr&eacute;sente un certain nombre de raccourcis clavier :</p><div class="itemizedlist"><ul type="disc"><li><span class="guibutton">F1</span> ouvre ce manuel.</li><li><span class="guibutton">F2</span> ouvre la fen&ecirc;tre <span class="guibutton">Pr&eacute;f&eacute;rences</span>.</li><li><span class="guibutton">F3</span> : ouvre <span class="guibutton">Recherche avanc&eacute;e</span>.</li><li><span class="guibutton">F4</span> : ouvre <span class="guibutton">G&eacute;rer les modules</span>.</li><li><span class="guibutton">Ctrl-L</span> s&eacute;lectionne la zone de saisie de r&eacute;f&eacute;rence biblique. Il est ainsi possible de saisir directement une nouvelle r&eacute;f&eacute;rence de verset. Il est &agrave; noter que <span class="application">Xiphos</span>, comme d'autres applications Sword, accepte de nombreuses abr&eacute;viations. &laquo;&shy;&shy;&nbsp;G&nbsp;&raquo;  correspond &agrave; Gen&egrave;se par exemple, et n'importe quel nom de livre saisi seul implique chapitre 1, verset 1.</li><li><span class="guibutton">Ctrl-F</span> ouvre la fen&ecirc;tre de recherche. Le volet sur lequel elle est ex&eacute;cut&eacute;e d&eacute;pend desquels d'entre eux sont visibles. Le volet biblique a la premi&egrave;re pr&eacute;f&eacute;rence, puis le volet des commentaires ou le livre et enfin le dictionnaire. Ainsi un onglet peut &ecirc;tre d&eacute;di&eacute; &agrave; n'afficher que le volet livre et la recherche initi&eacute;e par <span class="guibutton">Ctrl-F</span> ne sera effectu&eacute;e que dans les limites de ce volet.</li><li><span class="guibutton">Alt-C</span> ram&egrave;ne au premier-plan le volet <span class="interface">Commentaire</span> si celui-ci est masqu&eacute; par le volet <span class="interface">Livre</span>.</li><li><span class="guibutton">Alt-G</span> ram&egrave;ne au premier-plan le volet <span class="interface">Livre</span>.</li><li><span class="guibutton">Alt-B</span> ouvre la fen&ecirc;tre <span class="interface">Ajouter un signet</span> sur le verset en cours</li><li><span class="guibutton">Alt-D</span> place le focus sur la barre de navigation du volet <span class="interface">Dictionnaire</span>.</li><li><span class="guibutton">Alt-P</span> d&eacute;tache / rattache la fen&ecirc;tre de vue parall&egrave;le.</li><li><span class="guibutton">Alt-Z</span> ouvre l'&eacute;diteur de commentaires personnels.</li><li><span class="guibutton">Ctrl-+/Ctrl--</span> augmente / diminue la taille de police</li><li>Activer la barre de navigation:&middot;<div class="itemizedlist"><ul type="circle"><li><span class="guibutton">Ctrl-P/Ctrl-N</span> Verset pr&eacute;c&eacute;dent/suivant.</li><li><span class="guibutton">P/N</span> : Chapitre pr&eacute;c&eacute;dent/suivant.</li><li><span class="guibutton">P/N</span> Livre pr&eacute;c&eacute;dent/suivant.</li></ul></div></li></ul></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="xiphos-differences"></a>Diff&eacute;rences d'affichage dans <span class="application">Xiphos</span> :</h3></div></div></div><p>L'application <span class="application">Xiphos</span> a &eacute;volu&eacute; au niveau des possibilit&eacute;s d'affichage. <span class="application">Xiphos</span> peut &ecirc;tre compil&eacute; avec l'une des 2 biblioth&egrave;ques suivantes au choix. La plus ancienne, moins compl&egrave;te se nomme &laquo;&nbsp;gtkhtml3&nbsp;&raquo;, et la nouvelle offrant plus de possibilit&eacute;s est &laquo;&nbsp;MozEmbed&nbsp;&raquo;.</p><p>Un certain nombre de nouveaut&eacute;s de <span class="application">Xiphos</span> ne sont pas support&eacute;es par &laquo;&nbsp;gtkhtml3&nbsp;&raquo;. Bien que <span class="application">Xiphos</span> soit &eacute;crit pour tirer parti des possibilit&eacute;s de &laquo;&nbsp;MozEmbed&nbsp;&raquo;, il est possible que la version install&eacute;e sur votre syst&egrave;me ait &eacute;t&eacute; construite avec &laquo;&nbsp;gtkhtml3&nbsp;&raquo;, soit la version install&eacute;e n'est pas suffisamment r&eacute;cente soit tout simplement elle n'existe pas. (Note: Cygwin ne propose pas &laquo;&nbsp;MozEmbed&nbsp;&raquo;). Les diff&eacute;rences suivantes se feront valoir suivant que vous utilisez &laquo;&nbsp;gtkhtml3&nbsp;&raquo; ou &laquo;&nbsp;MozEmbed&nbsp;&raquo; comme moteur d'affichage :</p><div class="itemizedlist"><ul type="disc"><li>Les &eacute;tiquettes morphologiques ainsi que les r&eacute;f&eacute;rences de Strong, activ&eacute;es via un menu contextuel dans certains modules, sont affich&eacute;es dans le corps du texte avec  &laquo;&nbsp;gtkhtml3&nbsp;&raquo;. Avec &laquo;&nbsp;MozEmbed&nbsp;&raquo;, ces r&eacute;f&eacute;rences sont align&eacute;es au-dessous du mot auxquelles elles se rapportent de fa&ccedil;on &agrave; procurer un affichage plus a&eacute;r&eacute; et plus lisible.</li><li>Les notes de pied de page et les r&eacute;f&eacute;rences crois&eacute;es (<span class="guibutton">*n</span>, <span class="guibutton">*x</span>) s'affichent en mode exposant avec &laquo;&nbsp;MozEmbed&nbsp;&raquo;.</li><li>Les liens avec &laquo;&nbsp;gtkhtml3&nbsp;&raquo; sont &agrave; la fois color&eacute;s et soulign&eacute;s. Ils ne sont pas soulign&eacute;s avec &laquo;&nbsp;MozEmbed&nbsp;&raquo;.</li><li>Avec &laquo;&nbsp;MozEmbed&nbsp;&raquo;, l'affichage en double espacement du texte est activable &agrave; l'aide du menu <span class="guimenuitem">Affichage</span>, cette option est indisponible avec &laquo;&nbsp;gtkhtml3&nbsp;&raquo;.</li><li>Gtkhtml3 ne sait pas interpr&eacute;ter les directives de polices multiples dans une m&ecirc;me fen&ecirc;tre, c'est pourquoi la fen&ecirc;tre d&eacute;tach&eacute;e &laquo;&nbsp;Vue parall&egrave;le&nbsp;&raquo; ne permet pas une s&eacute;lection de police par module.</li></ul></div><p>&Agrave; l'aide du menu <span class="guimenuitem">Aide</span> &#8594; <span class="guimenuitem">&Agrave; propos de Xiphos</span>, il est possible de conna&icirc;tre la biblioth&egrave;que avec laquelle <span class="application">Xiphos</span> a &eacute;t&eacute; construit.</p><div class="figure"><a name="displib_figure"></a><p class="title"><b>Figure&nbsp;17.&nbsp;Comparaison d'affichage entre gtkhtml3 et mozembed</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/gtkhtml3-vs-mozembed.png" alt="Comparaison d'affichage entre gtkhtml3 et mozembed"></div></div></div></div><br class="figure-break"></div></div></body></html>