<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>G&eacute;rer les modules</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, xiphos, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de Xiphos :"><link rel="up" href="index.html" title="Manuel de Xiphos :"><link rel="prev" href="ar01s04.html" title="Pr&eacute;f&eacute;rences"><link rel="next" href="ar01s06.html" title="Fonctions de recherche"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="module-manager"></a>G&eacute;rer les modules</h2></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="module-introduction"></a>Introduction &agrave; la gestion des modules</h3></div></div></div><p>Le &laquo;&shy;&shy;&nbsp;module&nbsp;&raquo; est un bloc de contenu dans <span class="application">Xiphos</span> et plus g&eacute;n&eacute;ralement dans toute application bas&eacute;e sur Sword. Un module de Sword est une ressource destin&eacute;e &agrave; &ecirc;tre affich&eacute;e dans une application Sword. Les modules sont de plusieurs types dont, en premier, les textes bibliques, puis les commentaires, les dictionnaires et lexiques, les livres ordinaires, ceux offrant un contenu graphique (Atlas). Ils sont &agrave; installer depuis un d&eacute;pot local (distribution par CDROM) ou par t&eacute;l&eacute;chargement ftp depuis un d&eacute;pot distant comme celui de Crosswire, site de Sword, o&ugrave; tous les modules certiifi&eacute;s par Crosswire sont disponibles. Des modules sont &eacute;galement disponibles aupr&egrave;s d'autres sources.</p><p>Si d'autres applications bas&eacute;es sur Sword sont install&eacute;es, elles ont acc&egrave;s aux modules install&eacute;s par le gestionnaire de modules.</p><div class="figure"><a name="d0e1719"></a><p class="title"><b>Figure&nbsp;26.&nbsp;La fen&ecirc;tre de gestion des modules</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/module.png" alt="La fen&ecirc;tre de gestion des modules"></div></div></div></div><br class="figure-break"></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="sword-config"></a>Configuration des modules de Sword</h3></div></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="sword-sources"></a>Configurer les d&eacute;pots Sword</h4></div></div></div><div class="figure"><a name="d0e1738"></a><p class="title"><b>Figure&nbsp;27.&nbsp;Configurer les d&eacute;pots Sword</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/sword_sources.png" alt="Installation de module"></div></div></div></div><br class="figure-break"><p>D'autres d&eacute;pots non li&eacute;s &agrave; Crosswire proposent des modules Sword, bien que les modules offerts par ces autres d&eacute;pots ne pr&eacute;sentent pas un contenu officiellement certifi&eacute; par Crosswire. La page web <a class="ulink" href="http://www.crosswire.org/wiki/index.php/Module_Repositories" target="_top">http://www.crosswire.org/wiki/index.php/Module_Repositories</a> recense les d&eacute;pots connus.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="installation"></a>Destination des modules Sword</h4></div></div></div><div class="figure"><a name="d0e1758"></a><p class="title"><b>Figure&nbsp;28.&nbsp;Destination des modules Sword</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/sword_config.png" alt="Installation de module"></div></div></div></div><br class="figure-break"><p>Apr&egrave;s avoir choisi un d&eacute;pot, s&eacute;lectionner le bouton <span class="guimenuitem">Rafra&icirc;chir</span>, ce qui conduit <span class="application">Xiphos</span> &agrave; r&eacute;pertorier les modules disponibles au niveau du d&eacute;pot.</p><p>Note au sujet du &laquo; R&eacute;pertoire d'installation &raquo; : dans la plupart des cas, il est propos&eacute; le choix entre un espace personnel et un espace syst&egrave;me. Ceci est d&eacute;pendant du syst&egrave;me d'exploitation.</p><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="destination-linux"></a>Linux</h5></div></div></div><p>&Agrave; moins d'avoir les privil&egrave;ges du superutilisateur (via su ou sudo), l'installation n'est possible que dans l'espace personnel, sous le r&eacute;pertoire ~/.sword.En &eacute;tant superutilisateur, ou en modifiant les permissions de l'espace syst&egrave;me (g&eacute;n&eacute;ralement : /usr/share/sword), il est possible d'installer des modules accessibles par tous les utilisateurs.Il a &eacute;t&eacute; fait un certain nombre de demandes pour que soit incorpor&eacute; &agrave; <span class="application">Xiphos</span> un moyen permettant &agrave; un utilisateur ordinaire (non-root) d'obtenir temporairement les droits d'acc&egrave;s &agrave; l'espace syst&egrave;me pendant l'installation des modules, puis d'annuler ces droits une fois l'installation termin&eacute;e. &Eacute;tant donn&eacute; les diff&eacute;rentes gestions des droits du super-utilisateur employ&eacute;es dans l'&eacute;ventail des distributions Linux, il est plut&ocirc;t difficile d'&eacute;tablir un moyen de satisfaire cette demande. En ce moment, il n'y a aucun projet en cours essayant de r&eacute;soudre ce probl&egrave;me, il est donc conseill&eacute; aux utilisateurs de g&eacute;rer les droits d'acc&egrave;s en &eacute;criture &agrave; l'emplacement syst&egrave;me en dehors de <span class="application">Xiphos</span>.</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="destination-xp"></a>Windows XP</h5></div></div></div><p>
				You may install modules to a shared folder so the modules are available to all users. If you have previously used
				"The Sword Project for Windows", this folder will be "C:\Program Files\Crosswire\The Sword Project\Sword". Otherwise
				it will be "C:\Documents and Settings\All Users\Application Data\Sword". You may also install modules to a location
				that can only be seen by you. This location is "C:\Documents and Settings\YOUR NAME\Application Data\Sword".
				</p></div><div class="sect4" lang="fr"><div class="titlepage"><div><div><h5 class="title"><a name="destination-vista"></a>Windows Vista</h5></div></div></div><p>
				Vista works much the same as XP, except for the locations. The private location is 
				"C:\Users\YOUR NAME\AppData\Roaming\Sword". The shared location is "C:\ProgramData\Sword".
				</p></div></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="module-management"></a>Installer, mettre &agrave; jour et maintenir les modules</h3></div></div></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="add-module"></a>Installer, mettre &agrave; jour et maintenir les modules</h4></div></div></div><div class="figure"><a name="d0e1808"></a><p class="title"><b>Figure&nbsp;29.&nbsp;Installation et mise &agrave; jour de modules</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/sword_install.png" alt="Installation de module"></div></div></div></div><br class="figure-break"><p>Le gestionnaire de modules g&eacute;n&eacute;re &agrave; la fois une liste de modules class&eacute;s par type et une liste de modules ordonn&eacute;s par disponibilit&eacute;. Cette derni&egrave;re est destin&eacute;e &agrave; rendre plus rapide la recherche de nouveaux &eacute;l&eacute;ments sans avoir &agrave; balayer la liste des modules class&eacute;s par type. Les modules non encore install&eacute;s ou pour lesquels existe une mise &agrave; jour apparaissent dans cette liste.</p><p>Une coche indique les modules d&eacute;j&agrave; install&eacute;s. Si un index de recherche optimis&eacute;e ("Luc&egrave;ne") a &eacute;t&eacute; cr&eacute;&eacute;, un symbole repr&eacute;sentant une loupe est affich&eacute;, sinon un &laquo;&nbsp;X&nbsp;&raquo; est pr&eacute;sent&eacute;. La cr&eacute;ation d'un index de recherche optimis&eacute;e se fait dans l'onglet <span class="guimenuitem">Maintenance</span>. Les modules verrouill&eacute;s, n&eacute;cessitant l'achat d'une cl&eacute; de d&eacute;verrouillage aupr&egrave;s du d&eacute;tenteur des droits d'un module sous copyright sont mentionn&eacute;s par un symbole en forme de verrou. S'il existe une version plus r&eacute;cente des modules d&eacute;j&agrave; install&eacute;s, un symbole de rafra&icirc;chissement appara&icirc;t entre les deux r&eacute;f&eacute;rences de version du module. La taille approximative du module est affich&eacute;e &agrave; condition que le d&eacute;pot de modules fournisse cette information, sinon un point d'interrogation (&laquo;&nbsp;?&nbsp;&raquo;) est pr&eacute;sent&eacute;..</p><p>Pour installer de nouveaux modules il suffit de s&eacute;lectionner la case &agrave; cocher des modules &agrave; installer, puis de valider &agrave; l'aide du bouton <span class="guibutton">Installer</span>. Plusieurs modules peuvent &ecirc;tre install&eacute;s simultan&eacute;ment.</p><p>Suite &agrave; l'acquisition d'un module crypt&eacute; et de la cl&eacute; de d&eacute;verrouillage associ&eacute;e, le module doit ensuite &ecirc;tre d&eacute;verrouill&eacute;. Il suffit simplement d'ouvrir le module dans la fen&ecirc;tre principale, o&ugrave; il ne s'affiche probablement pas, puis dans le menu contextuel affich&eacute; &agrave; l'aide du clic droit de la souris, de s&eacute;lectionner <span class="guimenu">D&eacute;verrouiller ce module</span> et de saisir la cl&eacute;.</p></div><div class="sect3" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="remove-module"></a>Maintenance des modules</h4></div></div></div><div class="figure"><a name="d0e1840"></a><p class="title"><b>Figure&nbsp;30.&nbsp;Maintenance des modules</b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/sword_remove.png" alt="Maintenance des modules"></div></div></div></div><br class="figure-break"><p>Plusieurs op&eacute;rations de maintenance sont possibles : Suppression, archivage, indexation et suppression d'index.</p><p>Supprimer un module est une op&eacute;ration d&eacute;finitive. Il est impossible de r&eacute;cup&eacute;rer le module &agrave; moins que vous n'ayez une copie de celui-ci.</p><p>Tout module peut &ecirc;tre archiv&eacute;, bien que l'archivage soit principalement int&eacute;ressant dans le cas des modules de commentaires personnels. Une copie du module au format compress&eacute; *.zip est plac&eacute;e dans le r&eacute;pertoire local ~/.sword/zip. Il est recommand&eacute; d'archiver les commentaires personnels avant de les supprimer de fa&ccedil;on &agrave; pouvoir les r&eacute;installer si besoin est.</p><p>L'indexation est une op&eacute;ration permettant au moteur Sword d'effectuer des recherches multi-mots rapides. Si cet index n'existe pas, les op&eacute;rations de recherche prennent un certain temps. Avec la mise en place d'un index, la recherche de type multi-mots sur l'ensemble de la Bible ne dure que quelques secondes.</p><p>Les index peuvent &ecirc;tre supprim&eacute;s.</p></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="non-standard-modules"></a>Installer des modules manuellement</h3></div></div></div><p>Des modules au format du Projet SWORD sont disponibles aupr&egrave;s d'autres sources que Crosswire mais pas sous la forme d'un d&eacute;pot &agrave; configurer avec le gestionnaire de modules. Il est donc n&eacute;cessaire de les installer manuellement.</p><p>Ces modules sont ordinairement compress&eacute;s au format zip. Ils contiennent un fichier de configuration ainsi qu'un certain nombre de fichiers de donn&eacute;es. Installer un module pr&eacute;sent&eacute; sous cette forme implique de se placer dans le r&eacute;pertoire de configuration Sword personnel. Ce r&eacute;pertoire se nomme ~/.sword, et se trouve dans votre r&eacute;pertoire personnel (ce n'est pas celui de <span class="application"><span class="application">Xiphos</span></span>) puis de d&eacute;compresser le fichier zip &agrave; cet endroit. Le fichier de configuration sera plac&eacute; dans le r&eacute;pertoire &laquo;&shy;&shy;&nbsp;mods.d&nbsp;&raquo;,et les fichiers de donn&eacute;es dans les sous-r&eacute;pertoires de &laquo;&shy;&shy;&nbsp;modules&nbsp;&raquo;. Si vous avez les droits en &eacute;criture du r&eacute;pertoire g&eacute;n&eacute;ral de Sword usr/share/sword, vous pouvez aussi d&eacute;compresser le fichier zip dans ce r&eacute;pertoire, ce module sera alors accessible &agrave; tous les utilisateurs.</p><p>Il est n&eacute;cessaire de red&eacute;marrer <span class="application">Xiphos</span> apr&egrave;s avoir install&eacute; un module non-standard de fa&ccedil;on &agrave; ce que le logiciel d&eacute;tecte le nouveau module en place.</p></div></div></body></html>