<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Listes de pri&egrave;res et notes</title><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><meta name="keywords" content="gnome, xiphos, sword, crosswire, Fen&ecirc;tre d'aide"><link rel="start" href="index.html" title="Manuel de Xiphos :"><link rel="up" href="index.html" title="Manuel de Xiphos :"><link rel="prev" href="ar01s08.html" title="Commentaires personnels"><link rel="next" href="ar01s10.html" title="Obtenir de l'aide en ligne"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="journals"></a>Listes de pri&egrave;res et notes</h2></div></div></div><p><span class="application">Xiphos</span> accepte la cr&eacute;ation et l'&eacute;dition par l'utilisateur de modules contenant du texte. Originellement con&ccedil;us pour l'&eacute;dition de simples listes de pri&egrave;res, ces modules incluent d&eacute;sormais des notes calendaires et structur&eacute;es. Il est ainsi possible de tenir &agrave; jour des listes de pri&egrave;res, de pr&eacute;parer des sermons, ou d'&eacute;crire n'importe quel contenu structur&eacute;.</p><p>Pour activer le support des notes et listes de pri&egrave;res, ouvrir la boite de dialogue des <span class="interface">Pr&eacute;f&eacute;rences</span>. Dans le menu <span class="guimenuitem">G&eacute;n&eacute;ral</span> &#8594; <span class="guimenuitem">Divers</span>, s&eacute;lectionner l'&eacute;l&eacute;ment indiquant <span class="guimenuitem">Activer les listes de pri&egrave;res</span>. Une nouvelle entr&eacute;e <span class="guimenuitem">Liste de pri&egrave;res / Notes</span> appara&icirc;t d&egrave;s cet instant dans la liste de modules du <span class="interface">volet lat&eacute;ral</span>.</p><p>Un clic droit de la souris sur cette entr&eacute;e pr&eacute;sente un menu contextuel permettant de cr&eacute;er de nouveaux modules. Toutes les options pr&eacute;sent&eacute;es sont du m&ecirc;me type mais avec des mod&egrave;les diff&eacute;rents &agrave; partir desquels travailler. Il existe 5 mod&egrave;les pour le moment.</p><div class="figure"><a name="d0e2687"></a><p class="title"><b>Figure&nbsp;35.&nbsp;Cr&eacute;er une note ou une liste de pri&egrave;res </b></p><div class="figure-contents"><div class="screenshot"><div class="mediaobject"><img src="figures/journal.png" alt="Nouvelle note ou liste de pri&egrave;res"></div></div></div></div><br class="figure-break"><p>Le type de module reste le m&ecirc;me, cependant les mod&egrave;les pr&eacute;sent&eacute;s donnent quelques d'id&eacute;es au niveau des diff&eacute;rentes fa&ccedil;ons d'organiser les contenus. <span class="guimenuitem">Liste simple</span> peut &ecirc;tre consid&eacute;r&eacute;e comme une note basique. <span class="guimenuitem">Liste ordonn&eacute;e par sujet</span> est une version plus structur&eacute;e de la pr&eacute;c&eacute;dente. <span class="guimenuitem">Suivi mensuel</span> pr&eacute;sente une structure dans laquelle il est possible de faire un suivi mensuel. <span class="guimenuitem">Suivi quotidien</span> est un calendrier annuel dans lequel enregistrer un journal ou des pri&egrave;res en cours. Et finalement, <span class="guimenuitem">Note structur&eacute;e</span> est une arborescence con&ccedil;ue pour inclure des sujets, des sous-sujets, etc..</p><p>Les notes et listes de pri&egrave;res ont le format de module d'un livre. Lorsqu'elles sont s&eacute;lectionn&eacute;es dans la liste de modules, elles sont donc affich&eacute;es dans le volet <span class="interface">Livre</span>.</p><p>&Eacute;diter une note ou une liste de pri&egrave;res se fait &agrave; l'aide de la souris en cliquant du bouton droit sur le module choisi pour faire appara&icirc;tre le menu contextuel, puis en s&eacute;lectionnant le menu <span class="guimenuitem">Ouvrir dans l'&eacute;diteur</span>. Les sections et sous-sections sont affich&eacute;es dans le volet de gauche. S&eacute;lectionner une section permet de la modifier dans l'&eacute;diteur. Le menu contextuel activ&eacute; par un clic droit sur une section permet d'ajouter, supprimer et modifier les noms des sections et sous-sections.</p><p>Si le volet <span class="interface">Livre</span> affiche une liste de pri&egrave;res ou une note en cours d'&eacute;dition, le contenu sera mis &agrave; jour quand le bouton <span class="guibutton">Enregistrer</span> sera activ&eacute;.</p><p>Comme pr&eacute;c&eacute;demment mentionn&eacute;, les modules cr&eacute;&eacute;s et &eacute;dit&eacute;s par l'utilisateur sont en fait des des modules de type Livre. Ces modules sont donc utilisables imm&eacute;diatement dans n'importe quelle application bas&eacute;e sur le Sword Project, comme par exemple <span class="application">BibleTime</span>. Il est possible &eacute;galement &agrave; l'aide de l'onglet <span class="guimenuitem">G&eacute;rer</span> du gestionnaire de modules de r&eacute;aliser un archivage au format zip, puis de copier le fichier ainsi obtenu sur un syt&egrave;me Windows puis d'installer le module pour une application Windows bas&eacute;e sur le Sword Project. Peu d'autres applications bas&eacute;es sur le Sword Project offrent les outils d'&eacute;dition de tels modules, ceci implique qu'ils apparaitront comme de simples livres.</p><p>Il est pr&eacute;vu, dans le futur, de mettre &agrave; disposition une fonction de partage de modules, ou de tels modules cr&eacute;&eacute;s par l'utilisateur seront t&eacute;l&eacute;charg&eacute;s et rendus disponible &agrave; une large audience. L'actuelle fonction d'installation de modules sera enrichie pour autoriser ce partage. Les utilisateurs pourront alors partager leurs sermons, &eacute;tudes bibliques, ou tout autre contenu compos&eacute; personellement avec d'autres utilisateurs d'applications bas&eacute;es sur le Sword Project.</p></div></body></html>