Repository: crosswire/xiphos
Catalog: gnomesword/po/*.po
Languages: sk

source: We would like to thank Troy Griffitts and all the other folks who have given us The SWORD Project.
sk: Radi by sme sa poïakovali Troy Griffitts a v¹etkým ostatným µuïom, ktorý nám dali Sword projekt.

source: About The Sword Project
sk: O projekte SWORD...

source: The SWORD Project is an effort to create an ever expanding software package for research and study of God and His Word. The SWORD Bible Framework allows easy manipulation of Bible texts, commentaries, lexicons, dictionaries, etc. Many frontends are build using this framework. An installed module set may be shared between any frontend using the framework.
sk: SWORD projekt je úsilie o vytvorenie rozsiahleho softvérového balíka na výskum a ¹túdium Boha a Jeho Slova. Biblický rámec SWORDu umoŸòuje µahké ovládanie textu biblie, komentárov, lexikónov, slovníkov atï. Veµa frontendov je budovaných na tomto rámci. Nain¹talovaná sada modulov môŸe by» zdielaná medzi frontendom s pouŸitím rámca.

source: Modules can be downloaded from the Sword Project
sk: Moduly môŸu by» stiahnuté zo Sword projektu

source: New _Group
sk: _Nová skupina

source: Add a new root group and file
sk: Prida» novú hlavnú skupinu a súbor

source: New _SubGroup
sk: _Nová podskupina

source: Add new SubGroup to selected group
sk: Prida» novú podskupinu

source: _Insert Item
sk: _VloŸi» poloŸku

source: Insert new bookmark here
sk: Sem vloŸi» novú záloŸku

source: _Add Item at Root
sk: _Prida» novú poloŸku ako koreò

source: Add new bookmark item
sk: Prida» novú záloŸkovú poloŸku

source: Edit Item
sk: Upravi» poloŸku

source: Edit bookmark item
sk: Upravi» poloŸku záloŸky

source: Delete Item(s)
sk: Zmaza» poloŸku

source: Delete item and it's siblings
sk: Zmaza» poloŸku a jej súrodencov

source: Save Bookmarks
sk: UloŸi» záloŸky

source: Save all bookmark files
sk: UloŸí v¹etky súbory so záloŸkami

source: Expand All
sk: V¹etko rozbali»

source: Expand all Bookmarks groups
sk: Rozbali» v¹etky skupiny záloŸiek

source: Collapse All
sk: Zbali» v¹etko

source: Collapse all Bookmarks groups
sk: Zbali» v¹etky skupiny záloŸiek

source: Allow Reordering
sk: Povoli» preusporiadanie

source: Toggle Reording - allow items to be moved by draging
sk: Prepnú» preusporiadanie - povoli» poloŸkám, aby mohli by» premiestòované »ahaním

source: GnomeSword - New Bookmark
sk: GnomeSword - Nová záloŸka

source: GnomeSword - Edit Bookmark
sk: GnomeSword - Úprava záloŸiek

source: Label
sk: Popis

source: Reference
sk: Referencia

source: Module
sk: Modul

source: Interlinear
sk: Interlineárne

source: Interlinear Page
sk: Interlineárna stránka

source: GnomeSWORD - Interlinear Page
sk: Interlineárna stránka GnomeSWORDu

source: button6
sk: tlaèítko6

source: Romans
sk: Rimanom

source: Romans 8:28
sk: Rimanom 8:28

source: Goto verse
sk: Ís» na ver¹

source: Go to verse in free form lookup and add verse to history
sk: Ís» na ver¹ vo voµnej forme a prida» ver¹ do histórie

source: Dock
sk: Dok

source: ``%s'' has been modified. Do you wish to save it?
sk: ``%s'' bolo modifikované. Prajete si to uloŸi»?

source: -untitled-
sk: -bez_názvu-

source: File
sk: Súbor

source: Save Note
sk: UloŸi» poznámku

source: Delete Note
sk: Zmaza» poznámku

source: Open File
sk: Otvori» súbor

source: Save Entry
sk: UloŸi» záznam

source: Delete Entry
sk: Zmaza» záznam

source: New
sk: Nový

source: Open
sk: Otvori»

source: Save
sk: UloŸi»

source: Save AS
sk: UloŸi» ako

source: Print
sk: Tlaèi»

source: _Edit
sk: _Upravi»

source: Cut
sk: Vystrihnú»

source: Copy
sk: Kopírova»

source: Paste
sk: VloŸi»

source: Spell Check
sk: Kontrola pravopisu

source: Undo
sk: Spä»

source: Find
sk: Nájs»

source: Find Next
sk: Nájs» ïal¹í

source: Replace
sk: Nahradi»

source: Link...
sk: Odkaz...

source: GnomeSWORD Add Reference Link
sk: GnomeSword pridanie referenèného odkazu

source: Reference
sk: Referencia

source: Bible Reference or Module key to display when link is clicked
sk: Biblická referencia alebo kµúè modulu, ktorý sa zobrazí pri kliknutí na odkaz

source: Name of module to show when link is clicked
sk: Názov modulu, ktorý sa zobrazí pri kliknutí na odkaz

source: Replace confirmation
sk: Potvrdenie nahradenia

source: Replace all
sk: Nahradi» v¹etky

source: Next
sk: Nasledujúca

source: search backward
sk: hµada» dozadu

source: case sensitive
sk: rozli¹ova» veµkos» písmen

source: with
sk: s

source: backward
sk: hµada» dozadu

source: Find Regular Expression
sk: Hµada» regulárny výraz

source: Normal
sk: Normálne

source: Preformat
sk: Predformátova»

source: Header 1
sk: Hlavièka 1

source: Header 2
sk: Hlavièka 2

source: Header 3
sk: Hlavièka 3

source: Header 4
sk: Hlavièka 4

source: Header 5
sk: Hlavièka 5

source: Header 6
sk: Hlavièka 6

source: Address
sk: Adresa

source: List
sk: Zoznam

source: Num List
sk: Èíslovaný zoznam

source: Roman List
sk: Zoznam s rímskymi èíslicami

source: Alpha List
sk: Zoznam s písmenami

source: Automatic
sk: Automatické

source: Left align
sk: Zarovna» vµavo

source: Left justifies the paragraphs
sk: Zarovná odstavce vµavo

source: Center
sk: Na stred

source: Center justifies the paragraphs
sk: Zarovná odstavce na stred

source: Right align
sk: Zarovna» vpravo

source: Right justifies the paragraphs
sk: Zarovná odstavce vpravo

source: Typewriter
sk: Pevná ¹írka

source: Toggle typewriter font style
sk: Prepne ¹týl písma na pevnú ¹írku

source: Bold
sk: Tuèné

source: Makes the text bold
sk: Nastaví výber na tuèné písmo

source: Italic
sk: ©ikmé

source: Makes the text italic
sk: Nastaví výber na ¹ikmé písmo

source: Underline
sk: Podèiarknuté

source: Underlines the text
sk: Podèiarkne text

source: Strikeout
sk: Preèiarknuté

source: Strikes out the text
sk: Preèiarkne text

source: Unindent
sk: Zru¹i» odsadenie

source: Indents the paragraphs less
sk: Zmen¹í odsadenie odstavcov

source: Indent
sk: Odsadenie

source: Indents the paragraphs more
sk: Zväè¹í odsadenie odstavcov

source: GnomeSword - Open Note File
sk: GnomeSword - Otvori» poznámkový súbor

source: GomeSword - Save Note File
sk: GnomeSword - UloŸi» poznámkový súbor

source: _Settings/
sk: _Nastavenie/

source: Verse Style
sk: ©týl ver¹a

source: _Quickmarks/<Separator>
sk: _Rýchle znaèky/<Separator>

source: _Quickmarks/Clear Quickmarks
sk: _Rýchle znaèky/Zmaza» Rýchle znaèky

source: Copy highlighted text from main window
sk: Kopírova» vyznaèenú textovú formu v hlavnom okne

source: Search
sk: Hµada»

source: Open search dialog
sk: Otvori» dialóg vyhµadávania

source: Add Quickmark
sk: Prida» Rýchlu znaèku

source: Add current verse to Quickmarks menu
sk: Prida» aktuálny ver¹ do ponuky Rýchlych znaèiek

source: Clear Quickmarks
sk: Zmaza» rýchle znaèky

source: Edit Quickmarks
sk: Upravi» Rýchle znaèky

source: C_lear
sk: Vyèis_ti»

source: Clear history list
sk: Vymaza» históriu

source: Daily Devotion
sk: Denné zamyslenie

source: Show the Daily Devotion for Today
sk: Zobrazi» dne¹né denné zamyslenie

source: Module Options
sk: Nastavenia modulov

source: Bible Texts
sk: Biblické texty

source: Information about Bible texts
sk: Informácie o biblických textoch

source: Commentaries
sk: Komentáre

source: Dictionaries-Lexicons
sk: Slovníky-lexikóny

source: Books
sk: Knihy

source: Contents
sk: Obsah

source: Help Contents
sk: Obsah pomocníka

source: About the Sword Project...
sk: O Sword projekte...

source: Infotmation About The Sword Project
sk: Informácie o Sword projekte

source: About Sword Modules
sk: O Sword moduloch

source: Information about the installed modules
sk: Informácie o nain¹talovaných moduloch

source: About GnomeSword...
sk: O GnomeSword...

source: About GnomeSword
sk: O GnomeSword

source: _Quickmarks
sk: _Rýchle znaèky

source: _History
sk: _História

source: GnomeSWORD - Bible Study Software
sk: GnomeSword - softvér na ¹túdium biblie

source: Detach/Attach Shortcut Bar
sk: Prida»/Odobra» panel so skratkami

source: Hide/Show Shortcut Bar
sk: Zobrazi»/Skry» panel so skratkami

source: Toggle Strongs Numbers
sk: Prepnú» Strongové èísla

source: Toggle Morphological Tags
sk: Zobrazi» morfologické znaèky

source: Toggle Footnotes
sk: Prenú» poznámky pod èiarou

source: Back
sk: Predchádzajúci

source: Go backward through history list
sk: Ís» na na predchádzajúcu poloŸku v histórií

source: Foward
sk: Nasledujúci

source: Go foward through history list
sk: Ís» na nasledujúcu poloŸku v histórií

source: Synchronize
sk: Synchronizova»

source: Synchronize Commentary with Bible Text
sk: Synchronizova» komentár s textom biblie

source: button2
sk: tlaèítko2

source: button3
sk: tlaèítko3

source: Print this Comment
sk: Vytlaèi» tento komentár

source: Personal Comments
sk: Osobné komentáre

source: Study Pad
sk: ©tudijný blok

source: Dict/Lex
sk: Slovník-Lexikón

source: _History/<Separator>
sk: _História/<Separator>

source: _History/C_lear
sk: _História/_Vymaza»

source: Show %s in main window
sk: Zobrazi» %s v hlavnom okne

source: Go to %s
sk: Ís» na %s

source: GnomeSword - InfoBox
sk: GnomeSword - Informácie

source: in StudyPad is not saved!
sk: v ©tudijnom bloku nie je uloŸené!

source: Shall I save it?
sk: Mám to uloŸi»?

source: Cannot launch gnome-help-browser
sk: Gnome-prehliadaè-pomocníka sa nedá spusti»

source: _Settings/Module Options/
sk: _Nastavenie/Nastavenia modulov/

source: Strong's Numbers
sk: Zobrazi» Strongové èísla

source: Footnotes
sk: Poznámky pod èiarou

source: Morphological Tags
sk: Morfologické znaèky

source: Hebrew Vowel Points
sk: Body hebrejských samohlások

source: Greek Accents
sk: Grécke akcenty

source: Scripture Cross-references
sk: KríŸové referencie Písma

source: Lemmas
sk: Nadpisy

source: Headings
sk: Hlavièky

source: _Help/About Sword Modules/Bible Texts/<Separator>
sk: _Pomocník/O Sword moduloch/Biblické texty/<Separator>

source: _Help/About Sword Modules/Commentaries/<Separator>
sk: _Pomocník/O Sword moduloch/Komentáre/<Separator>

source: _Help/About Sword Modules/Dictionaries-Lexicons/<Separator>
sk: _Pomocník/O Sword moduloch/Slovníky-lexikóny/<Separator>

source: _Help/About Sword Modules/Bible Texts/
sk: _Pomocník/O Sword moduloch/Biblické texty/

source: _Help/About Sword Modules/Commentaries/
sk: _Pomocník/O Sword moduloch/Komentáre/

source: StrongsHebrew
sk: Hebrejské strongy

source: StrongsGreek
sk: Grécke strongy

source: _Help/About Sword Modules/Dictionaries-Lexicons/
sk: _Pomocník/O Sword moduloch/Slovníky-lexikóny/

source: _Help/About Sword Modules/Books/<Separator>
sk: _Pomocník/O Sword moduloch/Knihy/<Separator>

source: _Help/About Sword Modules/Books/
sk: _Pomocník/O Sword moduloch/Knihy/

source: Goto Reference
sk: Ís» na referenciu

source: Lookup Word
sk: Hµada» slovo

source: Add Bookmark
sk: Prida» záloŸku

source: Add dict/lex key and module to Presonal Bookmarks
sk: Prida» kµúè slovníka/lexikónu a modul do Osobných záloŸiek

source: About this module
sk: O tomto module

source: Show Tabs
sk: Zobrazi» u¹ká

source: Show notebook tabs
sk: Ukáza» záloŸky notesu

source: View in New Window
sk: Zobrazi» v novom okne

source: View this module in a new window
sk: Zobrazi» tento modul v novom okne

source: View Module
sk: Zobrazi» modul

source: Use Current Dictionary
sk: PouŸi» aktuálny slovník

source: Lookup Selection
sk: Hµada» výber

source: Add current verse to Presonal Bookmarks
sk: Prida» aktuálny ver¹ do osobných záloŸiek

source: View Text in new window
sk: Zobrazi» text v novom okne

source: Unlock This Module
sk: Odomknú» tento modul

source: Detach/Attach
sk: Pripoji»/Odobra»

source: GnomeSword - Settings
sk: GnomeSword - nastavenia

source: Font Colors and Sizes
sk: Farba písma a veµkos»

source: Font Size
sk: Veµkos» písma

source: Background Color
sk: Farba pozadia

source: Text Color
sk: Farba textu

source: Current Verse Color
sk: Aktuálna farba ver¹u

source: Current Verse Background Color
sk: Farba pozadia aktuálneho ver¹a

source: Verse Numbers
sk: Èíslo ver¹a

source: Verse Number Font Size
sk: Veµkos» písma èísel ver¹ov

source: Link Color
sk: Farba odkazu

source: Greek Font
sk: Grécke písmo

source: Hebrew Font
sk: Hebrejské písmo

source: Unicode Font
sk: Písmo pre unicode

source: Pick a color for Background
sk: Zvoµte farbu pre pozadie

source: Pick a color for Bible Text
sk: Zvoµte farbu pre biblický text

source: Zero is base font size Go up or down from there
sk: Nula je základná veµkos» písma Choïte hore alebo dolu z tadiaµto

source: Pick a color - CurrentVerse BG
sk: Zvoµte farbu - Aktuálny ver¹ pozadie

source: Pick a color for Current Verse
sk: Zvoµte farbu pre aktuálny ver¹

source: Strongs Numbers & Morph Tags
sk: Strongové èísla a morf oznaèenia

source: Default Font
sk: ©tandardné písmo

source: GnomeSword Defaults
sk: ©tandardné GnomeSword

source: Use GnomeSword defaults for all settings on this page
sk: PouŸi» ¹tandard GnomeSword pre v¹etky nastavenia na tejto strane

source: Bible Text Window
sk: Okno s textom Biblie

source: Use Defaults When Opening GnomeSword
sk: Pri otvorení GnomeSword pouŸi»¹tandardné nastavenia

source: Yes, use defaults that I select
sk: Áno, pouŸi» ¹tandardné, ktoré som zvolil

source: No, use settings saved on last GnomeSword run
sk: Nie, pouŸi nastavenie, ktoré uloŸené pri poslednom spustení GnomeSword

source: Show Bible Texts notebook tabs
sk: Zobrazi» u¹ká Biblií

source: Show Commentary notebook tabs
sk: Zobrazi» u¹ká Komentárov

source: Show Dict/Lex notebook tabs
sk: Zobrazi» u¹ká Lexikónov

source: Use Verse Style
sk: PouŸi» ¹týl ver¹a

source: Show Daily Devotion
sk: Zobrazi» Denné zamyslenia

source: Show Daily Devotion if you have a Devotion module
sk: Zobrazí Denné zamyslenia, ak máte modul Zamyslenia (Devotion)

source: Use Formatting
sk: PouŸi» formátovanie

source: Use HTML tags to format notes
sk: PouŸi» HTML znaèky pre formátovanie poznámok

source: Auto Save
sk: Automaticky uloŸi»

source: Interface
sk: Rozhranie

source: Layout
sk: RozloŸenie

source: App Width
sk: ©írka Ap.

source: ShortCut Bar Width
sk: ©írka panela skratiek

source: Upper Pane Height
sk: Horná vý¹ka sekcie

source: App Height
sk: ©írka Ap.

source: Bible Pane Width
sk: ©írka sekcie biblia

source: label190
sk: popis190

source: Shortcut Bar
sk: Panel skratiek

source: Show Shortcut bar
sk: Zobrazi» panel so skratkami

source: Show Favorites Group
sk: Zobrazi» skupinu obµúbených

source: Show Bible Text Group
sk: Zobrazi» skupinu Biblii

source: Show Commentary Group
sk: Zobrazi» skupinu Komentárov

source: Show Dict/Lex Group
sk: Zobrazi» skupinu Lexikónov

source: Show Book Group
sk: Zobrazi» skupinu kníh

source: Show History Group
sk: Zobrazi» skupinu História

source: Dock Shortcut Bar
sk: Panel so skratkami da» do doku

source: label189
sk: popis189

source: Main Text Module
sk: Hlavný textový modul

source: Commentary
sk: Komentár

source: Personal
sk: Osobné

source: Interlinear 5
sk: Interlinearny 5

source: Interlinear 4
sk: Interlinearny 4

source: Interlinear 3
sk: Interlinearny 3

source: Interlinear 2
sk: Interlinearny 2

source: Interlinear 1
sk: Interlinearny 1

source: Daily Devotional
sk: Denné zamyslenie

source: Greek Lexicon
sk: Grécky lexikón

source: Hebrew Lexicon
sk: Hebrejský lexikón

source: Sword Modules
sk: Sword moduly

source: Preferences
sk: Nastavenia

source: Misc Interface Settings
sk: Ostatné nastavenia rozhrania

source: Shortcut Bar Settings
sk: Nastavenia panela skratiek

source: Welcome To GnomeSword
sk: Vitajte v GnomeSword

source: GnomeSword - Setup
sk: GnomeSword - Nastavenia

source: This guide will take you through the initial setup of GnomeSword
sk: Tento sprievodca vás prevedie cez poèiatoèné nastavenie GnomeSword

source: Your Home Directory:
sk: Vá¹ domovský prieèinok:

source: SWORD verson
sk: Verzia SWORD

source: Sword Directory:
sk: Sword prieèinok:

source: Number of Bible Text Modules:
sk: Poèet modulov Biblických textov:

source: Number of Commentary Modules:
sk: Poèet modulov Komentárov:

source: Number of Lexicon / Dictionary Modules
sk: Poèet modulov Lexikónov / Slovníkov

source: Do you want GnomeSword to open with
sk: Prejete si otvori» GnomeSword s

source: Settings you choose as default
sk: Nastavenia, ktoré ste oznaèili ako ¹tandardné

source: Settings used the last time GnomeSword ran
sk: Nastavenie, ktoré boli pouŸité pri poslednom spustení GnomeSword

source: Settings to use on first program run
sk: Nastavenia, ktoré sa pouŸijú pri prvom spustení programu

source: Show Bible Tabs
sk: Zobrazi» u¹ká Biblií

source: Auto Save Personal comments
sk: Automaticky uloŸi» osobné komentáre

source: Show Commentary Tabs
sk: Zobrazi» u¹ká komentárov

source: Show Interlinear Page
sk: Zobrazi» interlineárnu stránku

source: Show Dict/Lex Tabs
sk: Zobrazi» u¹ká Slov/Lex

source: These setting will be the default settings if you chose to use default settings.
sk: Tieto nastavenie budú ¹tandardnými nastaveniami, ak si zvolíte pouŸitie ¹tandardných nastavení.

source: Thank-you for using GnomeSword. Click Finish to close this dialog and run GnomeSword.
sk: Ïakujeme vám za pouŸívanie GnomeSword. Po kliknutí na Ukonèi» sa uzavrie tento dialóg a spustí GnomeSword.

source: Large Icons
sk: Veµké ikony

source: Small Icons
sk: Malé ikony

source: Add Bible Text
sk: Prida» text Biblie

source: Add Commentary
sk: Prida» komentár

source: Add Dictionary
sk: Prida» Slovník

source: Add Book
sk: Prida» knihu

source: Add Shortcut
sk: Prida» prida» skratku

source: About this Module
sk: O tomto module

source: Remove from Shortcut Bar
sk: Odstráni» z panela skratiek

source: Verse List
sk: Zoznam ver¹ov

source: Search Results
sk: Prehµadáva» výsledky

source: Viewer
sk: Prehliadaè

source: Save List
sk: UloŸi» zoznam

source: Save the current verse list as a bookmark file
sk: UloŸi» aktuálny zoznam ver¹ov ako súbor so záloŸkami

source: Main Form
sk: Hlavná forma

source: Toggle to show results in Main Form
sk: Prepnú» medzi zobrazením výsledkov v hlavnej forme

source: VerseList
sk: Zoznam ver¹ov

source: View Verse List
sk: Zobrazi» zoznam ver¹ov

source: SearchResults
sk: Výsledky hµadania

source: View Search Results
sk: Zobrazi» výsledky hµadania

source: Begin Search
sk: Zaèa» hµadanie

source: Search Type
sk: Typ hµadania

source: Multi Word
sk: Multi slovo

source: Regular Expression
sk: Regulárny výraz

source: Exact Phrase
sk: Presná fráza

source: Search Options
sk: Nastavenie hµadania

source: Case Sensitive
sk: Rozli¹ova» veµkos» písmen

source: Search Commentary
sk: Hµada» v komentároch

source: Search Personal
sk: Hµada» v osobných

source: Search Book
sk: Hµada» v knihách

source: Search Current Book
sk: Hµada» v aktuálnej knihe

source: Search Scope
sk: Rozsah hµadania

source: No Scope
sk: Bez rozsahu

source: Use Bounds
sk: PouŸi» ohranièenie

source: Last Search
sk: Posledné hµadanie

source: Bounds
sk: Ohranièenie

source: Lower
sk: Dolné

source: Upper
sk: Horné

source: Revelation
sk: Zjavenie

source: Favorites
sk: Obµúbené

source: Bible Text
sk: Text biblie

source: Book
sk: Kniha

source: History
sk: História

source: Bookmarks
sk: ZáloŸky

source: Add All Modules
sk: Prida» v¹etky moduly

source: Enter Unlock Key
sk: VloŸi» otvárací kµúè

source: GnomeSword - View Commentary
sk: GnomeSword - Prehliadaè komentárov

source: button7
sk: tlaèítko7

source: Sync with main window
sk: Synchr. s hlavným oknom

source: Enter a verse
sk: VloŸi» ver¹

source: button10
sk: tlaèítko10

source: Goto Verse
sk: Ís» na ver¹

source: button9
sk: tlaèítko9

source: button8
sk: tlaèítko8

source: GnomeSwrod - View Dictionary
sk: GnomeSword - Prehliadaè slovníka

source: Sync
sk: Synchr

source: Lookup key from main window
sk: Hµada» slovo z hlavného okna

source: Lookup:
sk: Hµada»:

source: Load all keys for this module
sk: Naèíta» v¹etky kµúèe pre tento modul

source: Add
sk: Prida»

source: Go to verse
sk: Prejs» na ver¹

source: View Book
sk: Zobrazi» knihu

source: label
sk: popis

source: label200
sk: popis200
