Repository: crosswire/xiphos
Catalog: po/*.po
Languages: bg, fr_fr, zh

source: Initiating GnomeSword
fr_fr: Démarrage de GnomeSword

source: Displaying GnomeSword
fr_fr: Affichage de GnomeSword

source: The Setup Druid was cancelled.
fr_fr: Arrêt de l"assistant d'installation

source: Do you wish to set preferences now?
fr_fr: Souhaitez-vous initialiser les préférences maintenant?

source: done
fr_fr: fait

source: GnomeSword is shutdown
fr_fr: Arrrêt de GnomeSword

source: The
fr_fr: Le

source: module is locked.
fr_fr: Le module est verrouillé

source: module has been unlocked.
fr_fr: Le module a été déverouillé

source: If you have the cipher key you can
fr_fr: Si vous possédez la clé de déverouillage vous pouvez

source: click here
fr_fr: Cliquer ici

source: to unlock the module
fr_fr: pour déverrouiller le module

source: You will need to restart GnomeSword after you unlock it.
fr_fr: Vous devrez relancer GnomeSword après l'avoir déverrouillé.

source: You need to restart GnomeSword to view it
fr_fr: Vous devez redlancer GnomeSword pour le voir

source: H_istory/<Separator>
fr_fr: H_istorique/<Separator>

source: H_istory/C_lear
fr_fr: H_istorique/_Effacer

source: Print Preview
fr_fr: Prévisualisation

source: Failed to print the document
fr_fr: Le document n'a pas pu être imprimé

source: Open StudyPad
fr_fr: Bloc-notes...

source: Open the StudyPad editor
fr_fr: Ouvre l'éditeur de-notes d'étude

source: Copy highlighted text from main window
bg: Копира маркирания в главния прозорец текст
fr_fr: Copier le texte en surbrillance depuis la fenêtre principale

source: Search using the shortcut bar
fr_fr: Utiliser la recherche de la barre de raccourcis

source: Advanced search using the search dialog
fr_fr: Recherche utilisant la fenêtre de recherche avancée

source: C_lear
bg: изчисти
fr_fr: Effacer

source: Clear history list
fr_fr: Effacer l'historique

source: Daily Devotion
bg: размисъл за деня
fr_fr: Culte quotidien

source: Show the Daily Devotion for today
fr_fr: Afficher le culte quotidien pour aujourd'hui

source: Show or hide Bible texts window
fr_fr: Afficher/Cacher la fenêtre des textes bibliques

source: Show or hide commentaries
fr_fr: Afficher/Cacher les commentaires

source: Lower Workbook
fr_fr: Dictionnaires et lexiques

source: Show or hide lower workbook - dictionaries and other books
fr_fr: Affiche/Cache les dictionnaires ou les livres d"étude

source: Verse Style
fr_fr: Style verset

source: Attach/Detach Sidebar
fr_fr: Attacher/Détacher la barre de raccourcis

source: Show/Hide Sidebar
fr_fr: Afficher/Cacher la barre de raccourcis

source: Contents
bg: съдържание
fr_fr: Contenu

source: Open the GnomeSword manual
fr_fr: Ouvrir l'aide de GnomeSword

source: About the SWORD Project ...
fr_fr: À propos du SWORD Project

source: More information about the SWORD Project
fr_fr: Plus d'Information à propos du SWORD Project

source: About GnomeSword ...
fr_fr: À propos de GnomeSword...

source: About this application
fr_fr: Ã propos de cette application

source: Hi_story
fr_fr: H_istorique

source: GnomeSword - Bible Study Software
fr_fr: GnomeSword - Logiciel d'étude de la Bible

source: Books
bg: Книги
fr_fr: Livres d'étude

source: Install the following modules:
fr_fr: Installer les modules suivants :

source: Remove the following modules:
fr_fr: Supprimer les modules suivants :

source: Installing:
fr_fr: Installation de :

source: Removing:
fr_fr: Suppression de

source: Install failed
fr_fr: L"installation a échoué

source: Remove failed
fr_fr: La suppression a échoué

source: Refreshing remote
fr_fr: Rafraîchissement en cours

source: Remote not found
fr_fr: Serveur non trouvé

source: Restart GnomeSword?
fr_fr: Redémarrer GnomeSword?

source: The modules are out of sync!
fr_fr: La synchronisation des modules est perdue!

source: Old
fr_fr: Installé

source: WARNING:
fr_fr: ATTENTION :

source: If you live in a persecuted country use with care.
fr_fr: À utilser avec précautions dans les pays où règne la persécution.

source: Install Source
fr_fr: Support d'installation

source: Local Source
fr_fr: Support local

source: Install Destination
fr_fr: Destination

source: If you live in a persecuted country and do not wish to risk detection you should NOT use the remote installation feature!
fr_fr: NE PAS utiliser l'installation à distance dans les pays où règne la persécution. La confidentialité n'est pas assurée.

source: Install Modules
fr_fr: Installer les modules

source: Remove Modules
fr_fr: Enlever les modules

source: Refresh remote sources
fr_fr: Mise à jour de la liste des modules disponibles

source: Upgrade or install selected modules
fr_fr: Installation ou mise à jour des modules sélectionnés

source: Remove selected module(s)
fr_fr: Suppression des modules sélectionnés

source: Goto verse
fr_fr: Aller au verset...

source: Go to verse in free form lookup and add verse to history
fr_fr: Aller au verset saisi et ajouter le verset à l'historique

source: Personal Comments
bg: лични бележки
fr_fr: Notes personnelles

source: Text
fr_fr: Texte

source: Text to render
fr_fr: Texte à reproduire

source: GnomeSword Preferences
fr_fr: Préférences de GnomeSword

source: General Settings
fr_fr: Général

source: Sword Modules
fr_fr: Modules de Sword

source: Pick the background color
fr_fr: Récupère la couleur du fond

source: Bible text
fr_fr: Texte biblique

source: Pick the Bible text color
fr_fr: Choisissez la couleur du texte biblique

source: Current Verse text
fr_fr: Verset en cours

source: Pick the current Verse color
fr_fr: Récupère la couleur du verset courant

source: Verse numbers
fr_fr: Numéro de verset

source: Verse number font size
fr_fr: Police des n° de verset

source: Zero is the base font size. Increase or decrease the size.
fr_fr: Zéro est la taille de base de la police. Incrémentez ou décrémentez-là.

source: Strong's Numbers & Morphological Tags
fr_fr: Nombres de Strong et étiquettes morphologiques

source: GnomeSword Defaults
bg: Стойности по подразбиране
fr_fr: Options par défaut de GnomeSword

source: Bible Text Window
bg: прозорец за Библията
fr_fr: Fenêtre du texte biblique

source: Use Defaults When Starting GnomeSword
fr_fr: Utiliser les options par défaut au démarrage de GnomeSword

source: Yes, use defaults
fr_fr: Oui, utiliser les options par défaut

source: No, use settings saved the last time I used GnomeSword
fr_fr: Non, utiliser les options de la session précédente de GnomeSwordg

source: Show Tabs
bg: Покажи етикетите
fr_fr: Afficher les onglets

source: Bible texts
fr_fr: Textes bibliques

source: Display Bible text window
fr_fr: Fenêtre du texte biblique

source: Commentaries, Personal Comments and StudyPad
fr_fr: Commentaires, notes personnelles et bloc-notes d'étude

source: Lower workbook
fr_fr: Dictionnaires / Lexiques

source: Dictionary/Lexicon and generic books
fr_fr: Dictionnaire et livres d'étude

source: Use Verse style
fr_fr: Utiliser le style Verset

source: Show Daily Devotion if you have a Devotion module
fr_fr: Afficher les Cultes quotidiens si vous avez un module correspondant

source: Show the splash screen when GnomeSword starts
fr_fr: Afficher l'écran de démarrage

source: Show Dictionary / Lexicon
fr_fr: Affichage des Dictionnaires/Lexiques

source: In Sidebar viewer
fr_fr: Dans le visualiseur de la barre de raccourcis

source: In Dictionary/Lexicon window
fr_fr: Dans la fenêtre dictionnaires et lexiques

source: StudyPad default directory
fr_fr: Répertoire par défaut du bloc-notes d'étude

source: Main Text Module
bg: главен текстов модул
fr_fr: Texte biblique principal

source: Which Greek Lexicon to display in Dictionary/Lexicon window when a link or word is clicked
fr_fr: Lexique grec à afficher dans la fenêtre dictionnaire ou lexique quand un lien ou un mot est cliqué

source: Which Hebrew Lexicon to display in Dictionary/Lexicon window when a link or word is clicked
fr_fr: Lexique hébreu à afficher dans la fenêtre dictionnaire ou lexique quand un lien ou un mot est cliqué

source: Greek Lexicon Viewer
fr_fr: Afffichage du lexique grec

source: Hebrew Lexicon Viewer
fr_fr: Affichage du lexique hébreu

source: Which Greek Lexicon to display in viewer when a link or word is clicked
fr_fr: Lexique grec à afficher dans le visualiseur quand un lien ou un mot est cliqué

source: Which Hebrew Lexicon to display in viewer when a link or word is clicked
fr_fr: Lexique hébreu à afficher dans le visualiseur quand un lien ou un mot est cliqué

source: for
fr_fr: pour

source: Start searching
fr_fr: Démarrer la recherche

source: Scope
fr_fr: Profondeur

source: Custom range
fr_fr: Sélections personnalisées

source: Custom list
fr_fr: Liste personnalisée

source: Include Strong's Numbers
fr_fr: Afficher les nombres de Strong

source: Include Morphological Tags
fr_fr: Afficher les étiquettes morphologiques

source: Include Footnotes
fr_fr: Afficher les notes de bas de page

source: Search Criteria
fr_fr: Recherche Critères

source: Show Context
fr_fr: Afficher le contexte

source: Save Results
fr_fr: Enregistrer les résultats de la recherche

source: Clear
fr_fr: Effacer

source: Search Results
bg: Резултати от търсенето
fr_fr: Résultats de la recherche

source: Preview
fr_fr: Prévisualisation

source: Found
fr_fr: Résultat

source: Save List
bg: запази списъка
fr_fr: Enregistrer la liste

source: Range Name
fr_fr: Nom de la sélecion

source: Range Text
fr_fr: Limites du texte

source: Custom Ranges
fr_fr: Sélections personnalisées

source: Clear Module List
fr_fr: Effacer la liste des modules

source: Clear the module list
fr_fr: Effacer la liste de modules

source: List Name
fr_fr: Nom de la liste

source: Custom Lists
fr_fr: Listes personnalisées

source: Genesis
bg: Битие
fr_fr: Genèse

source: Revelation
bg: Откровение
fr_fr: Apocalypse

source: Welcome To GnomeSword
bg: Добре дошли в GnomeSword
fr_fr: Bienvenue dans GnomeSword

source: Setup
fr_fr: Installation

source: GnomeSword Configuration - Page 1 of 5
fr_fr: Configuration de GnomeSword - Page 1/5

source: Since this is the first time you have run GnomeSword, this assistant will guide you through the initial setup by asking a few simple questions. Once you have completed these steps, you can always change the settings later by using the Preferences dialog.
fr_fr: Comme vous utilisez GnomeSword pour la première fois,. cet assistant va vous aider à initialiser votre configuration en vous posant quelques questions très simples. Vous pourrez ultérieurement modifier cette configuration à votre gré en utilisant le menu Préférences de GnomeSword.

source: GnomeSword Configuration - Page 2 of 5
fr_fr: Configuration de GnomeSword - Page 2/5

source: These values have been detected automatically
fr_fr: L'assistant a détecté les données suivantes :

source: Your home directory:
fr_fr: Votre répertoire personnel :

source: SWORD version
bg: Версия на SWORD
fr_fr: La version de Sword :

source: SWORD Directory:
fr_fr: Le répertoire de Sword :

source: Number of Bible text modules:
fr_fr: Le nombre de modules de textes bibliques :

source: Number of Commentary modules:
fr_fr: Le nombre de modules de commentaires :

source: Number of Dictionary/Lexicon modules:
fr_fr: Le nombre de modules de dictionnaires et lexiques :

source: GnomeSword Configuration - Page 3 of 5
fr_fr: Configuration de GnomeSword - Page 3/5

source: Settings to use when GnomeSword starts
fr_fr: Options à utiliser au démarrage de GnomeSword

source: Show Bible tabs
fr_fr: Onglets des textes bibliques

source: Show Bible window
fr_fr: Afficher les textes bibliques

source: Show Commentary tabs
fr_fr: Onglets des commentaires

source: Show upper workbook
fr_fr: Afficher les commentatires

source: Show Dictionary/Lexicon tabs
fr_fr: Onglets des dictionnaires et lexiques

source: Show lower workbook
fr_fr: Afficher les dictionnaires et lexiques

source: Show book tabs
fr_fr: Onglets des livres d'étude

source: GnomeSword Configuration - Page 4 of 5
fr_fr: Configuration de GnomeSword - Page 4/5

source: Choose default SWORD modules
fr_fr: Choix des modules de Sword par défaut

source: Text Module
fr_fr: Biblie principale

source: Generic book
fr_fr: Livre d'étude

source: Which Greek Lexicon to display in Dictionary/Lexicon Window when a link or word is clicked
fr_fr: Lexique grec à afficher dans la fenêtre dictionnaire et lexique quand un lien ou un mot est cliqué

source: Which Hebrew Lexicon to display in Dictionary/Lexicon Window when a link or word is clicked
fr_fr: Lexique hébreu à afficher dans la fenêtre dictionnaire et lexiqueh quand un lien ou un mot est cliqué

source: GnomeSword Configuration - Page 5 of 5
fr_fr: Configuration de GnomeSword - Page 5/5

source: Thank you for using GnomeSword. Click Apply to close this dialog and run GnomeSword.
fr_fr: Merci d'utiliser Gnomesword. Cliquez sur Appliquer pour fermer cette boîte de dialogue et exécuter GnomeSword.

source: Viewer
fr_fr: Visualiseur

source: Save the search results as bookmarks
fr_fr: Enregistrer lles résultats de la recherche comme signets

source: Open in dialog
fr_fr: Ouvrir dans une fenêtre

source: Open selected module in a dialog
fr_fr: Ouvrir le module selectionné dans une nouvelle fenêtre

source: View information about the selected dialog
fr_fr: Information à propos des modules installés

source: _Bookmarks
fr_fr: _Signets

source: Verse _List
fr_fr: _Liste de versets

source: _Viewer
fr_fr: _Visualiseur

source: Create a new file
fr_fr: Créer un nouveau fichier

source: Open a file
fr_fr: Ouvrir un fichier

source: Save note
fr_fr: Enregistrer la note

source: Delete note
fr_fr: Supprimer la note

source: Print window contents
fr_fr: Inprimer le contenu de la fenêtre

source: Find in this note
fr_fr: Rechercher dans cette note

source: Spell
fr_fr: Vérifier l'orthographe

source: Check spelling in this note
fr_fr: Vérifier l'orthographe de cette note

source: Dictionary/Book
fr_fr: Dictionnaire/Livre d'étude

source: Toggle Dictionary View
fr_fr: Afficher/Cacher le dictionnaire

source: Toggle Parallel View
fr_fr: Vue parallèle

source: Select a Book of the Bible
fr_fr: Sélectionne un livre de la Bible

source: Change Chapter
fr_fr: Change de chapitre

source: Change Verse
fr_fr: Change de verset

source: Enter a Verse reference in Book 1:1 format and press Return or click the Go to Verse button
fr_fr: Saisir une référence de verset et tapez «Entrée» ou cliquez sur «Va au verset»

source: Go to verse
bg: отиди на стих
fr_fr: Va au verset

source: Move backwards through history
fr_fr: Se déplacer en arrière dans l'historique

source: Move foward through history
fr_fr: Se déplacer en avant dans l'historique

source: Preformat
fr_fr: Préformat

source: Bulleted List
fr_fr: Liste à puces

source: Numbered List
fr_fr: Lliste numérotée

source: Roman List
fr_fr: Liste Romaine

source: Alphabetical List
fr_fr: Liste Alphabétique

source: Header 1
fr_fr: Entête 1

source: Header 2
fr_fr: Entête 2

source: Header 3
fr_fr: Entête 3

source: Header 4
fr_fr: Entête 4

source: Header 5
fr_fr: Entête 5

source: Header 6
fr_fr: Entête 6

source: Address
fr_fr: Adresse

source: Automatic
fr_fr: Automatique

source: Left align
fr_fr: Aligner à gauche

source: Left justifies the paragraphs
fr_fr: Paragraphes alignés à gauche

source: Center
fr_fr: Centré

source: Center justifies the paragraphs
fr_fr: Paragraphes alignés au centre

source: Right align
fr_fr: Aligné à droite

source: Right justifies the paragraphs
fr_fr: Paragraphes alignés à droite

source: Typewriter
fr_fr: Courrier

source: Toggle typewriter font style
fr_fr: Mettre/Enlever la police de style courrier

source: Bold
fr_fr: Gras

source: Makes the text bold
fr_fr: Mettre le texte en gras

source: Italic
fr_fr: Italique

source: Makes the text italic
fr_fr: Mettre le texte en italique

source: Underline
fr_fr: Souligné

source: Underlines the text
fr_fr: Souligner le texte

source: Strikeout
fr_fr: Barré

source: Strikes out the text
fr_fr: Barrer le texte

source: Unindent
fr_fr: Annuler l'indentation

source: Indents the paragraphs less
fr_fr: Diminuer l'indentation du paragraphe

source: Indent
fr_fr: Indenter

source: Indents the paragraphs more
fr_fr: Augmenter l'indentation du texte

source: Goto Reference
bg: отиди на ...

source: Make Point to Here
bg: направи посочка за мястото

source: New Group
bg: нова група

source: New SubGroup
bg: нова подгрупа

source: Add Item at Root
bg: добави като корен

source: Sync with Bible Text
bg: синхронизирай с текста

source: Go to previous comment
bg: отиди на предишния коментар

source: Go to next comment
bg: отиди на следващия коментар

source: Print Comment
bg: отпечатай коментара

source: Dock
bg: Док

source: Insert Item
bg: вмъкни ...

source: Add Book
bg: добави книга

source: View Commentary
bg: покажи коментар

source: Lookup Word
bg: провери думата

source: View Dict/Lex
bg: Покажи речник/лексикон

source: View Module
bg: Покажи модул

source: View Text in new window
bg: покажи текста в нов прозорец

source: View in new window
bg: покажи в нов прозорец

source: View in New Window
bg: покажи в нов прозорец

source: About this module
bg: за този модул

source: About The Sword Project
bg: За проекта SWORD

source: About Sword Modules
bg: За модулите на SWORD

source: App Height
bg: Височина

source: Font Colors and Sizes
bg: цвят и размер на шрифта

source: Font Size
bg: Размер на шрифта

source: GnomeSword - Settings
bg: GnomeSword - настройки

source: In Dict/Lex Window
bg: в прозорца на речника

source: Misc Interface Settings
bg: Разни настройки на интерфейса

source: Shortcut Bar Settings
bg: настройки на инструменталната лента

source: The SWORD Project is an effort to create an ever expanding software package for research and study of God and His Word. The SWORD Bible Framework allows easy manipulation of Bible texts, commentaries, lexicons, dictionaries, etc. Many frontends are build using this framework. An installed module set may be shared between any frontend using the framework.
bg: Проектът Sword е опит да се създаде постоянно развиващ се програмен пакет за изследване и изучаване на Бога и Неговото Слово. В рамките на Sword е възможна лесната работа с Библейски текстове, коментари, лексикони, речници и др. Създадени са много frontend програми, които използват рамката създадена от проекта Sword. При тази организация всички инсталирани модули за Sword са на разположение на всяка от frontend програмите.

source: This guide will take you through the initial setup of GnomeSword
bg: Този помощник ще ви преведе през процеса на първоначално настройване на GnomeSword

source: Toggle Footnotes
bg: Промени режима на бележките под линия

source: Use Default Dictionary
bg: Използвай речника по подразбиране

source: where to View Dict/Lex When Link or Word Clicked
bg: къде да се изведе речника при щракане върху връзка/дума

source: Modules can be downloaded from the Sword Project
bg: Можете да изтеглите модули от проекта Sword по интернет

source: The Sword Project
bg: Проектът Sword

source: _New SubGroup
bg: нова _подгрупа

source: Add new SubGroup to selected group
bg: Добавя нова подгрупа на избраната

source: Add New Group
bg: добави нова група

source: Add a new root group and file
bg: добави нова коренна група и файл

source: Save Bookmarks
bg: запази отметките

source: Save all bookmark files
bg: запази всички файлове с отметки

source: Edit Item
bg: редактирай

source: Delete Item(s)
bg: изтрий

source: Delete item and it's siblings
bg: изтрий рекурсивно

source: Toggle Reording - allow items to be moved by draging
bg: превключва речима на подреждане и позволява/забранява местенето чрез влачене

source: Enter SubGroup Name - use no '|'
bg: Въведете име на подгрупа (не използвайте '|')

source: Enter Group Name - use no '|'
bg: Въведете име на група (не използвайте '|')

source: Enter Root Group Name - use no '|'
bg: Въведете име на коренната група (не използвайте '|')

source: GnomeSword - Edit Bookmark
bg: GnomeSword - редактиране на отметки

source: Label
bg: етикет

source: GnomeSword - Open Note File
bg: GnomeSword - отваряне на бележки

source: GomeSword - Save Note File
bg: GnomeSword - съхраняване на бележки

source: _Settings/
bg: _Настройки/

source: Auto Save Personal Comments
bg: Автоматично съхраняване на личните бележки

source: _Quickmarks/
bg: Отбелязани/

source: Clear Quickmarks
bg: изтрий всички

source: _Quickmarks/Clear Quickmarks
bg: Отбелязани/изтрий всички

source: Open search dialog
bg: Започни диалог за дърсене

source: Add current verse to Quickmarks menu
bg: добавя текущия стих към списъка на отбелязаните

source: Language Options
bg: езикови настройки

source: Information about Bible texts
bg: Информация за тази Библия

source: Dictionaries-Lexicons
bg: Речници/лексикони

source: Help Contents
bg: Помощ

source: About the Sword Project...
bg: За проекта Sword...

source: Infotmation About The Sword Project
bg: Информация за проекта Sword

source: Information about the installed modules
bg: Информация за инсталираните модули

source: About GnomeSword...
bg: за GnomeSword...

source: About GnomeSword
bg: за GnomeSword

source: _Quickmarks
bg: Отбелязани

source: GnomeSWORD - Bible Study Software
bg: GnomeSword - програма за изучаване на Библията

source: Back
bg: назад

source: Foward
bg: напред

source: Exit GnomeSword
bg: изход от GnomeSword

source: Synchronize
bg: синхронизирай

source: Synchronize Commentary with Bible Text
bg: синхронизира коментара и текста на Библията

source: Print this Comment
bg: Отпечатва този коментар

source: Study Pad
bg: тетрадка

source: ``%s'' has been modified. Do you wish to save it?
bg: Промяна в ,,%s''. Искате ли промяната да бъдя съхранена?

source: GnomeSWORD Find
bg: GnomeSword търсачка

source: Case Sensitive
bg: чувствителност главни/малки букви

source: Name of module to show when link is clicked
bg: Име на модула, който да бъде показан, при щракане върху връзката

source: GnomeSword - InfoBox
bg: GnomeSword - информация

source: in StudyPad is not saved!
bg: в тетрадката не е съхранен!

source: Shall I save it?
bg: Да го съхраня ли?

source: Pick a color for Background
bg: изберете цвят за фон

source: Pick a color for Bible Text
bg: изберете цвят за текста

source: Zero is base font size Go up or down from there
bg: нула означава базовия размер

source: Pick a color - CurrentVerse BG
bg: изберете цвят за фон на текущия стих

source: Pick a color for Current Verse
bg: изберете цвят за текущия стих

source: Background Color
bg: фонов цвят

source: Text Color
bg: цвят на текста

source: Current Verse Color
bg: цвят на текущия стих

source: Current Verse Background Color
bg: фон на текущия стих

source: Default Font
bg: шрифт по подразбиране

source: Verse Numbers
bg: номер на стих

source: Verse Number Font Size
bg: Размер на шрифта на номера на стиха

source: Link Color
bg: цвят на връзките

source: Greek Font
bg: Гръцки шрифт

source: Hebrew Font
bg: Еврейски шрифт

source: Unicode Font
bg: Unicode шрифт

source: Use GnomeSword defaults for all settings on this page
bg: Използвай настройките по подразбиране за всичко на тази страница

source: Use Defaults When Opening GnomeSword
bg: Използвай насторйките по подразбиране, при стартиране на GnomeSword

source: Yes, use defaults that I select
bg: Да, използвай стойностите, които установя по подразбиране

source: No, use settings saved on last GnomeSword run
bg: Не! Използвай настройките, с които GnomeSword е работил последно

source: Show Shortcut bar
bg: покажи инструменталната лента

source: No, use settings saved on last GnomeSword run
bg: Не! Използвай настройките, с които съм работил последно

source: Show Favorites Group
bg: любими

source: Show Bible Text Group
bg: Библии

source: Show Commentary Group
bg: Коментари

source: Show Dict/Lex Group
bg: Речници и лексикони

source: Show History Group
bg: История

source: Use Formatting
bg: използвай форматиране

source: Auto Save
bg: автоматично съхраняване

source: Layout
bg: изглед
