Repository: crosswire/xiphos
Catalog: po/*.po
Languages: bg, fr_fr, zh

source: App Width
bg: ширина

source: ShortCut Bar Width
bg: ширина на инструменталната лента

source: Upper Pane Hight
bg: височина на горния панел

source: App Hight
bg: височина

source: Bible Pane Width
bg: Ширина на панела за Библията

source: Interface
bg: интерфейс

source: Dict/Lex
bg: Речик/лексикон

source: Your Home Directory:
bg: Вашата домашна дректория:

source: Sword version
bg: версия на Sword

source: Sword Directory:
bg: Директория на Sword

source: Number of Bible Text Modules:
bg: Брой Библии

source: Number of Commentary Modules:
bg: Брой коментари

source: Number of Lexicon / Dictionary Modules
bg: Брой речници / лексикони

source: Do you want GnomeSword to open with
bg: Искате ли GnomeSword да се стартира с

source: Settings you choose as default
bg: настройките, които изберете по подразбиране

source: Settings used the last time GnomeSword ran
bg: настройките, с които GnomeSword е работил последно

source: Settings to use on first program run
bg: Настройки за първото зареждане на програмата

source: Show Bible Tabs
bg: покажи етикети за Библиите

source: Auto Save Personal comments
bg: Записвай автоматично личните ми бележки

source: Show Commentary Tabs
bg: покажи етикет за коментарите

source: Show Dict/Lex Tabs
bg: покажи етикети за речниците

source: These setting will be the default settings if you chose to use default settings.
bg: Тези настройки ще се използват по подразбиране, ако решите да използвате настройки по подразбиране

source: Thank-you for using GnomeSword. Click Finish to close this dialog and run GnomeSword.
bg: Благодаря ви, че използвате GnomeSword. Щакнете на Finish, за да затворите този прозорец и стартирате програмата.

source: Large Icons
bg: големи икони

source: Small Icons
bg: малки икони

source: Add Bible Text
bg: добави Библия

source: Add Commentary
bg: Добави коментар

source: Add Dictionary
bg: добави речник

source: Lexicons / Dictionaries
bg: Лексикони / речници

source: About this Module
bg: За този модул

source: Begin Search
bg: Начало на търсенето

source: Multi Word
bg: всички думи

source: Exact Phrase
bg: точна фраза

source: Search Commentary
bg: търсене в коментарите

source: Last Search
bg: последното търсене

source: Upper
bg: горнa

source: Favorites
bg: Любими

source: Bible Text
bg: Библейски текст

source: History
bg: История

source: Add All Modules
bg: Добави всички модули

source: Enter Unlock Key
bg: Въведи ключ и отключи

source: GnomeSword - View Commentary
bg: GnomeSword - преглед на коментар

source: Sync with main window
bg: Синхронизирай с главния прозорец

source: Enter a verse
bg: Въведете стих

source: Goto Verse
bg: отиди на стих

source: GnomeSword - View Dictionary
bg: GnomeSword - речник

source: Sync
bg: Синхронизиране

source: Load all keys for this module
bg: Зареди всички ключове от този модул
