Repository: crosswire/xiphos
Catalog: po/*.po
Languages: bg, fr_fr, zh

source: _Delete Personal Comment
zh: 刪除個人的評論

source: _Save (Personal Comment)
zh: 保存(個人評論)

source: Add this file to your bookmarks
zh: 添加此文件到您的書籤

source: Create a new document
zh: 建立新文件

source: New Document
zh: 新文件

source: Open
bg: Отвори
fr_fr: Ouvrir
zh: 打開

source: Open a file in Studypad
zh: 打開文件的研究墊

source: Preview the document to be printed
zh: 預覽文件打印

source: Print this document
zh: 打印此文件

source: Save AS
bg: Съхрани като
zh: 另存為

source: Save the current file
fr_fr: Sauvegarder le fichier en cours
zh: 保存當前文件

source: Save the current file as
zh: 保存當前文件的

source: Open the file in Studypad
zh: 打開該文件在研究墊

source: <b>Copy</b>
zh: <b>摹</b>

source: <b>Export</b>
zh: <b?出口</b>

source: <b>Format</b>
zh: <b>格式化</b>

source: Book
bg: Книга
zh: 書

source: Book Radio Button
zh: 圖書單選按鈕

source: Chapter Radio Button
zh: 第單選按鈕

source: Copy/Export Passage
zh: 複製 /出口通道

source: Export Passage Cancel
zh: 取消出口通道

source: Export Passage OK
zh: 出口通道行

source: Export complete book
zh: 出口完成書

source: Export complete chapter
zh: 出口完成章節

source: Export single verse
zh: 出口單詩

source: HTML Radio Button
zh: HTML 單選按鈕

source: Key
zh: 鑰匙

source: Plain Text
zh: 純文本

source: Plain Text Radio Button
zh: 純文本單選按鈕

source: Save Export As
zh: 保存導出為

source: Verse
zh: 詩

source: Verse Radio Button
zh: 詩單選按鈕

source: Verse range
zh: 詩範圍

source: Version
zh: 版本

source: Mark
zh: 馬克

source: Mark/Unmark Verse
zh: 標記 /取消標記詩

source: Unmark
zh: 取消標記

source: <b>Add and Remove Sources</b>
fr_fr: <b>Gérer les sources</b>
zh: <b>添加和刪除源</b>

source: <b>Install Destination</b>
zh: <b>安裝目的地</b>

source: <b>Install Source</b>
zh: <b>安裝源</b>

source: <b>Module Manager</b>
zh: <b>模塊管理</b>

source: <b>WARNING:</b> If you live in a persecuted country use with care.
zh: <b>警告:</b>如果你住在一個受迫害的國家使用的照顧。

source: <b>Warning:</b> If you live in a persecuted country and do not wish to risk detection you should NOT use the remote installation feature!
zh: <b>警告:</b>如果你住在一個受迫害的國家，不希望冒險檢測你不應該使用遠程安裝功能！

source: <i>Personal area, for your use only:</i>
zh: <i>個人區域，只有您可以使用:</i>

source: <i>System area, for all users:</i>
zh: <i>系統方面，為所有用戶:</i>

source: Continue
zh: 繼續

source: Current Remote Sources
fr_fr: Sources distantes actuelles
zh: 當前遠程源

source: Current local sources
zh: 當前當地來源

source: Delete Index
zh: 刪除索引

source: Home dir
zh: 主目錄

source: Load Standard
zh: 負荷標準

source: Local
zh: 鄉土

source: Local Install Folder
zh: 本地安裝文件夾

source: Module Manager
fr_fr: Gestionnaire de modules
zh: 模塊管理

source: Remote
fr_fr: Distant
zh: 遠程

source: Sword sys dir
zh: Sword 系統目錄

source: <b>Revelation of John</b>
zh: <b>約翰的啟示</b>

source: Book Selector Button
zh: 圖書選擇按鈕

source: Choose book to display
zh: 選擇圖書展示

source: Drop down history list
zh: 下拉歷史列表

source: Reference Entry
zh: 參考項

source: Toggle Chapter Button
zh: 切換章按鈕

source: Toggle Verse Button
zh: 切換按鈕詩

source: <b>Font Colors</b>
zh: <b>字體顏色</b>

source: <b>Font Sizes</b>
zh: <b>字體大小</b>

source: <b>General</b>
zh: <b>一般圖書</b>

source: <b>Main Window Modules</b>
zh: <b>主窗口模塊</b>

source: <b>Parallel View</b>
zh: <b>並行查看</b>

source: <b>Show</b>
zh: <b>擺</b>

source: <b>Special Purpose Modules</b>
zh: <b>專用模塊</b>

source: <b>StudyPad default directory</b>
zh: <b>研究墊默認目錄</b>

source: <b>Tabs</b>
zh: <b>標籤</b>

source: Apply high-contrast highlight to current verse
zh: 適用於高對比度突出當前詩歌

source: Automatically resize commentary, book, and dictionary image content to fit subwindow
zh: 自動調整的評注，本書，字典圖片內容，以適應子窗口

source: Background
fr_fr: Arrière-plan
zh: 背景

source: Base font size
zh: 基本字體大小

source: Bible Texts
bg: Текст
fr_fr: Textes bibliques
zh: 聖經文本

source: Bible Texts Checkbox
zh: 聖經文本複選框

source: Biblical Text
fr_fr: Textes bibliques
zh: 聖經文本

source: Change Biblical Text Combo
zh: 聖經文字組合的變化

source: Change Book Combo
zh: 周易組合

source: Change Commentary Combo
zh: 組合變化述評

source: Change Default Dictionary Combo
zh: 更改默認字典組合

source: Change Dictionary Combo
zh: 更改字典組合

source: Change Personal Notes Combo
zh: 修改個人債券組合

source: Choose to enable Prayer lists
zh: 選擇啟用禱告名單

source: Commentaries Checkbox
zh: 評複選框

source: Cover
fr_fr: Couverture
zh: 封面

source: Current Verse
zh: 當前詩

source: Daily Devotional
fr_fr: Culte quotidien
zh: 每日獻身

source: Daily Devotional Combo
zh: 每日獻身組合

source: Default Dictionary
bg: Предпочитан речник
fr_fr: Dictionnaire par défaut
zh: 默認字典

source: Dictionary
fr_fr: Dictionnaire
zh: 字典

source: Dictionary/Lexicon
fr_fr: Dictionnaire/Lexiques
zh: 字典/詞典

source: Dictionary/Lexicon Checkbox
zh: 字典/詞典複選框

source: Enable Prayer Lists
zh: 啟用祈禱列表

source: Enable Prayer Lists Checkbox
zh: 祈禱列表複選框啟用

source: Font Colors
fr_fr: Couleurs des polices
zh: 字體顏色

source: Font Misc
zh: 字體雜項

source: Foreground
zh: 前景

source: General Misc
zh: 一般雜項

source: Greek Lexicon
bg: Гръцки лексикон
fr_fr: Lexique grec
zh: 希臘詞典

source: Greek Lexicon Combo
zh: 希臘詞彙組合

source: Hebrew Lexicon
bg: Еврейски лексикон
fr_fr: Lexique hébreu
zh: 希伯來語詞典

source: Hebrew Lexicon Combo
zh: 希伯來語詞彙組合

source: Highlight Background
zh: 突出背景

source: Highlight Foreground
zh: 突出前景

source: Highlight current verse
zh: 突出顯示當前的詩

source: Highlight current verse check box
zh: 突出顯示當前的詩複選框

source: Links
fr_fr: Liens
zh: 鏈接

source: Modules Main
zh: 模塊主

source: Modules Misc
zh: 模塊雜項

source: Modules Parallel
zh: 模塊並行

source: Parallel 1
fr_fr: Bible parallèle n°1
zh: 緯線1

source: Parallel 1 Combo
zh: 緯線1組合

source: Parallel 2
fr_fr: Bible parallèle n°2
zh: 緯線2

source: Parallel 2 Combo
zh: 緯線2組合

source: Parallel 3
fr_fr: Bible parallèle n°3
zh: 緯線3

source: Parallel 3 Combo
zh: 緯線3組合

source: Parallel 4
fr_fr: Bible parallèle n°4
zh: 緯線4

source: Parallel 4 Combo
zh: 緯線4組合

source: Parallel 5
fr_fr: Bible parallèle n°5
zh: 緯線5

source: Parallel 5 Combo
zh: 緯線5組合

source: Parallel View in a tab
zh: 平行查看製表

source: Personal Notes
zh: 個人筆記

source: Previewer Checkbox
zh: 試播複選框

source: Resize images
zh: 調整圖像

source: Resize images checkbox
zh: 調整圖像複選框

source: Scroll to Previous/Next Chapter
zh: 滾動到上一頁 /下一頁第

source: Scroll to Previous/Next Chapter Checkbox
zh: 滾動到上一頁 /下一頁第複選框

source: Select A Directory
zh: 選擇一個目錄

source: Show Daily Devotion at start up
fr_fr: Afficher les cultes quotidiens au démarrage
zh: 展覽日報迪森在啟動

source: Show splash screen at start up
fr_fr: Afficher l'écran de démarrage
zh: 屏幕上顯示初始啟動

source: Special Locale (requires restart)
zh: 特殊的區域設置(需要重新啟動)

source: Special Locale Combo
zh: 特殊區域設置組合

source: StudyPad default directory combo
zh: 研究組合墊默認目錄

source: Use Bible Text scroll bar to scroll to previous or next chapter
zh: 聖經文本使用滾動條滾動到一個或下一個章節

source: Use Verse Per Line
zh: 使用每行詩

source: Use Verse Per Line Checkbox
zh: 使用複選框每行詩

source: Use default Dictionary
fr_fr: Utiliser le dictionnaire par défaut
zh: 使用默認字典

source: Use default Dictionary Checkbox
zh: 使用默認字典複選框

source: Use tabbed browsing
zh: 使用分頁瀏覽

source: Use tabbed browsing Checkbox
zh: 使用標籤式瀏覽複選框

source: Verse Number
zh: 詩號碼

source: Verse number size
zh: 詩數量規模

source: <b>Attribute</b>
zh: <b>屬性</b>

source: <b>Found</b>
zh: <b>創立</b>

source: <b>List Name</b>
zh: <b>列表名稱</b>

source: <b>Module Lists</b>
zh: <b>模塊列表</b>

source: <b>Modules</b>
zh: <b>模塊</b>

source: <b>Options</b>
zh: <b>選項</b>

source: <b>Preview</b>
zh: <b>預覽</b>

source: <b>Range Definition</b>
zh: <b>範圍定義</b>

source: <b>Range Name</b>
zh: <b>範圍名稱</b>

source: <b>Ranges</b>
zh: <b>範圍</b>

source: <b>Results Display Options</b>
zh: <b>結果顯示選項</b>

source: <b>Scope</b>
zh: <b>範圍</b>

source: <b>Search Results</b>
zh: <b>搜索結果</b>

source: <b>Search Type</b>
zh: <b>搜索類型</b>

source: Add Modules
zh: 添加模塊

source: Advanced Search
fr_fr: Recherche avancée..
zh: 高級搜索

source: Attribute Search
zh: 屬性搜索

source: Attributes
zh: 屬性

source: Attributes radiobutton
zh: 屬性單選按鈕

source: Clear Custom Module List Button
zh: 清除自定義模塊列表按鈕

source: Clear Modules from List Button
zh: 清除模塊的列表按鈕

source: Clear all modules from the list
fr_fr: Effacer tous les modules de la liste
zh: 清除所有模塊從列表

source: Clear lists for new search
fr_fr: Effacer les listes pour une nouvelle recherche
zh: 明確列出了新的搜索

source: Create a new module list
fr_fr: Créer une nouvelle liste de modules
zh: 創建一個新的模塊列表

source: Create new custom range
fr_fr: Créer de nouvelles limites personnalisées
zh: 創建新的自定義範圍

source: Current results
fr_fr: Résultats actuels
zh: 當前結果

source: Current results radiobutton
zh: 目前的結果單選按鈕

source: Custom Module List Combo
zh: 目前的結果單選按鈕

source: Custom Module List Name Entry
zh: 自定義模塊列表名稱條目

source: Custom Module Lists
zh: 自定義模塊列表

source: Custom Range Preview
zh: 自定義範圍預覽

source: Custom Range Selector Combo
zh: 自定義範圍選擇組合

source: Custom Verse Ranges
zh: 自定義詩範圍

source: Custom module list
zh: 自定義模塊列表

source: Custom module list radiobutton
zh: 自定義模塊列表單選按鈕

source: Custom verse range
zh: 自定義範圍詩

source: Custom verse range radiobutton
zh: 自定義詩範圍單選按鈕

source: Delete Range Button
zh: 刪除範圍按鈕

source: Delete Selected Module From List Button
zh: 刪除所選模塊從列表按鈕

source: Delete selected range
fr_fr: Supprimer la selection
zh: 刪除所選範圍

source: Delete the selected list
fr_fr: Supprimer la liste sélectionnée
zh: 刪除選定的列表

source: Entire module
fr_fr: Module en entier
zh: 整個模塊

source: Entire module radiobutton
zh: 整個模塊單選按鈕

source: Exact phrase radiobutton
zh: 整句話單選按鈕

source: Export
fr_fr: Exporter
zh: 出口

source: Export current search results
zh: 出口當前的搜索結果

source: Fast, featureful, index-based search Indexes must have been built beforehand: See Module Manager's maintenance functions
zh: 快速,多特徵的,基於索引的搜索 索引必須事先已建成: 見模塊管理的維護功能

source: Find Button
zh: 查找按鈕

source: Footnotes radiobutton
zh: 腳註單選按鈕

source: In modules that have Footnotes
fr_fr: Dans les modules qui ont des notes de bas de page
zh: 在模塊的註腳

source: In modules that have Morphological Tags
fr_fr: dans les modules avec étiquettes morphologiques
zh: 在模塊的形態標籤

source: In modules that have Strong's Numbers
fr_fr: dans les modules avec nombres de Strong
zh: 在模塊的 Strong's 的號碼

source: Main Search Entry
zh: 主要搜索項目

source: Make selections on the Attribute Search tab
zh: 基於屬性進行選擇搜索選項卡

source: Match case checkbox
zh: 區分大小寫複選框

source: Module Selection
zh: 模塊選擇

source: Module list
fr_fr: Liste de modules
zh: 模塊列表

source: Module list radiobutton
zh: 模塊列表單選按鈕

source: Morphological Tags radiobutton
zh: 形態標記單選按鈕

source: Multi word radiobutton
zh: 多詞單選按鈕

source: New Custom Module List Button
zh: 新的自定義模塊列表按鈕

source: New Range Button
zh: 新範圍按鈕

source: Open a dialog to select modules to add to the list
zh: 打開一個對話框,選擇模塊添加到列表

source: Optimized ("Lucene")
zh: 優化 ("Lucene")

source: Optimized ("Lucene") radiobutton
zh: 優化 ("Lucene") 單選按鈕

source: Range Definition Entry
zh: 範圍定義項

source: Range Name Entry
zh: 範圍名稱條目

source: Regular expression radiobutton
zh: 正則表達式單選按鈕

source: Remove the selected module from the list
fr_fr: Supprimer le module selectionné de la liste
zh: 刪除選定的模塊從列表

source: Result Summary Table
zh: 結果摘要表

source: Result Summary Window
zh: 結果摘要窗口

source: Results
fr_fr: Résultats de la recherche
zh: 結果

source: Save Custom Module List Button
zh: 保存自定義模塊列表按鈕

source: Save Range Button
zh: 保存範圍按鈕

source: Save custom range
fr_fr: Enregistrer la seléction personnalisée
zh: 保存自定義範圍

source: Save search results as bookmarks
fr_fr: Enregistrer lles résultats de la recherche comme signets
zh: 保存搜索結果,書籤

source: Save the module list
fr_fr: Sauvegarder la liste de modules
zh: 保存該模塊列表

source: Search Criteria
zh: 搜索標準

source: Search Criteria Treeview
zh: 搜索標準樹視圖

source: Search entire module
fr_fr: Rechercher dans le module entier
zh: 搜索整個模塊

source: Search for Morphological tags
zh: 搜尋形態標記

source: Search for Strongs Numbers like G4442 or H1121
zh: 搜索 Strong's 的號碼如 G4442 或 H1121

source: Search in footnotes
zh: 搜索腳註

source: Show Footnotes
zh: 顯示腳註

source: Show Footnotes checkbox
zh: 顯示腳註複選框

source: Show Morphological Tags
zh: 節目形態標記

source: Show Morphological Tags checkbox
zh: 節目形態標記複選框

source: Show Strong's Numbers
zh: 顯示 Strong's 的號碼

source: Show Strong's Numbers checkbox
zh: 顯示 Strong's 的號碼複選框

source: Show in main window
fr_fr: Afficher dans la fenêtre principale
zh: 顯示在主窗口

source: Single module
fr_fr: Un seul module
zh: 單一模塊

source: Single module radiobutton
zh: 單一模塊單選按鈕

source: Start/stop searching
zh: 啟動 /停止搜尋

source: Strongs Numbers
zh: Strong's 的號碼

source: Strongs Numbers radiobutton
zh: Strong's 的號碼單選按鈕

source: Use a custom module list for the search
fr_fr: Utiliser une liste personnalisée de modules pour la recherche
zh: 使用自定義模塊列表搜索

source: Use a custom range for the scope of the search
fr_fr: Utiliser une sélection personnalisée comme limites de la recherche
zh: 使用自定義範圍的範圍搜索

source: Use a single module for the search
fr_fr: Utiliser un seul module pour la recherche
zh: 使用一個模塊的搜索

source: Use the current module list for the search
fr_fr: Utiliser la liste actuelle de modules pour la recherche
zh: 當前模塊使用的搜索

source: Use the results of the last search as the scope of the search
fr_fr: Utiliser les résultats e l dernière recherche comme limites de la recherche actuelle
zh: 使用結果的最後一次搜索的範圍搜索

source: e.g. Matt-John;Rev4
fr_fr: ex Mat-Jean, Ap4
zh: 例如:

source: for
zh: 為了

source: About _Translation
zh: 關於翻譯

source: About _Xiphos
zh: 關於 Xiphos

source: Add Item
zh: 新增項目

source: Add Sub-Item
zh: 添加分項目

source: Add a sub-item
zh: 添加一個分項目

source: Add an item
zh: 添加項

source: Add new folder to selected folder
fr_fr: Ajouter un nouveau dossier au dossier sélectionné
zh: 添加新的文件夾選擇文件夾

source: Allow Reordering
bg: разреши пренареждане
fr_fr: Déplacement des signets
zh: 允許重新排序

source: Allow items to be moved from one folder to another
fr_fr: Activer/Désactiver le déplacement des éléments
zh: 允許將項目從文件夾移動到另一個

source: Annotate Verse
zh: 註釋詩

source: Browse in BibleMap.org
zh: 瀏覽 BibleMap.org

source: Collapse All
bg: затвори всички
fr_fr: Réduire tout
zh: 收合

source: Collapse all Bookmarks groups
bg: затвори всички групи отметки
fr_fr: Réduire tous les groupes de signets
zh: 收合書籤組

source: Commentary by Chapter
zh: 評論由章

source: Create a new daily journal
zh: 創建一個新的日報

source: Create a new monthly journal
zh: 創建一個新的月刊

source: Create a new outlined topic
zh: 創建一個新的課題概述

source: Create a new simple prayer list
zh: 創建一個新的簡單的祈禱名單

source: Create a new subject prayer list
zh: 創建一個新的課題祈禱名單

source: D_ouble-Space Text
zh: 雙空間文本

source: Daily
zh: 每日

source: Delete Item
fr_fr: Supprimer l'élément
zh: 刪除項目

source: Delete item
fr_fr: Supprimer l'élément
zh: 刪除項目

source: Dictionar_y
zh: 字典

source: Display Book Heading
zh: 資料冊標題

source: Display Chapter Heading
zh: 顯示章標題

source: Dump Pers.Comm.
zh: 轉儲個人評論

source: Edit bookmark item
bg: Редактира избраната отметка
fr_fr: Éditer un signet
zh: 編輯書籤項目

source: Edit this item
zh: 編輯此項目

source: Expand All
bg: отвори всички
fr_fr: Développer tout
zh: 展開所有

source: Expand all Bookmarks groups
fr_fr: Développer tous les groupes de signets
zh: 擴大所有書籤組

source: Export Folder
zh: 導出文件夾

source: Export List
zh: 輸出列表

source: Image Content
zh: 圖像內容

source: Import Bibletime Bookmarks
fr_fr: Importer les signets de Bibletime
zh: 圖片 BibleTime 書籤

source: Insert Bookmark
fr_fr: Insérer un signet
zh: 插入書籤

source: Insert new bookmark here
fr_fr: Insérer un nouveau signet ici
zh: 這裡插入新的書籤

source: L_ink Tabs
zh: 鏈接標籤

source: Load Bookmarks from Bibletime
fr_fr: Charge les signets de Bibletime
zh: 鏈接標籤負載的書籤 BibleTime

source: Lookup Selection
bg: Провери маркираното
fr_fr: Définition du mot selectionné
zh: 查找選擇

source: Monthly
zh: 每月

source: Note
zh: 注意

source: Open Module
fr_fr: Ouvrir le module
zh: 開放模塊

source: Open Study_pad
zh: 開放性研究墊

source: Open in a dialog
fr_fr: Ouvrir dans une fenêtre
zh: 打開一個對話框

source: Open in a separate window
zh: 打開一個單獨的對話

source: Open in editor
zh: 打開編輯器

source: Open in new tab
zh: 在新標籤中打開

source: Open selected module in a separate ['dialog'] window
zh: 打開選定的模塊，以 獨立 [`對話']窗口

source: Open selected module in a new tab
zh: 打開選定的模塊在新標籤

source: Open this bookmark in a dialog
fr_fr: Ouvrir le signet dans une fenêtre
zh: 打開此書籤對話框

source: Open this bookmark in a new tab
zh: 打開這個書籤在新標籤

source: Outlined
zh: 概述

source: Read Selection Aloud
zh: 選擇大聲讀

source: Remove folder and save it
fr_fr: Sauver et supprimer le dossier
zh: 刪除文件夾,保存

source: Remove this item
zh: 刪除此項目

source: Rename Pers.Comm.
zh: 重命名的個人評論

source: Respect Font Faces
zh: 尊重字型臉

source: Restore Folder
fr_fr: Restaurer le dossier
zh: 恢復文件夾

source: Restore saved folder
fr_fr: Restaurer un dossier sauvegardé
zh: 退休保存的文件夾

source: Save list as a series of bookmarks
zh: 保存列為一系列書籤

source: Save list as a single bookmark
zh: 保存清單作為一個單一的書籤

source: Save these results as a series of bookmarks in their own folder
zh: 這些結果保存為一系列在自己的書籤文件夾

source: Save these results as a single bookmark
zh: 這些結果保存為一個書籤

source: Scripture Cross-references
zh: 經文交叉引用

source: Show Parallel View in a _Tab
zh: 並行顯示的標籤

source: Show Previe_wer in the Sidebar
zh: 顯示在側邊欄中試播

source: Show Verse _Numbers
zh: 數字顯示詩

source: Simple
zh: 簡單

source: Subject
zh: 題目

source: Unlock This Module
bg: Отключи този модул
fr_fr: Déverrouiller ce module
zh: 解開這個模塊

source: Use Current Dictionary
bg: Използвай текущия речник
fr_fr: Utiliser le dictionnaire en cours
zh: 使用目前的字典

source: Use module manager to install and remove Sword modules
fr_fr: Utiliser le gestionnaire de modules pour installer ou supprimer des modules Sword
zh: 使用模塊管理器安裝和刪除模塊劍

source: Variants
zh: 變種

source: _About The SWORD Project
zh: 大約 The SWORD Project

source: _Advanced Search
zh: 高級搜索

source: _Attach/Detach Sidebar
zh: 連接 /分離側邊欄

source: _Bible
zh: 聖經

source: _Commentary/Book
zh: 評 /書

source: _Contents
zh: 內容

source: _Daily Devotion
zh: 每天奉獻

source: _Edit
bg: _редактирай
fr_fr: _Editer
zh: 編輯

source: _Edit Item
fr_fr: Éditer l'élément..
zh: 編輯項目

source: _Help
fr_fr: _Aide
zh: 幫助

source: _Highlight Current Verse
zh: 突出顯示當前的詩

source: _Live Chat
zh: 在線聊天

source: _Mailing List
zh: 郵件列表

source: _Module Manager
zh: 模塊管理

source: _Open Session
zh: 公開會議

source: _Preferences
zh: 偏好

source: _Preview
zh: 預覽

source: _Read Aloud
zh: 朗讀

source: _Report Bug
zh: 報告錯誤

source: _Save Session
zh: 保存會議

source: _Search
fr_fr: _Rechercher
zh: 搜索

source: _Show/Hide Attached Sidebar
zh: 顯示 /隱藏側邊欄附

source: _Verse Per Line
zh: 每行詩

source: Study the Bible
fr_fr: Étudier la Bible
zh: 學習聖經

source: Xiphos Bible Guide
zh: Xiphos 聖經指南

source: GnomeSword2 Bible Guide
fr_fr: GnomeSword - Guide de la Bible

source: Number of Text modules
fr_fr: Le nombre de modules de textes bibliques :

source: Number of Commentary modules
fr_fr: Le nombre de modules de commentaires :

source: Number of Dict/lex modules
fr_fr: Le nombre de modules dictionnaires :

source: Number of Book modules
fr_fr: Le nombre de modules de livres d'étude :

source: Number of Percomm modules
fr_fr: Le nombre de modules de commentaires personnels :

source: Number of Devotion modules
fr_fr: Le nombre de modules de cultes quotidiens :

source: Copyright 2003 The GnomeSword Development team
fr_fr: Copyright 2003 L'équipe de développement GnomeSword

source: We would like to thank Troy Griffitts and all the other folks who have given us The SWORD Project.
bg: Бихме искали да благодариме на Трой Грифитс и всички останали, които ни дадоха проекта Sword
fr_fr: Nos remerciements à Troy Griffitts et tous ceux à qui nous devons le SWORD Project.

source: The SWORD Project is an effort to create an ever-expanding software package for research and study of God and His Word. The SWORD Bible Framework allows easy manipulation of Bible texts, commentaries, lexicons, dictionaries, and other books. Many frontends are built using this framework. An installed module set may be shared between any frontend using the framework.
fr_fr: La démarche du SWORD Project est de créer un ensemble extensible à souhait de logiciels destinés à l'étude de Dieu et de sa Parole. L'infrastructure SWORD-Bible permet de naviguer facilement dans:les textes bibliques, commentaires, lexiques, dictionnaires, etc.. De nombreux logiciels sont developpés en utilisant cette infrastructure. Elle permet le partage du même ensemble de modules installés par tous les logiciels qui l'employent.

source: Modules can be downloaded from the SWORD Project
fr_fr: Les modules sont téléchargeables depuis le site du SWORD Project

source: The SWORD Project
fr_fr: Le SWORD Project

source: Romans
bg: Римляни
fr_fr: Romains

source: Romans 8:28
bg: Римляни 8:28
fr_fr: Romains 8:28

source: in a dialog
fr_fr: dans une fenêtre

source: Sync with Main Window
fr_fr: Synchroniser avec la fenêtre principale

source: Keep in Sync
fr_fr: Synchronisé

source: Open New Dialog
fr_fr: Ouvrir une nouvelle boite de recherche

source: Print
bg: печат
fr_fr: Imprimer...

source: Close
fr_fr: Fermer

source: Set font for this module
fr_fr: Sélectionner la police de ce module

source: Show
fr_fr: Affichage

source: Tabs
fr_fr: Onglets

source: Remove Folder
fr_fr: Supprimer le dossier

source: Remove - Restore
fr_fr: Charger - Sauver

source: Note for
fr_fr: Note pour

source: has been modified. Do you wish to save it?
fr_fr: a été modifié. Voulez-vous l'enregistrer?

source: Toggle sync with main window
fr_fr: Synchroniser avec la fenêtre principale

source: Navigate
fr_fr: Naviguer

source: Sync with NavBar
fr_fr: Synchroniser avec la barre de navigation

source: Previous Comment
fr_fr: Commentaire précédent

source: Next Comment
fr_fr: Commentaire suivant

source: Chapter Heading
fr_fr: Titre du chapitre

source: Book Heading
fr_fr: Titre du livre

source: Load current key
fr_fr: Charge la clé indiquée

source: View Current Book
fr_fr: Afficher le livre d'étude courant

source: -untitled-
bg: -без име-
fr_fr: -sans titre-

source: Delete Note?
fr_fr: Supprimer la note?

source: Are you sure you want to delete the note for
fr_fr: Êtes-vous certain de supprimer la note de

source: Add reference Link
fr_fr: Ajouter un lien de référence

source: Reference:
fr_fr: Référence:

source: Save Note
bg: запиши бележка
fr_fr: Enregistrer note

source: Export Note
fr_fr: Exporter la note

source: Delete Note
bg: изтрий бележка
fr_fr: Supprimer note

source: Open File
fr_fr: Ouvrir..

source: Save Entry
fr_fr: Enregistrer l'entrée

source: Delete Entry
fr_fr: Supprimer l'entrée

source: Save As ...
fr_fr: Enregistrer sous...

source: Cut
bg: отрежи
fr_fr: Couper

source: Paste
bg: вмъкни
fr_fr: Coller

source: Spell Check
bg: проверка на правописа
fr_fr: Vérifier l'orthographe...

source: Undo
bg: отмени
fr_fr: Annuler

source: Replace
bg: замени
fr_fr: Remplacer..

source: Link...
bg: връзка...
fr_fr: Lien..

source: Replace confirmation
fr_fr: Confirmer le remplacement

source: Replace all
fr_fr: Remplacer tout

source: Next
fr_fr: Suivant

source: Find and Replace
fr_fr: Chercher et remplacer dans cette note

source: with
fr_fr: avec

source: Search Backwards
fr_fr: Rechercher en arrière

source: Match Case
fr_fr: Respecter la casse

source: Spell Checker
fr_fr: Vérifier l'orthographe

source: Word found
fr_fr: Mot trouvé

source: Replace with
fr_fr: Remplacer par

source: Replace misspelled word with suggested word
fr_fr: Remplacer le mot mal orthographié par le mot suggéré

source: Replace word
fr_fr: Remplacer le mot

source: Leave word as is
fr_fr: Laisser le mot tel quel

source: Skip Word
fr_fr: Ignorer ce mot

source: Accept word for this session but do not add to dictionary
fr_fr: Accepter le mot dans cette session mais ne pas l'ajouter au dictionnaire

source: Accept word
fr_fr: Accepter le mot

source: Insert word into Personal Dictionary
fr_fr: Insérer le mot dans le dictionnaire personnel

source: Insert word
fr_fr: Insérer un mot

source: Progress
fr_fr: Progression

source: Open StudyPad File
fr_fr: Ouvrir..

source: Save StudyPad File
fr_fr: Enregistrer le fichier du bloc-Notes d'étude

source: Go to %s
bg: отиди на %s
fr_fr: Aller à %s

source: View Current Dict/Lex
fr_fr: Afficher le dictionnaire ou lexique actuel
