Repository: crosswire/xiphos
Catalog: po/*.po
Languages: bg, fr_fr, zh

source: Configuration not found
zh: 配置未找到

source: Page %d of %d
fr_fr: Page %d de %d
zh: 頁 %d 的 %d

source: Are you sure you want to delete the note for
zh: 您確定要刪除說明中

source: Save the changes to document
zh: 保存更改文件

source: before closing?
zh: 關閉之前?

source: If you don't save, changes will be permanently lost.
zh: 如果您不保存,更改將永久丟失。

source: File
bg: Файл
fr_fr: Fichier
zh: 文件

source: StudyPad
fr_fr: Bloc-notes d'étude
zh: 研究墊

source: Note Editor
zh: 注意:編輯器

source: Prayer List/Journal Editor
zh: 祈禱名單/期刊編輯

source: Save As
zh: 另存為

source: Untitled document
zh: 無標題文檔

source: HTML Output
zh: HTML輸出

source: HTML Source
zh: HTML源代碼

source: Plain Source
zh: 平原源

source: _Print...
zh: 打印

source: Print Pre_view
zh: 打印預覽

source: _Quit
zh: 退出

source: _Open
zh: 打開

source: _Save
zh: 保存

source: Save _As...
zh: 另存為

source: New
bg: нов
fr_fr: Nouveau
zh: 新的

source: Open new document
zh: 打開新文件

source: Delete
fr_fr: Supprimer
zh: 刪除

source: Delete current note
zh: 刪除本說明

source: _File
fr_fr: _Fichier
zh: 文件

source: HTML _Output
zh: HTML輸出

source: _HTML Source
zh: HTML源代碼

source: _Plain Source
zh: 平原源

source: _View
fr_fr: _Affichage
zh: 查看

source: Save
bg: Съхрани
fr_fr: Enregistrer
zh: 保存

source: Insert Link
zh: 插入鏈接

source: Unlock
fr_fr: Entrez la clé de déverrouillage
zh: 解鎖

source: Preparing to print
zh: 準備打印

source: Printing is not supported on this printer
zh: 印刷不支持這台打印機

source: Printer %s does not support PostScript printing.
zh: 打印機 %s 不支持PostScript打印。

source: Printing
zh: 印刷

source: Waiting to print
zh: 等待打印

source: An error occurred while printing
zh: 發生錯誤時打印

source: It was not possible to print your document: %s
zh: 這是不可能的打印文檔:%s

source: About Sword Module
fr_fr: À propos des Modules de Sword
zh: 關於劍模塊

source: The module has no About information.
zh: 該模塊有沒有關於信息。

source: The SWORD Project is an effort to create an ever-expanding software package for research and study of God and His Word. The SWORD Project framework allows easy use and study of Bible texts, commentaries, lexicons, dictionaries, and other books. Many frontends are built using this framework. An installed set of books may be shared among all frontends using the framework.
zh: The SWORD Project 是為了創造一個不斷擴大的軟件包的研究和學習的上帝和他的話語。劍項目的框架可以輕鬆的使用和研究聖經的文本,評論，詞典,字典,和其他書籍。許多前端都採用這一框架。已安裝的一套書可能還會將在所有前端使用的框架。

source: About the SWORD Project
fr_fr: À propos du SWORD Project
zh: 關於劍項目

source: Sword Version
fr_fr: Version de Sword
zh: 劍版本

source: Books can be downloaded from the SWORD Project
zh: 書籍可以下載劍項目

source: Do you like using Xiphos to study the Bible? Would you like to see its display using your native language? You could translate Xiphos! We are always looking for contributions of new translations of Xiphos into other languages. If you are able to translate for us, please see the link below, contact us, and get involved with our efforts.
zh: 你喜歡使用Xiphos研究聖經？你想看到它的顯示使用您的母語?你可以翻譯 Xiphos! 我們一直在尋找新的貢獻的Xiphos翻譯成其他語言。如果您能為我們翻譯,請參閱以下鏈接,聯繫我們,並獲得參與我們的努力。

source: About Xiphos Translation
zh: 關於 Xiphos翻譯

source: See TRANSLATION-HOWTO in Xiphos source
zh: 見翻譯如何在Xiphos源

source: Xiphos development
zh: Xiphos發展

source: Copyright 2000-2009 The Xiphos Development Team
zh: 版權所有 2000-2009的Xiphos開發團隊

source: (formerly known as GnomeSword) Powered by The SWORD Project. We would like to thank Troy Griffitts and all the other folks who have given us The SWORD Project.
zh: （以前稱為 GnomeSword） 本站由劍項目。 我們要感謝 Troy Griffits 和所有其他伙計誰給了我們 The SWORD Project.

source: Go to
fr_fr: Aller à
zh: 轉到

source: Bookmark
fr_fr: Signet
zh: 書籤

source: Enter Folder Name
fr_fr: Entrer le nom du dossier
zh: 輸入文件夾名稱

source: Folder Name
fr_fr: Nom du dossier
zh: 文件夾名稱

source: Folder:
fr_fr: Dossier :
zh: 文件夾:

source: Edit
fr_fr: Éditer
zh: 編輯

source: Folder name:
fr_fr: Nom du dossier :
zh: 文件夾名稱:

source: Bookmark name:
fr_fr: nom du signet
zh: 書籤名稱:

source: Verse:
fr_fr: Verset:
zh: 詩:

source: Module:
zh: 模塊

source: Restore Bookmark Folder
fr_fr: Restaurer le dossier des signets
zh: 還原書籤文件夾

source: Remove the selected folder
fr_fr: Supprimer le dossier sélectionné
zh: 刪除所選的文件夾

source: (and all its contents)?
fr_fr: (et tout ses contenus)?
zh: (及其所有內容)?

source: Remove the selected bookmark
fr_fr: Supprimer le signet
zh: 刪除所選的書籤

source: Add
bg: Добави
fr_fr: Ajouter
zh: 添加

source: Label:
fr_fr: Étiquette
zh: 標籤:

source: Search result: %s
zh: 搜尋結果:%s

source: Bookmarks
bg: Отметки
fr_fr: Signets
zh: 書籤

source: Cipher Key?
fr_fr: Clé de déverrouillage?
zh: 加密密鑰?

source: for:
fr_fr: pour:
zh: 為:

source: Enter Cipher Key:
fr_fr: Entrer la clé de déverouillage:
zh: 輸入密碼的關鍵:

source: Close without Saving
zh: 關閉而不保存

source: Close _without Saving
zh: 關閉而不保存

source: Please check copyright before exporting!
zh: 請檢查版權出口前!

source: Find
bg: намери
fr_fr: Rechercher...
zh: 查找

source: Enter Word or Phrase
bg: въведете дума или фраза
fr_fr: Entrez un mot ou une phrase
zh: 輸入單詞或短語

source: Match case
fr_fr: Respecter la casse
zh: 區分大小寫

source: Search backwards
fr_fr: Rechercher en arrière
zh: 向後搜索

source: Regular expression
fr_fr: Expression régulière
zh: 正則表達式

source: Find Next
bg: намери следващ
fr_fr: Rechercher suivant
zh: 查找下一個

source: Set Module Font
fr_fr: Changer la police
zh: 字體設置模塊

source: Change font for
fr_fr: Change la police de
zh: 更改字體的

source: Module
bg: Модул
zh: 模塊

source: Current font:
fr_fr: Police utilisée :
zh: 當前字體:

source: Use the default font for this module
fr_fr: Police par défaut dans ce module
zh: 使用默認字體為這個模塊

source: URL references using "sword://" (similar to web page references) can be used by programs to look up scripture references. Your system currently has no program set to handle these references. Would you like Xiphos to set itself as the program to handle these references?
zh: 網址引用使用"sword：//"(類似網頁 參考文獻)可以使用程序來查找 經典引用。您的系統目前沒有 程序設置為處理這些引用。 你想Xiphos本身設置成 程序來處理這些引用？

source: Xiphos has successfully set itself as the handler of sword:// and bible:// URLs. You may wish to run the program "gconf-editor" to examine keys under /desktop/gnome/url-handlers, if you need to change these.
zh: Xiphos已成功地為自己 為處理程序根據 sword:/ /和 bible：/ / URLs。 您可能希望運行程序"gconf-editor" 根據審查鍵 /desktop/gnome/url-handlers， 如果您需要更改這些。

source: Xiphos failed to complete handler init for key #%d: %s
zh: Xiphos未能完成處理程序初始化關鍵＃%d: %s

source: BUG! Xiphos is about to crash due to a "STRDUP" error.
zh: 錯誤! Xiphos即將崩潰由於 "STRDUP"的錯誤。

source: Please report this error to the Xiphos team with:
zh: 請將此錯誤報告給 Xiphos團隊:

source: BUG! Xiphos is about to crash due to a "STRING" error.
zh: 錯誤! Xiphos即將崩潰由於 "STRING"的錯誤。

source: Xiphos - Bible Study Software
zh: Xiphos - 聖經學習軟件

source: Open a new tab
zh: 打開一個新標籤

source: Standard View
zh: 標準視圖

source: Commentary View
zh: 述評看法

source: Book View
zh: 圖書查看

source: Welcome to Xiphos
zh: 歡迎 Xiphos

source: Renaming is not available in Windows. Xiphos is limited by Windows' filesystem, because it disallows the renaming of filename components of currently-open files, such as the contents of this commentary. Therefore, personal commentary renaming is not available in the Windows environment.
zh: 命名是無法在Windows。 Xiphos受限於 Windows的文件系統, 因為它不允許重命名的文件名 組件當前打開的文件, 如本評注的內容。 因此,個人的評注重命名為 沒有在Windows環境中。

source: Rename Commentary
zh: 重評

source: Choose Commentary Name
zh: 選擇評論的名稱

source: New Name
zh: 新名稱

source: Name:
zh: 名稱:

source: Module names must contain [A-Za-z0-9_] only.
zh: 模塊名稱必須包含[A-Za-zz0-9_]只。

source: Xiphos already knows a module by that name.
zh: Xiphos已經知道一個模塊，該名稱。

source: Failed to create new configuration: %s
zh: 未能創造新的配置: %s

source: Configuration build error:
zh: 配置生成錯誤:

source: Remove these modules?
zh: 刪除這些模塊?

source: Preparing to remove
zh: 正準備刪除

source: Removing
zh: 刪除

source: Remove
fr_fr: Supprimer
zh: 刪除

source: Install these modules?
zh: 安裝這些模塊?

source: Preparing to install
zh: 準備安裝

source: Installing
zh: 安裝

source: Install
fr_fr: Installer
zh: 安裝

source: Archive these modules?
zh: 這些模塊的檔案?

source: Preparing to archive
zh: 準備存檔

source: Archiving
zh: 歸檔

source: Archive
zh: 檔案

source: Build fast-search index for these modules (may take minutes/module)?
zh: 建立快速搜索索引這些 模塊(可能只需要幾分鐘 /模塊)?

source: Preparing to index
zh: 準備指數

source: Indexing
zh: 索引

source: Index
zh: 指數

source: Delete fast-search index for these modules?
zh: 刪除快速搜索索引這些模塊?

source: Preparing to delete index
zh: 準備刪除索引

source: Deleting index
zh: 刪除指數

source: Deletion
zh: 刪除

source: Module Name
fr_fr: Nom du module
zh: 模塊名稱

source: A checkmark means this module is already installed
zh: 阿勾意味著這個模塊已經安裝

source: Click the box to work on this module
zh: 按一下方塊,以這方面的工作模塊

source: Click the box to select this module for install/update
zh: 單擊以選中此模塊的安裝 /更新

source: Installed
zh: 安裝

source: The index icon means you have built an optimized ('lucene') index for this module for fast searching (see the Maintenance pane for this function)
zh: 該指數圖標意味著你已經建立了優化（'Lucene'）這個模塊指數快速搜索（見維護窗格中的此功能）

source: The lock icon means this module is encrypted, and requires that you purchase an unlock key from the content owner
zh: 鎖圖標表示該模塊加密,並要求您購買解鎖密鑰從內容所有者

source: About
fr_fr: À propos de
zh: 大約

source: The refresh icon means the Installed module is older than the newer Available module: You should update the module
zh: 刷新圖標表示已安裝的模塊老年人較新的可用模塊：你應該更新模塊

source: Available
zh: 可用的

source: Size
zh: 大小

source: Description
zh: 描述

source: `mkdir %s' failed: %s.
zh: `mkdir %s' 失敗: %s.

source: archived in:
zh: 存檔在:

source: Journals and prayer lists cannot be indexed.
zh: 期刊和祈禱名單不能被索引。

source: %s failed
zh: %s 失敗

source: Finished
fr_fr: Terminé
zh: 成品

source: Unknown
fr_fr: Inconnu
zh: 未知

source: Repository: %s
zh: 庫: %s

source: Categorized by Module Type
zh: 分類為 模塊類型

source: Biblical Texts
bg: Библейски текстове
fr_fr: Textes bibliques
zh: 經文

source: Commentaries
bg: Коментари
fr_fr: Commentaires
zh: 評

source: Dictionaries
fr_fr: Dictionnaires
zh: 字典

source: Daily Devotionals
zh: 每日靈修

source: General Books
fr_fr: Livres d'étude
zh: 一般圖書

source: Maps
zh: 地圖

source: Images
zh: 圖片

source: Categorized by Availability
zh: 分類為 可用性

source: Updates
zh: 更新

source: Uninstalled
zh: 卸載

source: Prayer List/Journal
zh: 祈禱名單 /期刊

source: Refreshing from remote source
zh: 從遠程源刷新

source: Remote source not found
zh: 遠程源未找到

source: Configure
fr_fr: Configurer
zh: 配置

source: Type
zh: 類型

source: Caption
zh: 標題

source: Source
zh: 來源

source: Directory
zh: 目錄

source: User
zh: 用戶

source: Password
zh: 密碼

source: Module Sources
zh: 模塊源

source: Add/Remove
fr_fr: Ajouter/Supprimer
zh: 添加/刪除

source: Choose
zh: 選擇

source: Modules
zh: 模塊

source: Install/Update
zh: 安裝 /更新

source: Maintenance
zh: 維修

source: Please Refresh
fr_fr: Rafraîchir
zh: 請刷新

source: Your module list is not up to date!
fr_fr: La liste des modules n'est pas à jour!
zh: 模塊列表不是最新消息!

source: You have uninstalled your last Bible. Xiphos requires at least one.
zh: 您已經卸載您的最後聖經。 Xiphos至少需要一個。

source: There are still no Bibles installed. Xiphos cannot continue without one.
zh: 目前還沒有聖經安裝。 Xiphos不能繼續無一。

source: Standard remote sources have been loaded.
zh: 標準遠程來源已經被加載。

source: Could not load standard sources from CrossWire.
zh: 無法加載標準從 CrossWire來源。

source: Remove the selected source
zh: 刪除選定的源

source: Enter a remote source
fr_fr: Saisir une source distante
zh: 輸入遠程源

source: Caption:
zh: 標題:

source: Type:
zh: 類型:

source: Host:
zh: 主人:

source: Directory:
fr_fr: Répertoire :
zh: 目錄:

source: User (optional):
zh: 用戶(可選):

source: Password (optional):
zh: 密碼(可選):

source: A source by that name already exists.
zh: 據消息人士該名稱已存在。

source: Delete a remote source
zh: 刪除遠程源

source: <b>Welcome to the Module Manager.</b> This is Xiphos' mechanism to get new and updated content. It appears you have never been here before, so please take a moment to look it over. (You will see this information box just once.) Modules come from different <u>repositories</u>. <b>Module Sources: Add/Remove</b> will show you what repositories are currently known. <b>Module Sources: Choose</b> is for deciding from where modules should come, that is, from which repository Xiphos should obtain them, as well as where they should be placed on your system. Set <i>Install Source</i> and <i>Install Destination</i>, then click <i>Refresh</i>. <b>Modules: Install/Update</b> is for selecting and obtaining modules after choosing source and destination. <b>Modules: Maintenance</b> is for archive and index creation. See section 5 of our manual for Module Manager detail, or ask for help via Live Chat, or (if no one is responsive in chat) send mail to our users' mailing list.
zh: <b>歡迎的模塊管理。</b> 這是Xiphos'機制,以獲得新的和更新的內容。 看來你從來沒有來過這裡,所以請花點時間看一下。 (您將看到此信息框中一次。) 模塊來自不同<u>庫</u>。的<b>模塊來源:添加/刪除</b>將介紹目前已知的資料庫。 的<b>模塊來源:選擇</b>是決定從那裡模塊應該,也就是從中庫 Xiphos應該得到他們,以及他們應該放在您的系統。設置 <i>安裝源</i>和<i>安裝目的地</i>,然後單擊 <i>刷新</i>。 的<b>模塊:安裝 /更新“</b>是選擇和獲取模塊,在選擇源和目標。 的<b>模塊:維護</b>是存檔和索引創建。 見的5手冊模塊管理細節,或求助通過在線聊天,或(如果沒有人響應,在聊天)郵件發送到用戶的郵件列表。

source: Go outward, to the section containing this one
zh: 去向外,向包含此一節

source: Go to previous item
zh: 轉到前一個項目

source: Go to next item
zh: 轉到下一個項目

source: Go inward, to the first subsection
zh: 轉到向內,第一款

source: Synchronize this window from main window
zh: 同步這個窗口從主窗口

source: Parallel
fr_fr: Parallèle
zh: 平行

source: Copy
bg: копирай
fr_fr: Copier
zh: 摹

source: Detach/Attach
bg: закачи/откачи
fr_fr: Détacher/Attacher
zh: 分離 /附加

source: Module Options
bg: Опции на модула
fr_fr: Options du module
zh: 模塊選項

source: Change parallel 1
fr_fr: Changer parallèle 1
zh: 變更並行1

source: Change parallel 2
fr_fr: Changer parallèle 2
zh: 變更並行2

source: Change parallel 3
fr_fr: Changer parallèle 3
zh: 變更並行3

source: Change parallel 4
fr_fr: Changer parallèle 4
zh: 變更並行4

source: Change parallel 5
fr_fr: Changer parallèle 5
zh: 變更並行5

source: Parallel View
fr_fr: Vue parallèle
zh: 並行查看

source: -- Select --
zh: -- 選擇 --

source: Locale will take effect after restart.
zh: 語言將重新啟動後生效。

source: Preferences
bg: Предпочитания
fr_fr: Préférences
zh: 偏好

source: Fonts
zh: 字體

source: Color
zh: 顏色

source: Sizes
zh: 尺寸

source: General
fr_fr: Général
zh: 汎

source: Tabs and Panes
zh: 標籤和窗格

source: Options
zh: 選項

source: Main
zh: 主要的

source: Special
zh: 特別

source: Searching the
fr_fr: Rechercher le
zh: 搜索

source: Module
zh: 模塊

source: found in
fr_fr: trouvé dans
zh: 發現

source: Clear List?
fr_fr: Effacer la liste?
zh: 清除列表?

source: Are you sure you want to clear the module list?
fr_fr: Êtes-vous certain de supprimer lla liste des modules?
zh: 您確定要清除模塊列表?

source: The last module list may not be deleted
zh: 最後一個模塊列表可能不會被刪除

source: Delete list?
fr_fr: Supprimer la liste?
zh: 刪除列表?

source: Are you sure you want to delete:
fr_fr: Êtes-vous certain de supprimer:
zh: 您確定要刪除:

source: This is an inclusive ("AND") search: Find matches showing all words.
zh: 這是一個包容性的("和")搜索: 查找匹配項顯示所有的話。

source: Search Module
fr_fr: Rechercher dans :
zh: 搜索模塊

source: Bible
fr_fr: Texte biblique
zh: 聖經

source: Commentary
bg: коментар
fr_fr: Commentaires
zh: 述評

source: Search Type
bg: Тип търсене
fr_fr: Type de recherche :
zh: 搜索類型

source: Multi word
fr_fr: Mots multiples
zh: 多字

source: Exact phrase
fr_fr: Phrase exacte
zh: 精確短語

source: Search Options
bg: опции
fr_fr: Options de la recherche :
zh: 搜索選項

source: Search Scope
fr_fr: Étendue de la recherche :
zh: 搜索範圍

source: No scope
fr_fr: Pas de limites
zh: 沒有範圍

source: Use bounds
fr_fr: Avec limites
zh: 使用範圍

source: Last search
fr_fr: Limites précédentes
zh: 最後一次搜索

source: Bounds
bg: Граници
fr_fr: Limites
zh: 界下

source: Lower
bg: долнa
fr_fr: Basse:
zh: 下

source: Upper
fr_fr: Haute
zh: 上

source: Search
bg: Търсене
fr_fr: Rechercher
zh: 搜索

source: Verse List
fr_fr: _Liste de versets
zh: 詩名單

source: Sidebar
fr_fr: Barre latérale
zh: 側欄

source: Powered by the SWORD Project
zh: 本站由 The SWORD Project

source: Prayer List/Journal Item
zh: 祈禱名單 /雜誌項目

source: New name
zh: 新名稱

source: Remove the selected item
zh: 刪除所選項目

source: Improperly encoded personal annotation label: '%s'
zh: 不正確編碼的個人註釋標籤: '%s'

source: An image file's size could not be determined. Is ImageMagick's 'identify' not installed? (Or possibly the image is of type other than bmp/gif/jpg/png.) Xiphos cannot resize images to fit window.
zh: 一個圖像文件的大小不能確定。 是ImageMagick的'確定'沒有安裝？ (或者可能是圖像的類型以外 bmp/gif/jpg/png。) Xiphos無法調整圖片以適合窗口。

source: Chapter
zh: 章

source: Xiphos does not understand more than one argument.
zh: Xiphos不理解多個參數。

source: Initiating Gecko
zh: 起爆壁虎

source: Building Interface
zh: 建築界面

source: Starting Sword
zh: 啟動 Sword

source: Displaying Xiphos
zh: 顯示 Xiphos

source: Previewer
zh: 試播

source: Footnote
zh: 腳註

source: Cross Reference
zh: 交叉參考

source: Strongs
zh: 斯特朗斯

source: Morphology
zh: 形態

source: Back to
zh: 返回

source: Strong's Numbers
zh: 強大的數字

source: Footnotes
bg: бележки под линия
zh: 腳註

source: Morphological Tags
zh: 形態標記

source: Hebrew Vowel Points
zh: 希伯來語元音點

source: Hebrew Cantillation
zh: 希伯來語吟唱

source: Greek Accents
zh: 希臘口音

source: Cross-references
zh: 交叉引用

source: Lemmas
zh: 引理

source: Headings
bg: заглавия
zh: 標題

source: Morpheme Segmentation
zh: 語素分割

source: Words of Christ in Red
zh: 詞基督紅

source: Transliteration
zh: 音譯

source: Textual Variants
zh: 考變種

source: Primary Reading
zh: 小學讀

source: Secondary Reading
zh: 中學讀

source: All Readings
zh: 所有讀

source: view context
zh: 視圖中的上下文

source: Growth
zh: 生長

source: <b>For Growth</b><br>
zh: <b>促進增長</b><br>

source: Salvation
zh: 救世軍

source: <b>For Salvation</b><br>
zh: <b>為拯救</b><br>

source: Health
zh: 健康

source: <b>For Health</b><br>
zh: <b>衛生</b><br>

source: Misc
bg: Разни
zh: 船務

source: <b>Miscellaneous</b><br>
zh: <b>雜項</b><br>

source: Point x
zh: 點子 x

source: Point y
zh: 點子 y

source: Point z
zh: 點子 z

source: Minor Topic 1
zh: 小型主題 1

source: <b>Subtopic 1</b><br>
zh: <b>副標題 1</b><br>

source: Minor Topic 2
zh: 小型主題 2

source: <b>Subtopic 2</b><br>
zh: <b>副標題 2</b><br>

source: Minor Topic 3
zh: 小型主題 3

source: <b>Subtopic 3</b><br>
zh: <b>副標題 3</b><br>

source: Minor Topic 4
zh: 小型主題 4

source: <b>Subtopic 4</b><br>
zh: <b>副標題 4</b><br>

source: Name for new prayer list or journal
zh: 名稱為新祈禱列表或期刊

source: Xiphos finds that prayer list already.
zh: Xiphos認為，名單已經祈禱。

source: Xiphos cannot create module's path: %s
zh: Xiphos不能創建模塊的路徑: %s

source: A basic prayer list. \par\par Module created by Xiphos.
zh: 一個基本的祈禱名單。\par \par 模塊創建 Xiphos。

source: BasicPrayerList
zh: 基本祈禱名單

source: MyPrayerList
zh: 我的祈禱名單

source: <b>People:</b><br>Bob<br>Sam<br>Sue<br><br><b>Church:</b><br>pews<br>fellowship<br>Bibles for missionaries<br><br><br>
zh: <b>人們:</b><br>Bob<br>Sam<br>Sue<br><br><b>教會:</b><br>教堂的長椅<br>獎學金<br>聖經的傳教士<br><br><br>

source: A subject-based prayer list. \par\par Module created by Xiphos.
zh: 一個主題為基礎的祈禱名單。 \par \par 模塊創建 Xiphos。

source: SubjectPrayerList
zh: 主題祈禱名單

source: Spiritual Growth
zh: 心靈成長

source: A monthly prayer list. \par\par Module created by Xiphos.
zh: 阿每月禱告名單。 \par \par 模塊創建 Xiphos。

source: MonthlyPrayerList
zh: 每月祈禱名單

source: A daily journal. \par\par Module created by Xiphos.
zh: 阿日報。 \par \par 模塊創建 Xiphos。

source: DailyJournal
zh: 日報

source: An outlined topic (e.g. sermon). \par\par Module created by Xiphos.
zh: 一個概述主題（例如講道）。 \par \par 模塊創建 Xiphos。

source: OutlinedTopic
zh: 專題概述

source: Major Topic A
zh: 重大課題 A

source: <b>Major Topic A</b><br>
zh: <b>重大課題 A</b><br>

source: Major Topic B
zh: 重大課題 B

source: <b>Major Topic B</b><br>
zh: <b>重大課題 B</b><br>

source: Major Topic C
zh: 重大課題 C

source: <b>Major Topic C</b><br>
zh: <b>重大課題 C</b><br>

source: User Annotation
zh: 用戶註釋

source: Search result %s: %s
zh: 搜索結果 %s: %s

source: Delete Range?
fr_fr: Supprimer les limites?
zh: 刪除範圍？

source: Are you sure you want to delete this range?
fr_fr: Êtes-vous sûr de supprimer cette sélection?
zh: 您確定要刪除此範圍內？

source: Search:
zh: 搜查:

source: Remove Module?
fr_fr: Enlever le module?
zh: 刪除模塊？

source: Are you sure you want to remove the selected module?
fr_fr: Êtes-vous certain de supprimer le module selectionné?
zh: 您確定要刪除選定的模塊？

source: %s: No such module is installed. %s
zh: %s: 沒有這樣的模塊安裝. %s

source: Please adjust the module list.
zh: 請調整模塊列表。

source: No fast-search index exists for %s.%s%s
zh: 沒有快速搜索索引存在 %s.%s%s

source: Search on this module is now `multi word'.
zh: 搜索這個模塊現在`多字'。

source: See the Module Manager, Maintenance pane.
zh: 見模塊管理，維護窗格。

source: Search finished
fr_fr: Recherche terminée
zh: 搜索完畢

source: matches
fr_fr: correspondant
zh: 比賽

source: Welcome to Xiphos. There are no Bible modules installed. In order to initialize, Xiphos needs you to install at least one Bible. With your permission, Xiphos will invoke the Module Manager so that you may install from Crosswire: 1. Configure remote install. 2. Connect. 3. Select a Bible text of your language preference. 4. Click `install'. Close the Module Manager when you are done. Warning: If you live in a persecuted country, use with care. May Xiphos invoke the Module Manager so that you may install a Bible?
zh: 歡迎 Xiphos。 沒有聖經模塊安裝。為了初始化，Xiphos需要您安裝至少一個聖經。 你允許，Xiphos將調用模塊管理器，以便您可以安裝 Crosswire： 1。配置遠程安裝。 2。連接。 3。聖經文本選擇你的語言偏好。 4。點擊'安裝'。 關閉模塊管理器當您完成。 警告：如果你住在一個受迫害的國家，請小心使用。 月Xiphos調用模塊管理器，以便您可以安裝聖經？

source: $HOME is not set!
zh: $HOME 沒有設置！

source: Xiphos can not create .xiphos: %s Xiphos cannot continue.
zh: Xiphos不能創造。xiphos： %s Xiphos無法繼續。

source: can not create
zh: 無法創建

source: There are still no Bibles installed. Evidently, you declined to install any. Without any Bible modules to display, Xiphos cannot proceed, and will now exit.
zh: 目前還沒有聖經安裝。 顯然，你拒絕安裝任何。 沒有任何聖經模塊顯示， Xiphos無法進行， 現在將退出。

source: Bible module installation complete.
zh: 聖經模塊安裝完成。

source: Without any Bible modules to display, Xiphos cannot proceed, and will now exit.
zh: 沒有任何聖經模塊顯示， Xiphos無法進行， 現在將退出。

source: verse
zh: 詩

source: chapter
zh: 章

source: Xiphos's file for language abbreviations is missing.
zh: Xiphos的文件語言 縮寫是丟失。

source: Xiphos's language abbreviation file cannot be opened.
zh: Xiphos的語言縮寫 文件無法打開。

source: Xiphos cannot allocate space for language abbreviations.
zh: Xiphos不能分配空間 語言的縮寫。

source: Xiphos cannot read the language abbreviation file.
zh: Xiphos無法讀取成 語言的縮寫文件。

source: No matching locale found for
zh: 沒有找到匹配的語言

source: Book names and menus may not be translated
zh: 圖書名稱和菜單可能不翻譯

source: Daily devotional was requested, but there are none installed.
zh: 每日虔誠的要求，但有沒有安裝。

source: Clear History
zh: 清除歷史記錄

source: URL not found:
zh: URL 未找到:

source: Xiphos could not execute %s
zh: Xiphos無法執行 %s

source: Viewer error:
zh: 瀏覽器錯誤:

source: Show %s in main window
bg: покажи %s в главния прозорец
fr_fr: Afficher %s dans la fenêtre principale
zh: 查看 %s 的主窗口

source: Document not created successfully.
zh: 文件未能成功創建。

source: Personal
bg: лични
fr_fr: Notes personnelles
zh: 個人

source: What must I do to be saved?
zh: 我必須做什麼才可以得救？

source: What is the Gospel?
zh: 什麼是福音？

source: empty document
zh: 空文檔

source: wrong type, root node != SwordBookmarks
zh: 錯誤的類型，根節點 != SwordBookmarks

source: Old Testament
zh: 舊約

source: New Testament
zh: 新約

source: Sample Module List
zh: 採樣模塊列表

source: wrong type, root node != %s
zh: 錯誤的類型，根節點 != %s

source: Add Bookmark
bg: добави отметка
zh: 添加書籤

source: Bookmark Dialog
zh: 書籤對話框

source: Bookmark Folder Treeview
zh: 書籤文件夾樹視圖

source: Cancel Bookmark
zh: 取消書籤

source: Create new folder
zh: 創建新的文件夾

source: Label Entry
zh: 標籤項

source: Label:
zh: 標籤:

source: Module Entry
zh: 模塊項:

source: Module:
zh: 模塊

source: New ...
zh: 新的...

source: New Folder
fr_fr: Nouveau dossier
zh: 新建文件夾

source: Verse Entry
zh: 詩入

source: Verse:
zh: 詩:

source: Delete the current note
zh: 刪除當前的說明

source: E_xit
zh: 走

source: Exit
bg: изход
zh: 走

source: Exit the program
zh: 退出程序

source: For_mat
zh: 格式

source: HTML Format switch
zh: HTML 格式轉換

source: HTML mode
zh: HTML 模式

source: Preview the note to be printed
zh: 預覽要打印的說明

source: Print this note
zh: 打印此說明

source: Save the current note
zh: 保存當前的說明
