Repository: crosswire/xiphos
Catalog: gnomesword1/po/*.po
Languages: es

source: About The Sword Project
es: Acerca de el Proyecto Sword

source: About Sword Modules
es: Acerca de los Módulos de Sword

source: App Height
es: Altura de la aplicación

source: Bible Texts
es: Textos Bíblicos

source: Book
es: Libro

source: Books
es: Libros

source: Default Dictionary
es: Diccionario por Omisión

source: Detach/Attach Shortcut Bar
es: Desprender/Fijar la Barra de Atajos

source: Dict/Lex
es: Diccionarios/Léxica

source: Dock Shortcut Bar
es: Anclar la Barra de Atajos

source: Font Colors and Sizes
es: Colores y Tamaños de las Fuentes

source: Font Size
es: Tamaño de las Fuentes

source: Footnotes
es: Notas de Pié de Página

source: GnomeSword - Settings
es: GnomeSword - Opciones

source: Greek Accents
es: Acentos Griegos

source: Greek Lex Viewer
es: Visualización del Lexicón Griego

source: Headings
es: Encabezados

source: Hebrew Cantillation
es: Entonación Hebrea

source: Hebrew Lex Viewer
es: Visualizador del Lexicón Hebreo

source: Hebrew Vowel Points
es: Puntos Vocales Hebreos

source: Hide/Show Shortcut Bar
es: Esconder/Mostrar la Barra de Atajos

source: In Dict/Lex Window
es: En Ventana de Diccionario/Lexicón

source: In Shortcut bar Viewer
es: En Visualizador de la Barra de Atajos

source: Lemmas
es: Lemas

source: Misc Interface Settings
es: Opciones Misceláneas de la Interfase

source: Misc
es: Misceláneos

source: Morphological Tags
es: Etiquetas Morfológicas

source: Preferences
es: Preferencias

source: Scripture Cross-reference
es: Referencia Cruzada de Versos

source: Search Book
es: Libro de Búsquedas

source: Shortcut Bar
es: Barra de Atajos

source: Shortcut Bar Settings
es: Atajo de la Barra de Opciones

source: Show Books Group
es: Mostrar Grupo de Libros

source: Show Tabs
es: Mostrar Lengüetas

source: Strong's Numbers
es: Números de Strong

source: SWORD version
es: Versión de SWORD

source: The SWORD Project is an effort to create an ever expanding software package for research and study of God and His Word. The SWORD Bible Framework allows easy manipulation of Bible texts, commentaries, lexicons, dictionaries, etc. Many frontends are build using this framework. An installed module set may be shared between any frontend using the framework.
es: El Proyecto SWORD es un esfuerzo para crear un paquete de programas de computadora en contínua expansión para la investigación y estudio de Dios y Su Palabra. El marco bíblico SWORD permite la manipulación fácil de textos bíblicos, comentarios, léxica, diccionarios, etc. Muchos programas cliente son construidos utilizando este marco. Un grupo de módulos instalados puede ser compartido entre todos los programas cliente utilizando el marco.

source: This guide will take you through the initial setup of GnomeSword
es: Esta guía le llevará a través de la instalación inicial de GnomeSword

source: Toggle Footnotes
es: Mostrar/Esconder Notas de Pié de Página

source: Toggle Morphological Tags
es: Mostrar/Esconder Etiquetas Morfológicas

source: Toggle Strongs Numbers
es: Mostrar/Esconder Números de Strong

source: Upper Pane Height
es: Altura del Pánel Superior

source: Use Default Dictionary
es: Usar Diccionario por Omisión

source: We would like to thank Troy Griffitts and all the other folks who have given us The SWORD Project.
es: Queremos agradecer a Troy Griffitts y a todas las demás personas que nos han dado el Proyecto SWORD.

source: Welcome To GnomeSword
es: Bienvenido a GnomeSword

source: where to View Dict/Lex When Link or Word Clicked
es: dónde Visualizar el Diccionario/Lexicón cuando el Enlace o Palabra es Seleccionado

source: Modules can be downloaded from the Sword Project
es: los Módulos pueden ser obtenidos de el Proyecto Sword

source: The Sword Project
es: El Proyecto Sword

source: _New SubGroup
es: _Nuevo Subgrupo

source: Add new SubGroup to selected group
es: Añadir un nuevo Subgrupo al grupo elegido

source: Add New Group
es: Añadir un Nuevo Grupo

source: Add a new root group and file
es: Añadir grupo y archivo base nuevos

source: Save Bookmarks
es: Guardar Marcas de Libro

source: Save all bookmark files
es: Guardar todas las marcas de libro

source: Edit Item
es: Editar un Ítem

source: Edit bookmark item
es: Editar un ítem de marca de libro

source: Delete Item(s)
es: Borrar Ítem(es)

source: Delete item and it's siblings
es: Borrar un ítem y sus hermanos

source: Expand All
es: Expandirlos Todos

source: Expand all Bookmarks groups
es: Expandir todos los grupos de Marcas de Libro

source: Collapse All
es: Colapsarlos Todos

source: Collapse all Bookmarks groups
es: Colapsar todos los grupos de Marcas de Libro

source: Allow Reordering
es: Permitir Reordenamiento

source: Toggle Reording - allow items to be moved by draging
es: Activar/Desactivar Reordenamiento - permitir que los ítemes sean movidos por arrastre

source: Enter SubGroup Name - use no '|'
es: Ingrese el Nombre del Subgrupo - no utilize '|'

source: Enter Group Name - use no '|'
es: Ingrese el Nombre del Grupo - no utilice '|'

source: Enter Root Group Name - use no '|'
es: Ingrese el Nombre del Grupo Base - no use '|'

source: GnomeSword - Edit Bookmark
es: GnomeSword - Editar Marca de Libro

source: Label
es: Etiqueta

source: Reference
es: Referencia

source: Module
es: Módulo

source: GnomeSword - Open Note File
es: GnomeSword - Abrir el Archivo de Notas

source: GomeSword - Save Note File
es: GnomeSword - Guardar el Archivo de Notas

source: Romans 8:28
es: Romanos 8:28

source: _Settings/
es: _Opciones/

source: Auto Save Personal Comments
es: Guardar Automáticamente los Comentarios Personales

source: Show Interlinear Page
es: Mostrar Página Interlineal

source: Verse Style
es: Estilo de Versos

source: _Quickmarks/<Separator>
es: _Marcas Rápidas/<Separador>

source: _Quickmarks/
es: _Marcas Rápidas/

source: Clear Quickmarks
es: Borrar Marcas Rápidas

source: _Quickmarks/Clear Quickmarks
es: _Marcas Rápidas/Borrar Marcas Rápidas

source: Copy
es: Copiar

source: Copy highlighted text from main window
es: Copiar el texto resaltado de la ventana principal

source: Search
es: Básqueda

source: Open search dialog
es: Abrir el diálogo de búsqueda

source: Add Quickmark
es: Añadir Marca Rápida

source: Add current verse to Quickmarks menu
es: Añadir el verso actual al menú de Marcas Rápidas

source: Edit Quickmarks
es: Editar Marcas Rápidas

source: C_lear
es: _Borrar

source: Clear history list
es: Borrar lista de historial

source: Daily Devotion
es: Devocion Diaria

source: Show the Daily Devotion for Today
es: Mostrar la Devoción Diaria para Hoy

source: Language Options
es: Opciones de Lenguaje

source: Information about Bible texts
es: Información acerca de los Textos Bíblicos

source: Commentaries
es: Comentarios

source: Dictionaries-Lexicons
es: Diccionarios y Léxica

source: Contents
es: Contenidos

source: Help Contents
es: Contenidos de Ayuda

source: About the Sword Project...
es: Acerca del Proyecto Sword...

source: Infotmation About The Sword Project
es: Información acreca del Proyecto Sword

source: Information about the installed modules
es: Información acerca de los módulos instalados

source: About GnomeSword...
es: Acerca de GnomeSword...

source: About GnomeSword
es: Acerca de GnomeSword

source: _Quickmarks
es: _Marcas Rápidas

source: _History
es: _Historia

source: GnomeSWORD - Bible Study Software
es: GnomeSword - Programa de Estudio Bíblico

source: Romans
es: Romanos

source: Go to verse in free form lookup and add verse to history
es: Ver este verso en la búsqueda de formato libre y añadirlo al historial de versos

source: Back
es: Atrás

source: Go backward through history list
es: Ir hacia atrás en la lista del historial

source: Foward
es: Adelante

source: Go foward through history list
es: Ir hacia adelante en la lista del historial

source: Exit
es: Salida

source: Exit GnomeSword
es: Salir de GnomeSword

source: Synchronize
es: Sincronizar

source: Synchronize Commentary with Bible Text
es: Sincronizar el Comentario con el Texto Bíblico

source: Print
es: Imprimir

source: Print this Comment
es: Imprimir este Comentario

source: Personal Comments
es: Comentarios Personales

source: Interlinear
es: Interlineal

source: Study Pad
es: Cuaderno de Notas

source: _History/<Separator>
es: _Historia/<Separador>

source: _History/C_lear
es: _Historia/_Borrar

source: Show %s in main window
es: Mostrar %s en la ventana principal

source: ``%s'' has been modified. Do you wish to save it?
es: ,,%s'' ha sido modificado. ¿Desea guardarlo?

source: File
es: Archivo

source: Go to Strongs %s
es: Ir a %s de Strong

source: Go to %s
es: Ir a %s

source: -untitled-
es: -sin título-

source: Save Note
es: Guardar Nota

source: Delete Note
es: Borrar Nota

source: New
es: Nuevo

source: Open
es: Abrir

source: Save
es: Guardar

source: Save AS
es: Guardar COMO

source: _Edit
es: _Editar

source: Cut
es: Cortar

source: Paste
es: Pegar

source: Spell Check
es: Revisar Ortografía

source: Undo
es: Deshacer

source: Find
es: Buscar

source: Find Next
es: Buscar Siguiente

source: Replace
es: Reemplazar

source: Link...
es: Enlazar...

source: GnomeSWORD Find
es: Búsqueda de GnomeSword

source: Enter Word or Phrase
es: Ingrese Palabra o Frase

source: Case Sensitive
es: Sensible a mayúsculas/minúsculas

source: Foward Search
es: Búsqueda hacia adelante

source: Regular Expresion
es: Expresión Regular

source: GnomeSWORD Add Reference Link
es: Añadir Enlace de Referencia GnomeSword

source: Reference
es: Referencia

source: Bible Reference or Module key to display when link is clicked
es: Clave de Referencia Bíblica o de Módulo a desplegar cuando el encadenamiento es activado

source: Name of module to show when link is clicked
es: Nombre del módulo a mostrar cuando el enlace es activado

source: GnomeSword - InfoBox
es: GnomeSword - Ventana de Información

source: in StudyPad is not saved!
es: en el Cuaderno de Notas no ha sido guardado!

source: Shall I save it?
es: ¿Lo guardo?

source: GnomeSword - Quickmark Editor
es: GnomeSword - Editor de Marcas Rápidas

source: _Quickmarks/Edit Quickmarks
es: _Marcas Rápidas/Editar Marcas Rápidas

source: GnomeSword - Quickmarks Editor
es: GnomeSword - Editor de Marcas Rápidas

source: Pick a color for Background
es: Seleccione un color para el Fondo

source: Pick a color for Bible Text
es: Seleccione un color para el Texto Bíblico

source: Zero is base font size Go up or down from there
es: Cero es el tamano base de la letra. Incremente o decremente desde allí.

source: Pick a color - CurrentVerse BG
es: Seleccione un color - Fondo del Verso Actual

source: Pick a color for Current Verse
es: Seleccione un color para el Verso Actual

source: Strongs Numbers & Morph Tags
es: Números de Strong & Etiquetas Morfológicas

source: Background Color
es: Color del Fondo

source: Text Color
es: Color del Texto

source: Current Verse Color
es: Color del Verso Actual

source: Current Verse Background Color
es: Color de Fondo del Verso Actual

source: Default Font
es: Tipo de Letra por Omisión

source: Verse Numbers
es: Números de Versos

source: Verse Number Font Size
es: Tamano del Tipo para los Números de los Versos

source: Link Color
es: Color de los Enlaces

source: Greek Font
es: Tipo de Letra Griego

source: Hebrew Font
es: Tipo de Letra Hebreo

source: Unicode Font
es: Tipo de Letra Unicode

source: GnomeSword Defaults
es: Propiedades por Omisión de GnomeSword

source: Use GnomeSword defaults for all settings on this page
es: Utilizar las propiedades por omisión de GnomeSword para todas las propiedades de esta página

source: Bible Text Window
es: Ventana de Texto Bíblico

source: Use Defaults When Opening GnomeSword
es: Utilizar Propiedades por Omisión al Iniciar GnomeSword

source: Yes, use defaults that I select
es: Sí, utilizar las propiedades por omisión que yo elija

source: No, use settings saved on last GnomeSword run
es: No, utilizar las propiedades guardadas en la sesión anterior de GnomeSword

source: Show Shortcut bar
es: Mostrar la Barra de Atajos

source: Show Bible Texts notebook tabs
es: Mostrar las lenguetas de los Textos Bíblicos

source: Show Commentary notebook tabs
es: Mostrar las lenguetas de los Comentarios

source: Show Dict/Lex notebook tabs
es: Mostrar las lenguetas de los Diccionarios/Léxica

source: No, use settings saved on last GnomeSword run
es: No, utilizar las opciones guardadas en la sesión anterior de GnomeSword

source: Use Verse Style
es: Usar Estilo de Versos

source: Show Daily Devotion
es: Mostrar Devoción Diaria

source: Show Daily Devotion if you have a Devotion module
es: Mostrar Devoción Diaria si tiene un Módlulo Devocional

source: Shortcut Bar Groups
es: Grupos de la Barra de Atajos

source: Show Favorites Group
es: Mostrar Grupo de Favoritos

source: Show Bible Text Group
es: Mostrar Grupo de Textos Bíblicos

source: Show Commentary Group
es: Mostrar Grupo de Comentarios

source: Show Dict/Lex Group
es: Mostrar Grupo de Diccionarios/Léxica

source: Show History Group
es: Mostrar Grupo Histórico

source: Use Formatting
es: Utilizar Formato

source: Auto Save
es: Guardar Automáticamente

source: Layout
es: Esquema

source: App Width
es: Ancho de la Aplicación

source: ShortCut Bar Width
es: Ancho de la Barra de Atajos

source: Upper Pane Hight
es: Altura del Pánel Superior

source: App Hight
es: Altura de la Aplicación

source: Bible Pane Width
es: Ancho del Pánel Bíblico

source: Interface
es: Interfase

source: Main Text Module
es: Módulo Principal de Texto

source: Commentary
es: Comentario

source: Greek Lexicon
es: Lexicón Griego

source: Hebrew Lexicon
es: Lexicón Hebreo

source: Daily Devotional
es: Devocional Diario

source: Interlinear 5
es: Interlineal 5

source: Interlinear 4
es: Interlineal 4

source: Your Home Directory:
es: Su Directorio Base:

source: Sword version
es: Versión de Sword

source: Sword Directory:
es: Directorio de Sword:

source: Number of Bible Text Modules:
es: Número de Módulos de Textos Bíblicos:

source: Number of Commentary Modules:
es: Número de Módulos de Comentarios:

source: Number of Lexicon / Dictionary Modules
es: Número de Módulos de Diccionarios / léxica:

source: Do you want GnomeSword to open with
es: Desea que GnomeSword inicie con

source: Settings you choose as default
es: Opciones que usted escoge por omisión

source: Settings used the last time GnomeSword ran
es: Opciones usadas la última vez que ejecutó GnomeSword

source: Settings to use on first program run
es: Opciones a usar en la primera ejecución de GnomeSword

source: Show Bible Tabs
es: Mostrar Lenguetas de Textos Bíblicos

source: Auto Save Personal comments
es: Guardar Automáticamente los Comentarios Personales

source: Show Commentary Tabs
es: Mostrar Lenguetas de Comentarios

source: Show Dict/Lex Tabs
es: Mostrar Lenguetas de Diccionarios/Léxica

source: These setting will be the default settings if you chose to use default settings.
es: Estas opciones serán las opciones por omisión si elige usar opciones por omisión

source: Thank-you for using GnomeSword. Click Finish to close this dialog and run GnomeSword.
es: Gracias por utilizar Gnomesword. Haga click en Finalizar para cerrar este diálogo y ejecutar GnomeSword.

source: Large Icons
es: Iconos Grandes

source: Small Icons
es: Iconos Pequeños

source: Add Bible Text
es: Añadir un Texto Bíblico

source: Biblical Texts
es: Textos Bíblicos

source: Add Commentary
es: Añadir un Comentario

source: Add Dictionary
es: Añadir un Diccionario

source: Lexicons / Dictionaries
es: Léxica / Diccionarios

source: Add Shortcut
es: Añadir un Atajo

source: About this Module
es: Acerca de este Módulo

source: Remove from Shortcut Bar
es: Quitar de la Barra de Atajos

source: Verse List
es: Lista de Versos

source: Search Results
es: Resultados de la Búsqueda

source: Viewer
es: Visualizador

source: Save List
es: Guardar Lista

source: Save the current verse list as a bookmark file
es: Guardar la lista de versos actual como un archivo de marcas de libro

source: Main Form
es: Forma Principal

source: Toggle to show results in Main Form
es: Activar/desactivar el mostrar los resultados en la Forma Principal

source: Show current verse list verse in Main Form
es: Mostrar la lista de versos actual en la Forma Principal

source: View Verse List
es: Ver Lista de Versos

source: View Search Results
es: Ver Resultados de la Búsqueda

source: Begin Search
es: Iniciar Búsqueda

source: Search Type
es: Tipo de Búsqueda

source: Multi Word
es: Multi-Palabra

source: Regular Expression
es: Expresión Regular

source: Exact Phrase
es: Frase Exacta

source: Search Options
es: Opciones de Búsqueda

source: Search Commentary
es: Buscar en Comentario

source: Search Personal
es: Buscar en Personal

source: Search Scope
es: Alcance de la Búsqueda

source: No Scope
es: Sin Alcance

source: Use Bounds
es: Utilizar Límites

source: Last Search
es: Ultima Búsqueda

source: Bounds
es: Límites

source: Lower
es: Inferior

source: Upper
es: Superior

source: Genesis
es: Génesis

source: Revelation
es: Apocalipsis

source: Favorites
es: Favoritos

source: Bible Text
es: Texto Bíblico

source: History
es: Historia

source: Bookmarks
es: Marcas de Libro

source: Add All Modules
es: Añadir todos los Módulos

source: Enter Unlock Key
es: Ingrese Clave

source: GnomeSword - View Commentary
es: GnomeSword - Ver Comentario

source: Sync with main window
es: Sincronizar con la ventana principal

source: Enter a verse
es: Ingrese un verso

source: Goto Verse
es: Ir a un verso

source: GnomeSword - View Dictionary
es: GnomeSword - Ver Diccionario

source: Sync
es: Sincronizar

source: Lookup key from main window
es: Clave de búsqueda de la ventana principal

source: Lookup:
es: Búsqueda:

source: Load all keys for this module
es: Cargar todas las claves de este Módulo

source: Add
es: Añadir

source: Module Options
es: Opciones del Módulo

source: Go to verse
es: Ir a un verso
